{
  "books": [
    {
      "id": 1,
      "title": "1984",
      "author": "George Orwell",
      "category": "Literary fiction",
      "releaseDate": "2021-11-24",
      "pages": 328,
      "quantitySold": 67,
      "note": "\"1984\" là một tiểu thuyết viễn tưởng xã hội của nhà văn George Orwell, xuất bản lần đầu vào năm 1949. Cuốn sách đưa chúng ta vào một thế giới tương lai u ám và độc đoán, nơi mà chính quyền tập trung tuyệt đối và quyền riêng tư bị đàn áp.\n\nCâu chuyện diễn ra trong Oceanía, một trong ba siêu quốc gia còn sót lại sau cuộc chiến lớn. Nhân vật chính là Winston Smith, một viên chức nhỏ của chính phủ, sống trong một xã hội hoàn toàn kiểm soát bởi Đảng và Big Brother - nhân vật bí ẩn và vĩ đại nhất. Mọi hoạt động của công dân đều bị theo dõi chặt chẽ, thông qua các phương tiện giám sát và quyền lực tuyệt đối của Đảng. Winston tìm kiếm sự tự do và tình yêu thật sự, nhưng cuối cùng, ông phải đối mặt với hệ quả của sự đấu tranh với sự áp đặt và sự tàn nhẫn của chế độ.\n\n\"1984\" đề cập đến những vấn đề quan trọng như chính trị áp bức, quyền riêng tư, sự kiểm soát thông qua các phương tiện truyền thông và xâm phạm vào tự do cá nhân. Cuốn sách cung cấp một cái nhìn sắc nét và đáng sợ về tương lai tiềm tàng của nhân loại nếu quyền lực bị lạm dụng và quyền tự do bị chà đạp. Nó đã trở thành một biểu tượng văn học về sự đấu tranh cho quyền tự do và sự chống lại sự đàn áp.\n\n\"1984\" được đánh giá cao về cách viết và khả năng dự đoán xã hội. Nó đã có một tác động sâu sắc đối với văn hóa và ngôn ngữ hiện đại, đặc biệt là từ các khái niệm như \"Big Brother\" và \"xã hội giám sát.\" Cuốn sách vẫn là một tác phẩm quan trọng và đáng đọc để hiểu và thảo luận về quyền tự do và tầm quan trọng của chúng trong xã hội của chúng ta.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F1%2F1984.png?alt=media&token=173ef66e-be35-4767-bff1-fa960d00c643",
      "price": 689500,
      "saleOff": 0,
      "stars": 70,
      "votes": 17
    },
    {
      "id": 2,
      "title": "Anna Karenina",
      "author": "Leo Tolstoy",
      "category": "Classics",
      "releaseDate": "2021-06-17",
      "pages": 864,
      "quantitySold": 47,
      "note": "\"Anna Karenina\" là một tiểu thuyết vĩ đại của nhà văn Leo Tolstoy, được xuất bản lần đầu vào năm 1878. Cuốn sách nằm trong những tác phẩm văn học kinh điển và đã trở thành một biểu tượng của văn học Nga.\n\nCốt truyện của \"Anna Karenina\" xoay quanh cuộc sống và tình yêu phức tạp của nhân vật chính là Anna Karenina. Anna là một phụ nữ quý tộc quyến rũ và đẹp đẽ, nhưng cô cảm thấy mất hạnh phúc trong hôn nhân của mình và sự chán chường trong cuộc sống. Khi cô gặp gỡ và rơi vào tình yêu với Vronsky, một quân nhân trẻ tuổi, cuộc sống của Anna bắt đầu thay đổi và rối ren.\n\nCuốn sách khám phá các chủ đề như tình yêu, gia đình, đấu tranh với xã hội và tìm kiếm ý nghĩa cuộc sống. Nó đi sâu vào tâm lý và suy ngẫm về nhân văn, đồng thời phản ánh xã hội Nga thời đó với các tầng lớp và quan hệ xã hội phức tạp.\n\n\"Anna Karenina\" được chú ý với ngôn ngữ sắc sảo và mô tả sắc nét của Tolstoy về tình yêu, đau khổ và xung đột nội tâm. Cuốn sách cung cấp một cái nhìn sâu sắc và tình cảm về cuộc sống, khiến người đọc suy ngẫm về tình yêu và cảm xúc con người.\n\n\"Anna Karenina\" đã trở thành một trong những tác phẩm văn học kinh điển và được coi là một trong những tiểu thuyết hay nhất mọi thời đại.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F2%2Fanna-karenina.jpg?alt=media&token=e2790e22-1226-42e6-ae47-4496247c9c4a",
      "price": 269400,
      "saleOff": 0,
      "stars": 67,
      "votes": 17
    },
    {
      "id": 3,
      "title": "Batman: The Dark Knight Returns",
      "author": "Frank Miller",
      "category": "Adventure stories",
      "releaseDate": "2021-09-10",
      "pages": 320,
      "quantitySold": 120,
      "note": "\"Batman: The Dark Knight Returns\" là một bộ truyện tranh nổi tiếng được viết và minh họa bởi Frank Miller. Được xuất bản lần đầu vào năm 1986, đây là một trong những tác phẩm quan trọng và có ảnh hưởng nhất về Batman và vũ trụ DC Comics.\n\nCâu chuyện diễn ra trong một tương lai không xa, khi Bruce Wayne đã nghỉ hưu và Batman đã biến mất khỏi thành phố Gotham trong một thời gian dài. Nhưng khi tội phạm và bạo lực trỗi dậy, Batman quyết định trở lại và mang theo sự trở lại của công lý. Cuốn truyện theo chân Batman khi anh tái xuất, phải đối mặt với những thử thách mới và đương đầu với kẻ thù nguy hiểm như Two-Face, Joker và Superman.\n\n\"Batman: The Dark Knight Returns\" mang đến một cái nhìn đậm chất bóng tối và trầm mặc về nhân vật Batman. Nó khám phá về tâm lý và tầm quan trọng của Batman trong xã hội và sự đấu tranh của anh với cả nội tại và bên ngoài. Cuốn truyện đặt câu hỏi về công lý, quyền lực và trách nhiệm của một siêu anh hùng.\n\nFrank Miller sử dụng phong cách vẽ đặc trưng và màu sắc tối để tái hiện Gotham City và các nhân vật. Cuốn truyện mang đến cho độc giả một trải nghiệm tươi sáng và đậm chất hành động với những hình ảnh nổi bật và tình tiết căng thẳng.\n\n\"Batman: The Dark Knight Returns\" đã trở thành một trong những bộ truyện tranh quan trọng và được yêu thích nhất trong vũ trụ DC Comics. Nó tạo nên một ảnh hưởng sâu sắc trong văn hóa đại chúng và đã được chuyển thể thành phim hoạt hình và phim điện ảnh. Cuốn truyện đưa ra những suy nghĩ sâu sắc về siêu anh hùng và tầm quan trọng của việc đấu tranh cho công lý.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F3%2Fbatman-the-dark-knight-returns.jpg?alt=media&token=0b2943ea-7e41-4d49-acf9-22420c35384c",
      "price": 347500,
      "saleOff": 0.08,
      "stars": 64,
      "votes": 21
    },
    {
      "id": 4,
      "title": "Crime and Punishment",
      "author": "Fyodor Dostoevsky",
      "category": "Adventure stories",
      "releaseDate": "2021-12-30",
      "pages": 576,
      "quantitySold": 28,
      "note": "\"Crime and Punishment\" (tạm dịch: \"Tội ác và Hình phạt\") là một tiểu thuyết nổi tiếng của nhà văn người Nga Fyodor Dostoevsky, xuất bản lần đầu vào năm 1866. Cuốn tiểu thuyết này được coi là một trong những tác phẩm văn học quan trọng nhất trong thế kỷ 19 và là một trong những tác phẩm nổi tiếng nhất của Dostoevsky.\n\n\"Crime and Punishment\" kể về cuộc đời của Raskolnikov, một thanh niên trẻ sống ở thành phố St. Petersburg, Nga. Raskolnikov là một sinh viên thông minh và có tri thức, nhưng anh ta sống trong cảnh nghèo khó và cảm thấy bất mãn với thế giới xung quanh. Bị ám ảnh bởi ý tưởng siêu việt rằng những người vĩ đại có quyền thực hiện tội ác để đạt được mục đích cao cả, Raskolnikov quyết định giết một người phụ nữ giàu có và lấy đi tài sản của cô.\n\nTuy nhiên, sau khi thực hiện hành động tội ác này, Raskolnikov phải đối mặt với sự hối hận và cảm thấy áp lực ngày càng gia tăng. Cuộc sống của anh ta trở nên bất ổn, và anh ta bị mắc kẹt trong một cuộc tranh đấu tâm lý giữa lương tâm và cá nhân hóa của mình. Cuối cùng, Raskolnikov phải đối mặt với hậu quả tâm lý và hình phạt vì hành động tội ác của mình.\n\n\"Crime and Punishment\" không chỉ là một câu chuyện tội phạm, mà còn là một tác phẩm tâm lý sâu sắc khám phá về ý thức con người, lương tâm và khả năng hồi phục của con người. Cuốn tiểu thuyết nổi tiếng này trình bày các khía cạnh phức tạp của tội ác, tội lỗi, sự cứu chuộc và giá trị của sự tha thứ. Nó tạo ra một hình ảnh sắc nét về cuộc sống và xã hội Nga thế kỷ 19 và đặt câu hỏi về bản chất của con người và quyền phạt đối với tội lỗi.\n\n\"Crime and Punishment\" được coi là một trong những tác phẩm vĩ đại nhất trong văn học thế giới, với sự sắc bén về phân tích tâm lý nhân vật và khả năng tái hiện chân thực cuộc sống và xã hội. Nó đã có ảnh hưởng sâu sắc đến văn học và triết học, và trở thành một trong những tác phẩm văn học Nga nổi tiếng nhất mọi thời đại.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F4%2Fcrime-and-punishment.jpg?alt=media&token=f07c6be5-4aaa-4142-8cc9-4d0edb0b1181",
      "price": 189000,
      "saleOff": 0,
      "stars": 102,
      "votes": 30
    },
    {
      "id": 5,
      "title": "Harry Potter and the Sorcerer's Stone",
      "author": "Joanne Kathleen Rowling",
      "category": "Fantasy",
      "releaseDate": "2022-07-13",
      "pages": 309,
      "quantitySold": 75,
      "note": "\"Harry Potter and the Sorcerer's Stone\" là cuốn sách đầu tiên trong loạt truyện phù thủy Harry Potter nổi tiếng của nhà văn J.K. Rowling. Cuốn sách này đã được xuất bản lần đầu vào năm 1997 và đã nhanh chóng trở thành một hiện tượng văn học toàn cầu, thu hút sự quan tâm của hàng triệu độc giả trên khắp thế giới.\n\nCuốn sách kể về cuộc phiêu lưu của cậu bé Harry Potter, một cậu bé mồ côi sống cùng gia đình dì ghẻ và chú chó duy nhất của mình. Trong ngày sinh nhật thứ 11 của Harry, anh nhận được một lá thư bí mật thông báo rằng anh là một phù thủy và đã được nhận vào Học viện Hogwarts, một trường học phù thủy nổi tiếng.\n\nKhi Harry đến Hogwarts, anh phát hiện ra rằng cha mẹ anh đã bị giết bởi một phù thủy đen tên là Lord Voldemort, nhưng anh đã sống sót duy nhất và trở thành mục tiêu của Voldemort. Harry khám phá ra rằng ông có những khả năng phép thuật đặc biệt và trở thành một trong những học sinh xuất sắc nhất trong trường.\n\nHarry nhanh chóng kết bạn với hai người bạn, Ron Weasley và Hermione Granger. Ba người họ cùng nhau khám phá thế giới phép thuật, học các môn học như phép thuật, ma thuật và tiên tri, và tham gia vào những cuộc phiêu lưu thú vị. Cuối cùng, Harry phải đối mặt với một bí ẩn lớn liên quan đến \"Hòn đá Phù thủy\", một vật thể có khả năng tạo ra sự bất tử và quyền lực vô cùng mà Voldemort đang tìm cách lấy lại.\n\n\"Harry Potter and the Sorcerer's Stone\" mang lại cho độc giả một câu chuyện hấp dẫn về tình bạn, sức mạnh và sự tìm kiếm danh vọng, đồng thời khám phá một thế giới phép thuật phong phú và huyền bí. Cuốn sách đã trở thành một hiện tượng văn hóa và đã tạo ra một dòng sản phẩm mở rộng bao gồm các phim chuyển thể, trò chơi điện tử, đồ chơi và nhiều tác phẩm nghệ thuật khác.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F5%2Fharry-potter-and-the-socrerers-stone.jpg?alt=media&token=ffaac33a-8e41-4181-8856-215270db593f",
      "price": 260000,
      "saleOff": 0.15,
      "stars": 201,
      "votes": 52
    },
    {
      "id": 6,
      "title": "On the Nature of the Universe",
      "author": "Parmenides",
      "category": "Classics",
      "releaseDate": "2022-07-14",
      "pages": 336,
      "quantitySold": 420,
      "note": "\"On the Nature of the Universe\" (tạm dịch: \"Về Bản Chất Vũ Trụ\") là một tác phẩm triết học của nhà triết gia La Mã cổ Lucretius, còn được biết đến với tên gọi \"De Rerum Natura.\" Tác phẩm này được viết vào thế kỷ thứ một trước Công nguyên và trình bày một triết lý về tự nhiên, vũ trụ và cuộc sống.\n\nTrong \"On the Nature of the Universe,\" Lucretius sử dụng thể thơ hexameter để trình bày quan điểm của mình về vũ trụ và nguyên tử. Ông khám phá các khái niệm về nguyên tử, mật độ, hình dạng và chuyển động của chúng. Lucretius mô tả vũ trụ như một hệ thống tự nhiên tuân theo quy luật tự nhiên, và ông lập luận rằng không có sự can thiệp của các thực thể siêu nhiên hay thần thánh trong sự tồn tại và hoạt động của vũ trụ.\n\nTác phẩm của Lucretius cũng khám phá về sự hình thành và phát triển của vũ trụ, quy luật thiên văn, định luật vật lý và sự tương tác giữa các yếu tố khác nhau trong tự nhiên. Ông cũng nói về sự hình thành và tiến hóa của các hình thái cuộc sống và ý thức.\n\nVề mặt triết học, \"On the Nature of the Universe\" của Lucretius đề cao tư duy, logic và lý luận khoa học. Ông phản đối sự sợ hãi và khinh suất dựa trên sự hiểu biết sai lầm và tôn giáo siêu nhiên. Tác phẩm cũng trình bày ý niệm về hạnh phúc và tìm kiếm sự cân bằng trong cuộc sống thông qua việc hiểu rõ về tự nhiên và vũ trụ.\n\n\"On the Nature of the Universe\" là một tác phẩm quan trọng trong lịch sử triết học và khoa học, đóng vai trò quan trọng trong việc truyền bá triết học Epicurean và khám phá về vật lý và tự nhiên. Tuy tác phẩm này đã bị lãng quên trong một thời gian dài, nhưng nó được khám phá lại vào thời kỳ Phục hưng và đã có ảnh hưởng sâu sắc đến triết học, khoa học và văn hóa của chúng ta.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F6%2Fon-the-nature-of-the-universe.jpg?alt=media&token=0fd0396d-ea26-42f8-aa54-4ae408d6c520",
      "price": 219200,
      "saleOff": 0,
      "stars": 87,
      "votes": 26
    },
    {
      "id": 7,
      "title": "On the Nature of Things",
      "author": "Lucretius",
      "category": "Poetry",
      "releaseDate": "2022-07-15",
      "pages": 324,
      "quantitySold": 24,
      "note": "Tựa đề quyển sách \"On the Nature of Things\" (De Rerum Natura) là một tác phẩm vĩ đại của nhà thơ và triết gia La Mã cổ Lucretius. Được viết vào thế kỷ thứ nhất trước Công nguyên, tác phẩm này thuộc thể loại văn xuôi và bao gồm khoảng 7.400 dòng thơ Latin.\n\nTác phẩm này mang đến một cái nhìn triết học về thế giới tự nhiên từ góc nhìn Epicurean. Lucretius mô tả về vũ trụ, tổ chức của vũ trụ và cấu trúc của thế giới thông qua sự giải thích về nguyên tử. Ông lập luận rằng tất cả mọi thứ trong tự nhiên đều bao gồm các hạt nhỏ nhất vô cùng - nguyên tử - và rằng mọi hiện tượng và sự thay đổi đều có thể được giải thích bằng cách nghiên cứu các sự tương tác giữa các nguyên tử này.\n\nCuốn sách đặt nặng vào việc khám phá và giải thích sự tồn tại của thế giới theo triết lý Epicurean. Nó cung cấp một cái nhìn tiên tiến đối với vũ trụ, không chỉ từ khía cạnh khoa học mà còn từ khía cạnh triết học và tâm lý. Lucretius cũng giới thiệu các khái niệm về sự thăng hoa và sự hạnh phúc, nhấn mạnh vai trò của tri thức và sự lý giải tự nhiên trong việc giải phóng con người khỏi sự phiền muộn và sợ hãi.\n\nTác phẩm \"On the Nature of Things\" không chỉ là một tác phẩm văn xuôi đáng kinh ngạc, mà còn mang đến một sự hiểu biết sâu sắc về tự nhiên và cuộc sống. Nó đã có ảnh hưởng sâu sắc đến triết học, văn học và khoa học trong hàng thế kỷ, và vẫn được coi là một trong những tác phẩm vĩ đại nhất trong lịch sử văn học La Mã cổ.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F7%2Fon-the-nature-of-things.jpg?alt=media&token=62b63964-4c07-4c26-825b-74211b21673e",
      "price": 299000,
      "saleOff": 0.05,
      "stars": 96,
      "votes": 31
    },
    {
      "id": 8,
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "category": "Romance",
      "releaseDate": "2022-07-16",
      "pages": 432,
      "quantitySold": 37,
      "note": "\"Pride and Prejudice\" (Kiêu hãnh và Định kiến) là một tiểu thuyết kinh điển của nữ văn sĩ Jane Austen. Được xuất bản lần đầu vào năm 1813, tác phẩm đã trở thành một trong những tác phẩm nổi tiếng và có ảnh hưởng nhất trong văn học tiểu thuyết lãng mạn.\n\nTrong \"Pride and Prejudice\", câu chuyện xoay quanh cuộc sống của Elizabeth Bennet, một cô gái thông minh và độc lập, và mối quan hệ phức tạp giữa cô và ngài Darcy, một người đàn ông kiêu ngạo và ban đầu bị hiểu lầm. Tiểu thuyết khám phá những khúc mắc của tình yêu, hôn nhân, tầng lớp xã hội và kỳ vọng của xã hội trong thế giới Anh thời đầu thế kỷ 19.\n\nVới tài năng quan sát sắc bén về xã hội, phong cách viết hấp dẫn và khả năng tạo ra những nhân vật đa chiều và đáng nhớ, Austen đã tạo nên một tác phẩm kinh điển. \"Pride and Prejudice\" đã vượt qua thời gian, thu hút độc giả bằng sự thông minh, tình yêu và phê phán xã hội. Tiểu thuyết tiếp tục được nghiên cứu, chuyển thể thành nhiều hình thức truyền thông khác nhau và được yêu mến bởi những người yêu văn học trên khắp thế giới.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F8%2Fpride-and-prejudice.jpg?alt=media&token=19e7834c-ae3a-4478-b0bc-e5fa3c238660",
      "price": 5690700,
      "saleOff": 0.3,
      "stars": 77,
      "votes": 18
    },
    {
      "id": 9,
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "category": "Literary fiction",
      "releaseDate": "2022-07-17",
      "pages": 384,
      "quantitySold": 78,
      "note": "\"To Kill a Mockingbird\" là một tiểu thuyết kinh điển của Harper Lee, được xuất bản lần đầu vào năm 1960. Cuốn sách thuộc thể loại tiểu thuyết hư cấu và mang tính chất xã hội, tập trung vào chủ đề phân biệt chủng tộc và sự công bằng trong xã hội Mỹ.\n\nCâu chuyện diễn ra ở thị trấn nhỏ Maycomb, bang Alabama, vào những năm 1930. Qua góc nhìn của Jean Louise \"Scout\" Finch, một cô bé lớn lên trong gia đình tài phiệt truyền thống, người đọc được trải qua một cuộc hành trình tâm lý đầy màu sắc. Trong cuộc sống hàng ngày của Scout, cô và anh trai Jem được hướng dẫn bởi cha mình, luật sư Atticus Finch, về tầm quan trọng của sự công bằng, đồng cảm và đấu tranh cho những nguyên tắc đúng đắn.\n\nCuộc sống bình dị của thị trấn Maycomb bị chấn động khi Atticus nhận nhiệm vụ bảo vệ một người đàn ông da đen bị cáo buộc hiếp dâm một phụ nữ da trắng. Mặc dù chứng cứ rõ ràng cho thấy sự vô tội của người đàn ông này, Tom Robinson, nhưng tình dục và sự kì thị chủng tộc gây ra một sự chia rẽ trong cộng đồng.\n\n\"To Kill a Mockingbird\" với tình tiết chính là cuộc phiêu lưu tuổi thơ của Scout và Jem, cùng với việc Atticus đấu tranh cho sự công bằng, tạo nên một bức tranh sắc nét về xã hội Mỹ thuộc thập kỷ 1930 và vấn đề đặc trưng của phân biệt chủng tộc.\n\nCuốn sách đạt được thành công về mặt thương mại và phê bình, nhận được giải Pulitzer văn chương vào năm 1961. \"To Kill a Mockingbird\" trở thành một trong những tác phẩm văn học quan trọng nhất của thế kỷ 20, góp phần quan trọng vào cuộc tranh luận về chủ đề phân biệt chủng tộc, sự công bằng và quyền tự do trong xã hội.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F9%2Fto-kill-a-mockingbird.jpg?alt=media&token=74f6817b-7e2f-4ba6-a610-ab746b267201",
      "price": 309000,
      "saleOff": 0.25,
      "stars": 106,
      "votes": 29
    },
    {
      "id": 10,
      "title": "The Karamazov Brothers",
      "author": "Fyodor Dostoevsky",
      "category": "Classics",
      "releaseDate": "2022-07-18",
      "pages": 840,
      "quantitySold": 113,
      "note": "\"The Karamazov Brothers\" (tạm dịch: \"Anh em nhà Karamazov\") là một tiểu thuyết kinh điển của nhà văn người Nga Fyodor Dostoevsky. Cuốn tiểu thuyết được xuất bản lần đầu vào năm 1880 và được coi là một trong những tác phẩm văn học quan trọng nhất trong lịch sử văn học thế giới.\n\n\"The Karamazov Brothers\" xoay quanh câu chuyện về gia đình Karamazov, một gia đình đầy phức tạp và đau đớn. Cuốn tiểu thuyết khám phá các vấn đề tâm linh, đạo đức, tình yêu, tội lỗi và xung đột gia đình trong bối cảnh Nga thế kỷ 19.\n\nCâu chuyện tập trung vào ba anh em Karamazov chính: Dmitri, một người đàn ông tham lam và dục vọng; Ivan, một triết gia kiêu căng; và Alexei, một tu sĩ tôn giáo. Sự xung đột giữa họ và mối quan hệ phức tạp với cha của họ, Fyodor Karamazov, tạo ra một bức tranh về tình yêu, căm hận, và sự tranh đấu về quyền lực và gia tài.\n\nCuốn tiểu thuyết cũng đặt câu hỏi về vai trò của tôn giáo và đạo đức trong cuộc sống con người. Nó khám phá những vấn đề đạo đức phức tạp và thách thức các giá trị truyền thống, đồng thời mang đến những cảm nhận sâu sắc về tình yêu và trách nhiệm.\n\n\"The Karamazov Brothers\" được coi là một kiệt tác với ngôn ngữ phong phú và sâu sắc của Dostoevsky. Cuốn sách không chỉ khám phá tâm hồn con người mà còn đặt câu hỏi về bản chất của sự tồn tại và ý nghĩa của cuộc sống. Nó đã ảnh hưởng sâu sắc đến văn học và triết học, trở thành một tác phẩm vĩ đại được nhiều người coi là một trong những tiểu thuyết hay nhất mọi thời đại.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F10%2Fthe-brothers-karamazov.jpg?alt=media&token=e4070cb6-25cc-40e6-b60d-42221a214994",
      "price": 217500,
      "saleOff": 0.1,
      "stars": 151,
      "votes": 42
    },
    {
      "id": 11,
      "title": "The Great Gatsby",
      "author": "Francis Scott Key Fitzgerald",
      "category": "Historical fiction",
      "releaseDate": "2022-07-19",
      "pages": 208,
      "quantitySold": 64,
      "note": "\"The Great Gatsby\" là một tiểu thuyết kinh điển của F. Scott Fitzgerald, xuất bản lần đầu vào năm 1925. Cuốn sách được đặt trong thập kỷ 1920, thời kỳ \"Hậu chiến tranh\" ở Mỹ, nơi mà tiền bạc, sự giàu có, và sự xa hoa của cuộc sống đều là những yếu tố quan trọng.\n\nCâu chuyện được kể từ góc nhìn của Nick Carraway, một người dân thành thị mới chuyển đến Long Island, New York. Nick kết bạn với Jay Gatsby, một người đàn ông giàu có và bí ẩn, là chủ nhân của một ngôi biệt thự đồ sộ trên bờ biển. Cuộc sống xa hoa và những bữa tiệc hoành tráng của Gatsby thu hút sự chú ý của mọi người xung quanh, nhưng bên trong, Gatsby đang tìm kiếm tình yêu đích thực của mình - Daisy Buchanan, một cô gái đẹp và giàu có.\n\n\"The Great Gatsby\" khám phá sự phân tầng xã hội, những mơ ước và tình yêu không thành, những tham vọng và sự thất bại, và tác động của tiền bạc và xa hoa lên nhân vật. Cuốn sách cung cấp một cái nhìn sắc sảo và chân thực về cuộc sống và xã hội Mỹ trong thời kỳ hậu chiến tranh.\n\n\"The Great Gatsby\" đã trở thành một tác phẩm văn học cổ điển, được đánh giá cao về cách viết, mô tả sắc nét về nhân vật và khả năng tái hiện thời đại. Nó tạo nên một hình ảnh phức tạp về những đường cong và góc tối của ước mơ Mỹ, và có sức ảnh hưởng sâu sắc đối với văn hóa và văn chương.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F11%2Fthe-great-gatsby.jpg?alt=media&token=fda145e2-7092-4d34-8f9c-c9dacfc34011",
      "price": 202000,
      "saleOff": 0.15,
      "stars": 133,
      "votes": 42
    },
    {
      "id": 12,
      "title": "The History of the Medieval World",
      "author": "TSusan Wise Bauer",
      "category": "Classics",
      "releaseDate": "2022-07-20",
      "pages": 666,
      "quantitySold": 113,
      "note": "\"The History of the Medieval World\" là một tác phẩm lịch sử đầy hấp dẫn và chi tiết, mở ra cánh cửa để khám phá sự phát triển và biến đổi của thế giới Trung cổ. Được viết bởi một tác giả có tài và nhiệt huyết với lĩnh vực này, quyển sách mang lại một cái nhìn toàn diện về cuộc sống, xã hội, văn hóa và chính trị trong thời kỳ đầy thách thức và sự thay đổi này.\n\nTừ thời kỳ thứ Tư đến thế kỷ thứ 15, \"The History of the Medieval World\" khám phá các sự kiện quan trọng, những cuộc chiến tranh đẫm máu, những thay đổi chính trị quan trọng và sự nổi lên của các quốc gia và vương triều. Tác giả không chỉ tập trung vào châu Âu, mà còn đưa ra những cái nhìn sâu sắc về các vùng đất khác nhau trên toàn thế giới, như Châu Phi, Châu Á và Châu Mỹ.\n\nQua việc khám phá sự nổi lên của Kitô giáo, sự phát triển của các vương quốc châu Âu, sự lan rộng của Kiến trúc Gotik, cuộc Thập tự chinh và sự phổ biến của Kinh Doanh và Thương mại, quyển sách mang đến một cái nhìn sâu sắc về thế giới Trung cổ và tầm ảnh hưởng của nó đến thế giới ngày nay.\n\n\"The History of the Medieval World\" không chỉ là một cuốn sách dành cho những người yêu thích lịch sử, mà còn là một nguồn tài liệu quan trọng cho những người tìm hiểu về sự tiến hóa của xã hội nhân loại và tầm ảnh hưởng của thời kỳ Trung cổ trong việc xác định thế giới hiện đại.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F12%2Fthe-history-of-the-medieval-world.jpg?alt=media&token=660d49d4-7844-49ed-826e-ccace3e5b71e",
      "price": 259600,
      "saleOff": 0,
      "stars": 49,
      "votes": 16
    },
    {
      "id": 13,
      "title": "The Lord of the Rings",
      "author": "John Ronald Reuel Tolkien",
      "category": "Classics",
      "releaseDate": "2022-07-21",
      "pages": 1178,
      "quantitySold": 206,
      "note": "\"The Lord of the Rings\" là một tiểu thuyết cao trào và đáng kinh ngạc của nhà văn J.R.R. Tolkien. Được viết vào những năm 1950, cuốn sách mang đến một thế giới tưởng tượng phức tạp và sâu sắc được gọi là Middle-earth.\n\nCốt truyện chính của cuốn sách xoay quanh một cuộc hành trình vĩ đại để tiêu diệt một chiếc nhẫn vô cùng quyền năng và đánh bại Sauron, một thủ lĩnh tà ác. Trong cuộc phiêu lưu này, chúng ta theo chân một nhóm nhân vật đa dạng, bao gồm người Hobbit Frodo Baggins, người phù thủy Gandalf, người đàn ông Aragorn, người lùn Gimli, người elf Legolas và nhiều nhân vật khác.\n\n\"The Lord of the Rings\" khám phá một văn hóa phong phú với các loài nhân, phù thủy, người lùn, người elf, người orc và nhiều sinh vật khác. Cuốn sách tạo ra một thế giới chi tiết với lịch sử, ngôn ngữ và truyền thuyết phong phú.\n\nCuốn sách mang đến những yếu tố tình cảm, lòng can đảm, tình bạn và sự hy sinh. Nó khám phá các khía cạnh đạo đức và trách nhiệm cá nhân trong cuộc chiến chống lại sự tà ác.\n\n\"The Lord of the Rings\" đã trở thành một tác phẩm văn học kinh điển và có ảnh hưởng sâu sắc trong văn hóa đại chúng. Nó đã được chuyển thể thành các bộ phim nổi tiếng, gây tiếng vang toàn cầu và làm nên tên tuổi của Tolkien trong giới văn học.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F13%2Fthe-lord-of-the-rings.jpg?alt=media&token=210cad65-528e-4891-b772-88178c4f6249",
      "price": 549000,
      "saleOff": 0.26,
      "stars": 302,
      "votes": 72
    },
    {
      "id": 14,
      "title": "The Notebook",
      "author": "Nicholas Sparks",
      "category": "Classics",
      "releaseDate": "2022-07-22",
      "pages": 214,
      "quantitySold": 57,
      "note": "The Notebook là một cuốn sách tình cảm của tác giả Nicholas Sparks. Câu chuyện tình yêu lãng mạn này kể về Noah và Allie, hai người trẻ tuổi đến từ hai thế giới khác nhau. Họ gặp nhau và đem lòng yêu nhau trong một mùa hè tuyệt đẹp ở thành phố nhỏ của North Carolina.\n\nTuy nhiên, cuộc sống và sự xung đột gia đình đã chia cắt họ. Noah, một người lính trẻ tham gia Thế chiến II, và Allie, một cô gái trẻ quyết định đi theo gia đình và xây dựng cuộc sống mới. Trải qua thời gian và nhiều biến cố, tình yêu của họ vẫn tồn tại và trưởng thành theo thời gian.\n\nCuốn sách kể câu chuyện tình yêu mãnh liệt, lòng trung thành và sức mạnh của ký ức. Nó khám phá những khía cạnh sâu sắc của tình yêu và lòng nhân ái, đặt câu hỏi về giá trị thực sự của thời gian và sự hy sinh.\n\nThe Notebook đã trở thành một bestseller và được chuyển thể thành bộ phim nổi tiếng, mang lại cảm xúc mạnh mẽ và gợi nhắc về sự quý giá của tình yêu và kỷ niệm.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F14%2Fthe-notebook.jpg?alt=media&token=ba649f09-121c-407e-90ed-a78bf19767cb",
      "price": 360700,
      "saleOff": 0.12,
      "stars": 199,
      "votes": 46
    },
    {
      "id": 15,
      "title": "The Catcher in the Rye",
      "author": "Jerome David Salinger",
      "category": "Fantasy",
      "releaseDate": "2022-07-23",
      "pages": 234,
      "quantitySold": 75,
      "note": "\"The Catcher in the Rye\" là một quyển tiểu thuyết nổi tiếng của nhà văn J.D. Salinger, được xuất bản lần đầu vào năm 1951. Cuốn sách này đã trở thành một trong những tác phẩm văn học kinh điển của thế kỷ 20 và tiếp tục thu hút sự quan tâm của nhiều độc giả trên khắp thế giới cho đến ngày nay.\n\n\"The Catcher in the Rye\" kể về cuộc sống của nhân vật chính, Holden Caulfield, một cậu thiếu niên 16 tuổi. Qua lời kể của Holden, chúng ta được chứng kiến cuộc phiêu lưu của cậu trong thế giới đầy bất công, giả tạo và những thất vọng. Holden là một người rất đặc biệt, cảm xúc và cũng đầy mâu thuẫn. Mặc dù có sự thông minh và sự nhạy bén đặc biệt, Holden thường cảm thấy lạc lõng và khó hiểu với những giá trị và đạo đức của xã hội xung quanh mình.\n\nCuốn sách tập trung vào cuộc sống nội tâm của Holden, những suy nghĩ sâu sắc, sự phân vân và những xung đột với xã hội. Cậu ta đi lang thang qua New York trong một ngày đông lạnh và trải qua nhiều trải nghiệm gặp gỡ với những người khác nhau, từ các nhân viên khách sạn, giáo viên đến những người bạn cũ và người lạ. Mặc dù Holden thường cảm thấy cô đơn và tuyệt vọng, quan điểm của cậu về cuộc sống và con người lại làm cho cuốn sách trở nên độc đáo và thú vị.\n\n\"The Catcher in the Rye\" đã được đánh giá cao về cách tạo hình nhân vật và ngôn ngữ sắc sảo. Nó cung cấp một cái nhìn sâu sắc và chân thực vào tâm lý của một người trẻ tuổi, bày tỏ sự phản đối đối với những bất công và giả tạo trong xã hội. Cuốn sách cũng đặt ra nhiều câu hỏi về sự trưởng thành, đồng thời tạo ra sự suy tư và tranh cãi trong giới văn học.\n\n\"The Catcher in the Rye\" đã ảnh hưởng sâu sắc đến văn học và văn hóa phương Tây. Nó được coi là một biểu tượng của sự tuổi trẻ và sự phản kháng trước xã hội, và là một tác phẩm văn học cổ điển được nhiều người yêu thích và theo dõi.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F15%2Fthe-catcher-in-the-rye.jpg?alt=media&token=1ee29288-4156-4f92-8ea0-a2ca56fd7d09",
      "price": 324000,
      "saleOff": 0,
      "stars": 102,
      "votes": 29
    },
    {
      "id": 16,
      "title": "Moby-Dick",
      "author": "Herman Melville",
      "category": "Fantasy",
      "releaseDate": "2022-07-24",
      "pages": 378,
      "quantitySold": 420,
      "note": "\"Moby-Dick\" là một tác phẩm văn học kinh điển của Mỹ, được viết bởi nhà văn Herman Melville và xuất bản lần đầu vào năm 1851. Cuốn sách này là một trong những tác phẩm văn học quan trọng nhất và có sự ảnh hưởng sâu sắc đến văn hóa và nghệ thuật.\n\n\"Moby-Dick\" kể về cuộc phiêu lưu của thuyền trưởng Ahab và tàu Pequod trong việc săn đuổi con cá voi trắng khổng lồ mang tên Moby-Dick. Ahab là một nhân vật đầy nhiệt huyết và quyết tâm, nhưng cũng bị ám ảnh bởi sự trả thù đối với con cá voi đã làm mất chân của mình. Cuộc hành trình trên biển của Ahab và thủy thủ trên tàu Pequod là một cuộc chiến không chỉ với con cá voi huyền thoại, mà còn là cuộc chiến với tự nhiên, số phận và những điều bí ẩn của cuộc sống.\n\nTuy là một cuộc săn cá voi, \"Moby-Dick\" không chỉ đơn thuần là một câu chuyện phiêu lưu trên biển. Cuốn sách đi sâu vào những khía cạnh văn hóa, tôn giáo, tâm lý và con người. Melville đặt ra những câu hỏi sâu sắc về tồn tại, ý nghĩa cuộc sống và những mâu thuẫn của con người trong cuộc đối đầu với một thế giới khắc nghiệt và bí ẩn.\n\n\"Moby-Dick\" được đánh giá cao về khả năng tạo hình nhân vật, sự sắc sảo của ngôn ngữ và sự sáng tạo về kỹ thuật viết. Cuốn sách kết hợp giữa những đoạn miêu tả tường tận về cuộc sống trên biển, những phân tích tâm lý sâu sắc về nhân vật và những suy ngẫm triết học sâu xa.\n\n\"Moby-Dick\" không chỉ được xem là một tác phẩm văn học kinh điển của Mỹ mà còn là một tác phẩm có ảnh hưởng sâu sắc đến văn học thế giới. Nó tạo ra một cảm hứng mãnh liệt đối với nhiều tác phẩm sau này và trở thành biểu tượng của sự khao khát khám phá, cuộc sống và sự đấu tranh của con người trước những điều vĩnh viễn vượt xa sự hiểu biết.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F16%2Fmoby-dick.jpg?alt=media&token=c9c06576-8071-457d-8915-e8b8b01db4fc",
      "price": 218000,
      "saleOff": 0.05,
      "stars": 223,
      "votes": 61
    },
    {
      "id": 17,
      "title": "The Odyssey",
      "author": "Homer",
      "category": "Poetry",
      "releaseDate": "2022-07-25",
      "pages": 541,
      "quantitySold": 24,
      "note": "\"The Odyssey\" là một trong những tác phẩm văn học cổ điển lớn nhất của thời kỳ Hy Lạp cổ đại, được cho là được viết bởi nhà thơ Homer. Được viết vào thế kỷ thứ 8 trước Công nguyên, cuốn sách này kể về cuộc phiêu lưu huyền thoại của nhân vật chính, Odysseus (còn được gọi là Ulysses), trong hành trình trở về quê hương sau cuộc chiến thành Troia.\n\n\"The Odyssey\" bắt đầu sau sự kiện của \"Iliad\", một tác phẩm khác của Homer, và mô tả cuộc hành trình kéo dài mười năm của Odysseus trên biển và trong các hòn đảo của Địa Trung Hải. Cuốn sách này trình bày những gian khổ và hiểm nguy mà Odysseus và đồng đội phải đối mặt, từ cuộc chiến với các sinh vật huyền thoại như Cyclops, giao tranh với hậu duệ của Poseidon đến việc gặp gỡ với các vị thần và nhân vật huyền thoại khác.\n\nTrong cuộc hành trình của mình, Odysseus trải qua nhiều thử thách và khám phá sự mạnh mẽ của lòng kiên nhẫn, sự thông minh và lòng dũng cảm. Cuốn sách tạo ra một hình ảnh sâu sắc về con người và tình cảm nhân văn thông qua cuộc phiêu lưu và những câu chuyện đan xen. Nó cũng mang đến những thông điệp về sự giả dối, lòng trung thành và ý chí vượt qua khó khăn.\n\n\"The Odyssey\" không chỉ là một câu chuyện phiêu lưu mạo hiểm mà còn là một tác phẩm nghệ thuật đỉnh cao của văn học cổ điển. Với ngôn ngữ tinh tế và mạch truyện sắc sảo, Homer sáng tạo ra một thế giới đầy phép thuật và sự tưởng tượng đáng kinh ngạc. Cuốn sách đã ảnh hưởng sâu sắc đến văn hóa và nghệ thuật phương Tây, từ văn chương và nghệ thuật hình ảnh đến âm nhạc và điện ảnh.\n\n\"The Odyssey\" là một tác phẩm cổ điển vĩ đại, làm thể hiện tài năng văn chương của Homer và truyền cảm hứng cho nhiều thế hệ tác giả và độc giả sau này. Nó khám phá về con người và cuộc sống, đưa chúng ta vào một cuộc hành trình đầy kỳ diệu và giúp chúng ta hiểu sâu hơn về bản chất và giá trị của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F17%2Fthe-odyssey.jpg?alt=media&token=79a50ed3-ae3f-41bd-a6bf-652f2eb99988",
      "price": 3090300,
      "saleOff": 0.09,
      "stars": 119,
      "votes": 29
    },
    {
      "id": 18,
      "title": "Jane Eyre",
      "author": "Charlotte Brontë",
      "category": "Romance",
      "releaseDate": "2022-07-26",
      "pages": 624,
      "quantitySold": 37,
      "note": "\"Jane Eyre\" là một cuốn tiểu thuyết lãng mạn kinh điển của nữ nhà văn người Anh Charlotte Brontë. Được xuất bản lần đầu vào năm 1847, cuốn sách nhanh chóng trở thành một tác phẩm nổi tiếng và có ảnh hưởng lớn đối với văn học thế giới.\n\n\"Jane Eyre\" kể về cuộc sống và cuộc phiêu lưu của nhân vật chính, Jane Eyre, một cô gái trẻ mồ côi. Cuộc sống của Jane bắt đầu trong một gia đình đầy bạo lực và bất công, nơi cô phải chịu đựng những đối xử tàn ác và bị coi thường. Sau đó, Jane được gửi đến trường Lowood, nơi cô phát triển sự thông minh và tìm thấy sự độc lập. Khi trưởng thành, Jane trở thành giáo viên và sau đó làm guvernante cho một ngôi nhà xa lạ, Thornfield Hall, nơi cô phải đối mặt với tình yêu và những bí mật kinh hoàng của gia đình chủ nhà.\n\n\"Jane Eyre\" không chỉ là một câu chuyện tình yêu lãng mạn, mà còn mang trong mình những yếu tố xã hội và tâm lý phức tạp. Cuốn sách đặt câu hỏi về sự bình đẳng giới tính, quyền tự do cá nhân và lòng trung thành. Nhân vật Jane Eyre được tạo hình là một người phụ nữ độc lập, có sự mạnh mẽ và lòng can đảm để đối mặt với thử thách trong cuộc sống. Câu chuyện cũng khám phá về ý chí và quyền tự quyết của cá nhân trong việc tạo dựng cuộc sống của mình.\n\nCuốn sách được viết bằng ngôn ngữ tinh tế và mạch truyện hấp dẫn. Charlotte Brontë đã tạo ra một tác phẩm văn học sắc sảo và giàu cảm xúc, với việc khắc họa sâu sắc về tâm lý nhân vật và mô tả tuyệt vời về cảnh quan và bối cảnh thời đại. \"Jane Eyre\" đã tạo nên một tiếng nói mạnh mẽ cho phụ nữ và mang đến những cống hiến về văn học, đồng thời tạo ra sự lan tỏa văn hóa và cảm hứng cho nhiều tác phẩm sau này.\n\n\"Jane Eyre\" là một trong những cuốn tiểu thuyết kinh điển quan trọng của văn học thế giới. Nó không chỉ đáng để đọc vì câu chuyện đầy cảm xúc và những tình tiết hấp dẫn, mà còn vì khả năng của nó để khám phá về bản chất con người, quyền tự do và tình yêu thương.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F18%2Fjane-eyre.jpg?alt=media&token=3e2c3214-9fb6-44ad-818c-f24259a3490a",
      "price": 369000,
      "saleOff": 0.1,
      "stars": 201,
      "votes": 46
    },
    {
      "id": 19,
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "category": "Literary fiction",
      "releaseDate": "2022-07-27",
      "pages": 311,
      "quantitySold": 78,
      "note": "\"Brave New World\" là một tiểu thuyết viễn tưởng đình đám của nhà văn Aldous Huxley, xuất bản lần đầu vào năm 1932. Cuốn sách này tạo dựng một tương lai xa xôi, nơi xã hội được tổ chức theo một cách hoàn toàn khác biệt và sự tổ chức xã hội, công nghệ và tình yêu được đặt vào khía cạnh đầy tác động.\n\nTrong \"Brave New World,\" xã hội được chia thành các lớp xã hội được kiểm soát và kiểm soát chặt chẽ. Mọi khía cạnh của cuộc sống, từ việc sinh sản và giáo dục đến sở thích và giải trí, đều được quản lý bởi chính phủ và công nghệ tiên tiến. Các công dân sống trong một trạng thái thoải mái và sự mãn nguyện nhờ vào sự kiểm soát tối đa và sự loại bỏ của các cảm xúc tiêu cực.\n\nCuộc sống của nhân vật chính, Bernard Marx, và người bạn Lenina Crowne bị xáo trộn khi họ tình cờ đến một nơi không bị kiểm soát, một bộ lạc ngoài cuộc sống xã hội hiện tại. Sự trải nghiệm của họ tại đây và gặp gỡ với John, một người sống ở nơi đó, dẫn đến sự phân định và tranh cãi về tự do, cá nhân và giá trị con người.\n\n\"Brave New World\" tạo ra một tác phẩm viễn tưởng sắc sảo và gợi mở về tương lai của nhân loại. Cuốn sách nêu bật các vấn đề như tác động của công nghệ và xã hội đến cuộc sống con người, sự đánh đổi giữa tự do cá nhân và sự ổn định xã hội, và những hệ quả của sự mất mát con người trong một xã hội tiên tiến.\n\n\"Brave New World\" đã trở thành một tác phẩm văn học kinh điển, tạo ảnh hưởng lớn đến văn hóa và xã hội. Nó thúc đẩy cuộc tranh luận và suy nghĩ về tương lai của nhân loại, đặt ra câu hỏi về sự tự do, cá nhân và giá trị nhân đạo. Cuốn sách vẫn là một tác phẩm quan trọng và tiếp tục được đọc và nghiên cứu rộng rãi đến ngày nay.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F19%2Fbrave-new-world.jpg?alt=media&token=1db32b1b-d9ba-47af-9188-af24b9426348",
      "price": 120800,
      "saleOff": 0,
      "stars": 121,
      "votes": 34
    },
    {
      "id": 20,
      "title": "The Chronicles of Narnia",
      "author": "Clive Staples Lewis",
      "category": "Classics",
      "releaseDate": "2022-07-28",
      "pages": 766,
      "quantitySold": 113,
      "note": "\"The Chronicles of Narnia\" là một loạt tiểu thuyết viễn tưởng kỳ diệu của nhà văn C.S. Lewis. Loạt sách gồm 7 tập và được xuất bản trong khoảng thời gian từ năm 1950 đến năm 1956. Các tập sách được xếp theo thứ tự xuất bản như sau: \"The Lion, the Witch and the Wardrobe\" (Sư tử, Phù thủy và Tủ áo), \"Prince Caspian,\" \"The Voyage of the Dawn Treader\" (Chuyến du hành trên Tàu Ánh Sáng), \"The Silver Chair\" (Ghế bạc), \"The Horse and His Boy\" (Con ngựa và chú - Bé), \"The Magician's Nephew\" (Người cháu phù thủy), và \"The Last Battle\" (Trận chiến cuối cùng).\n\n\"The Chronicles of Narnia\" kể về các cuộc phiêu lưu kỳ diệu của nhóm trẻ em, bao gồm Peter, Susan, Edmund, và Lucy Pevensie, cùng với nhiều nhân vật khác, khi họ khám phá vương quốc Narnia - một thế giới thần thoại được tạo ra bởi Aslan, con sư tử biểu tượng. Trong các cuộc phiêu lưu của mình, nhóm trẻ em gặp gỡ các nhân vật huyền thoại, chiến đấu với ác quỷ và phù thủy, và trải qua những thử thách tâm linh và đạo đức.\n\nLoạt sách mang đến những câu chuyện hấp dẫn và lôi cuốn, kết hợp giữa các yếu tố như phiêu lưu, phép thuật, tình bạn, và sự phản kháng chống lại ác quỷ. Lewis thông qua \"The Chronicles of Narnia\" mang đến những thông điệp về lòng nhân ái, tình yêu và lòng dũng cảm, đồng thời đề cao giá trị đạo đức và trách nhiệm cá nhân.\n\nCuốn sách đã thu hút sự yêu thích của nhiều độc giả trên toàn thế giới và trở thành một biểu tượng của văn học trẻ em và trưởng thành. Nó đã được chuyển thể thành các bộ phim, phim truyền hình và vở kịch, nổi tiếng với sự tưởng tượng phong phú và thông điệp sâu sắc về tình yêu và lòng hi sinh.\n\n\"The Chronicles of Narnia\" là một loạt sách đáng yêu và sôi động, mang đến cho độc giả một thế giới phép thuật tuyệt vời và những câu chuyện đầy ý nghĩa về sự trưởng thành và khám phá bản thân.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F20%2Fthe-chronicles-of-narnia.jpg?alt=media&token=7306cacc-bdee-4b08-a0e2-a1ced9eb0639",
      "price": 260000,
      "saleOff": 0,
      "stars": 194,
      "votes": 56
    },
    {
      "id": 21,
      "title": "To the Lighthouse",
      "author": "Virginia Woolf",
      "category": "Historical fiction",
      "releaseDate": "2022-07-29",
      "pages": 209,
      "quantitySold": 64,
      "note": "\"To the Lighthouse\" là một tiểu thuyết lớn của nhà văn Virginia Woolf, được xuất bản lần đầu vào năm 1927. Cuốn sách này được coi là một trong những tác phẩm quan trọng nhất của thế kỷ 20 và là một biểu tượng của phong cách viết hiện đại và tâm lý sâu sắc.\n\n\"To the Lighthouse\" được chia thành ba phần. Phần đầu tiên, \"The Window\" (Cửa sổ), mô tả những suy nghĩ và nhận thức nội tâm của các nhân vật trong gia đình Ramsay. Phần thứ hai, \"Time Passes\" (Thời gian trôi qua), tập trung vào sự thay đổi của gia đình và biến động xã hội trong thời gian của Chiến tranh thế giới thứ nhất. Phần cuối cùng, \"The Lighthouse\" (Ngọn hải đăng), theo chân các nhân vật trong hành trình của họ đến hải đăng nơi họ hy vọng tìm thấy sự thỏa mãn và hiểu biết.\n\nCuốn sách thách thức các khuôn khổ truyền thống của tiểu thuyết và tạo ra một trải nghiệm đọc độc đáo. Nó tập trung vào nhân vật và suy nghĩ, thay vì vào câu chuyện và cốt truyện. Woolf sử dụng các phương pháp viết hiện đại như luồng ý thức và mô phỏng tiến triển tâm lý để tái hiện suy nghĩ phức tạp và tình cảm của các nhân vật.\n\n\"To the Lighthouse\" đặt ra những câu hỏi về thời gian, tình yêu, tồn tại và ý nghĩa cuộc sống. Cuốn sách khám phá về sự truyền cảm hứng và sự tiến triển của nghệ thuật và văn chương trong một thế giới không ổn định và bất ổn. Nó cũng khám phá về vai trò và vai trò của phụ nữ trong xã hội và gia đình.\n\n\"To the Lighthouse\" đã trở thành một tác phẩm văn học cổ điển và làm nổi bật tài năng văn chương của Virginia Woolf. Cuốn sách tạo ra ảnh hưởng sâu sắc trong văn học hiện đại và vẫn là một tác phẩm được nghiên cứu và đánh giá cao đến ngày nay.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F21%2Fto-the-lighthouse.jpg?alt=media&token=86782fc8-e9e7-41f2-9b29-5dd0f3c95430",
      "price": 439500,
      "saleOff": 0.21,
      "stars": 92,
      "votes": 26
    },
    {
      "id": 22,
      "title": "One Hundred Years of Solitude",
      "author": "Gabriel García Márquez",
      "category": "Classics",
      "releaseDate": "2022-07-30",
      "pages": 666,
      "quantitySold": 113,
      "note": "\"One Hundred Years of Solitude\" (Tựa Việt: \"Trăm năm cô đơn\") là một tiểu thuyết kỳ diệu của nhà văn Gabriel García Márquez, được xuất bản lần đầu vào năm 1967. Cuốn sách này được coi là một tác phẩm văn học vĩ đại và đã mang đến giải Nobel Văn học cho Márquez năm 1982.\n\n\"One Hundred Years of Solitude\" kể về gia đình Buendía qua nhiều thế hệ ở thị trấn Macondo, một nơi hư cấu tại vùng đất Mỹ Latinh. Cuốn sách mang đến một thế giới phép thuật và kỳ diệu, nơi thực tại và huyền bí xen lẫn vào nhau. Márquez tạo ra một mạch truyện phức tạp với các sự kiện lịch sử, tình yêu, chiến tranh, và một loạt nhân vật phong phú và đa chiều.\n\nCuốn sách mô tả không chỉ sự phát triển và tàn lụi của gia đình Buendía mà còn là sự tương tác của họ với xã hội và văn hóa xung quanh. Nó khám phá về sự cô đơn, tình yêu, tham vọng, và những mâu thuẫn của con người. Cuốn sách cũng chứa đựng những yếu tố thần thoại và thần tiên, đi kèm với việc xem xét các khía cạnh về lịch sử, địa lý và chính trị.\n\n\"One Hundred Years of Solitude\" được biết đến với phong cách viết mang tính thơ ca, mà Márquez gọi là \"thực tế kỳ diệu\". Ngôn ngữ của cuốn sách lôi cuốn, giàu tượng phong phú và sự tưởng tượng sáng tạo. Nó đã tạo nên một ảnh hưởng sâu sắc đối với văn học thế giới và trở thành một tác phẩm nghệ thuật quan trọng của thế kỷ 20.\n\n\"One Hundred Years of Solitude\" là một tác phẩm kỳ diệu và phức tạp, khám phá về con người và cuộc sống. Nó truyền cảm hứng và tạo ra sự suy ngẫm về tồn tại, thời gian và ý nghĩa cuộc sống. Cuốn sách đòi hỏi sự tập trung và thảo luận sâu sắc, và đã trở thành một tác phẩm văn học quan trọng và đáng kinh ngạc của văn chương Latinh Mỹ.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F22%2Fone-hundred-years-of-solitude.jpg?alt=media&token=9cb4f2fa-1a69-4e20-a3bf-a3d3cefad4e9",
      "price": 211500,
      "saleOff": 0,
      "stars": 110,
      "votes": 28
    },
    {
      "id": 23,
      "title": "The Hobbit",
      "author": "John Ronald Reuel Tolkien",
      "category": "Fantasy",
      "releaseDate": "2022-07-31",
      "pages": 300,
      "quantitySold": 206,
      "note": "\"The Hobbit\" là một cuốn tiểu thuyết kỳ ảo của nhà văn J.R.R. Tolkien, xuất bản lần đầu vào năm 1937. Đây là câu chuyện tiền truyện của cuốn tiểu thuyết kinh điển \"The Lord of the Rings\" của Tolkien.\n\n\"The Hobbit\" kể về cuộc phiêu lưu của nhân vật chính, Bilbo Baggins, một người Hobbit nhỏ bé và ôn hòa. Bilbo bất ngờ được mời tham gia vào một cuộc hành trình của một nhóm người lùn dẫn đầu bởi Thorin Oakenshield. Họ cùng nhau hướng đến Erebor, ngôi nhà của các người lùn, mà đã bị Smaug, một con rồng khổng lồ, chiếm đoạt. Trong cuộc hành trình đầy nguy hiểm, Bilbo phải đối mặt với những quái vật, trải qua thử thách và khám phá những bí ẩn của vùng đất Middle-earth.\n\n\"The Hobbit\" tạo ra một thế giới kỳ diệu với các loài sinh vật huyền thoại như người lùn, con rồng, người elf và goblin. Cuốn sách kết hợp giữa những yếu tố phiêu lưu, giả tưởng và hài hước, tạo nên một câu chuyện thú vị và lôi cuốn. Tuy là một tiểu thuyết thiếu niên, \"The Hobbit\" cũng chứa đựng thông điệp về lòng dũng cảm, tình bạn và sự trưởng thành.\n\nTolkien sử dụng ngôn ngữ tươi sáng và mô tả tinh tế để tái hiện các cảnh vật và nhân vật phong phú trong Middle-earth. Cuốn sách mang đến cho độc giả một cảm giác như đang được lạc vào một thế giới hoàn toàn khác biệt, nơi họ có thể khám phá những điều mới mẻ và thú vị.\n\n\"The Hobbit\" đã trở thành một trong những tác phẩm kinh điển của văn học giả tưởng. Nó đã tạo ra một ảnh hưởng sâu sắc và trở thành nguồn cảm hứng cho nhiều tác phẩm sau này, không chỉ trong văn chương mà còn trong điện ảnh, trò chơi điện tử và văn hóa đại chúng. Cuốn sách mang đến cho độc giả một hành trình phiêu lưu đầy mê hoặc và trở thành một biểu tượng của trí tưởng tượng và sức mạnh của câu chuyện.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F23%2Fthe-hobbit.jpg?alt=media&token=1aceda0e-19dd-41c8-ba6f-0ab7c42f09ba",
      "price": 469000,
      "saleOff": 0.15,
      "stars": 304,
      "votes": 80
    },
    {
      "id": 24,
      "title": "The Grapes of Wrath",
      "author": "John Steinbeck",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 464,
      "quantitySold": 57,
      "note": "\"The Grapes of Wrath\" là một tiểu thuyết vĩ đại của nhà văn John Steinbeck, xuất bản lần đầu vào năm 1939. Cuốn sách này kể về cuộc sống của một gia đình nông dân, gia đình Joad, trong thời kỳ Đại suy thoái ở Hoa Kỳ và hành trình của họ từ tiểu bang Oklahoma đến California để tìm kiếm một tương lai tốt hơn.\n\n\"The Grapes of Wrath\" mô tả một thời kỳ khó khăn và đau khổ đối với nông dân Hoa Kỳ trong thập kỷ 1930 khi khủng hoảng kinh tế gây ra khô hạn, đánh mất việc làm và đẩy hàng triệu người trở nên vô gia cư. Cuốn sách tập trung vào sự đấu tranh của gia đình Joad để vượt qua nghịch cảnh và tìm kiếm hy vọng trong một thế giới không công bằng và tàn bạo.\n\nSteinbeck sử dụng ngôn ngữ chân thực và mô tả sống động để tái hiện cuộc sống của người dân nghèo đói, sự áp bức của các sở hữu đất và sự khát vọng tự do và công bằng xã hội. Cuốn sách đưa ra một cái nhìn sắc sảo về cuộc sống nông dân và vấn đề xã hội trong một thời kỳ khó khăn.\n\n\"The Grapes of Wrath\" không chỉ là một câu chuyện về gia đình Joad mà còn là một cuộc hành trình của con người tìm kiếm hy vọng và lòng nhân đạo giữa những nghịch cảnh khắc nghiệt. Cuốn sách mang đến cho độc giả một cái nhìn sâu sắc và cảm động về tình cảnh con người và vấn đề xã hội.\n\n\"The Grapes of Wrath\" đã trở thành một tác phẩm văn học kinh điển và tạo nên một ảnh hưởng sâu sắc đối với văn học và xã hội. Nó đạt được giải Pulitzer vào năm 1940 và vẫn được coi là một trong những tác phẩm xuất sắc nhất của Steinbeck và văn học Mỹ. Cuốn sách thể hiện sự mạnh mẽ và lòng thông cảm đối với cuộc sống con người và là một cuộc gọi cho sự công bằng và lòng nhân đạo trong xã hội.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F24%2Fthe-grapes-of-wrath.jpg?alt=media&token=e3c76a69-7721-4d52-b188-4fdfa90ed33f",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 25,
      "title": "Frankenstein",
      "author": "Mary Shelley",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 258,
      "quantitySold": 57,
      "note": "\"Frankenstein\" là một tiểu thuyết kinh điển của nhà văn Mary Shelley, xuất bản lần đầu vào năm 1818. Cuốn sách này mang đến một trong những câu chuyện ma quái nổi tiếng nhất và trở thành biểu tượng trong văn học kỳ bí và khoa học viễn tưởng.\n\n\"Frankenstein\" kể về câu chuyện của Victor Frankenstein, một nhà khoa học trẻ tài năng, người đã tạo ra một sinh vật khổng lồ từ các mảnh ghép cơ thể đã chết. Tuy nhiên, khi sinh vật cất tiếng sống, Victor kinh hoàng và phản bội nó, để lại sinh vật phải đối mặt với sự cô đơn và tìm kiếm ý nghĩa tồn tại. Cuộc phiêu lưu của sinh vật và cuộc truy đuổi giữa hai nhân vật chính tạo nên cốt truyện gợi suy ngẫm về tình cảm, trách nhiệm, và ý nghĩa của cuộc sống.\n\n\"Frankenstein\" đặt ra những câu hỏi về tác động của khoa học và công nghệ đối với con người và tự nhiên. Nó khám phá về khả năng và trách nhiệm của nhà khoa học, cùng với viễn cảnh một thế giới nếu không kiểm soát được những khía cạnh đen tối trong con người.\n\nCuốn sách tạo ra ảnh hưởng lớn trong văn học và trở thành một biểu tượng của thể loại kinh dị và khoa học viễn tưởng. \"Frankenstein\" mang đến cho độc giả một cảm giác đáng sợ và huyền bí, cùng với việc đặt ra câu hỏi về ý nghĩa và giới hạn của sự sáng tạo.\n\n\"Frankenstein\" của Mary Shelley là một tác phẩm văn học đáng kinh ngạc, khám phá về sự khát vọng và mưu cầu của con người, sự đối đầu với sự cô đơn và ý nghĩa của sự tồn tại. Cuốn sách tiếp tục là một tác phẩm quan trọng trong văn học và tiếp tục lan truyền thông điệp về tình cảm, trách nhiệm và hậu quả của việc chơi đùa với sức mạnh của thiên nhiên.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F25%2Ffrankenstein.jpg?alt=media&token=7339a7ef-141f-44cd-8fcc-7fe25f6d04b3",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 213,
      "votes": 53
    },
    {
      "id": 26,
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 288,
      "quantitySold": 57,
      "note": "\"The Picture of Dorian Gray\" là một tiểu thuyết kinh điển của nhà văn Oscar Wilde, xuất bản lần đầu vào năm 1890. Cuốn sách này mang đến một câu chuyện đen tối và tưởng tượng về sự thay đổi và sự mất mát của vẻ đẹp và tình dục.\n\n\"The Picture of Dorian Gray\" tập trung vào nhân vật chính, Dorian Gray, một thanh niên trẻ đẹp và quyến rũ. Sau khi được vẽ một bức tranh về mình bởi họa sĩ Basil Hallward, Dorian có một ước nguyện rằng thời gian sẽ không làm thay đổi nhan sắc của anh ta, mà thay vào đó, tranh sẽ lão hóa và chịu đựng sự đồi dần của tuổi tác. Trong quá trình cuộc sống với cuộc sống xa hoa và tình dục tự do, Dorian trở nên tàn nhẫn và hủy hoại, trong khi bức tranh trên tường thể hiện những vết thương và sự xấu đi của tâm hồn của anh ta.\n\nCuốn sách đề cập đến nhiều chủ đề như tình yêu, tàn phá và sự đối mặt với hậu quả của hành động. Oscar Wilde tạo ra một câu chuyện có tính chất tưởng tượng và đưa ra những suy nghĩ sâu sắc về nhân phẩm và sự đánh đổi giữa vẻ đẹp vật chất và đức hạnh.\n\n\"The Picture of Dorian Gray\" là một tác phẩm nổi tiếng và gây tranh cãi, đồng thời tạo ra một sự ảnh hưởng sâu sắc trong văn học. Cuốn sách chứa đựng lời nhắn và cảnh báo về sự hiểm nguy của vẻ đẹp vật chất, sự đánh mất bản chất con người và những hệ quả của việc theo đuổi ham muốn và sự thỏa mãn ngắn hạn.\n\n\"The Picture of Dorian Gray\" của Oscar Wilde là một tác phẩm nghệ thuật độc đáo và sắc bén. Nó mang đến cho độc giả một cảm giác đen tối và sự suy ngẫm về cái giá của vẻ đẹp và tìm kiếm sự tồn vong. Cuốn sách tiếp tục tồn tại như một tác phẩm văn học quan trọng và truyền cảm hứng về tình cảm, vẻ đẹp và cuộc sống con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F26%2Fthe-picture-of-dorian-gray.jpg?alt=media&token=0945b3a0-548c-43b7-b63f-e962fb1ca782",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 27,
      "title": "The Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 448,
      "quantitySold": 57,
      "note": "\"The Adventures of Huckleberry Finn\" là một tiểu thuyết nổi tiếng của nhà văn Mark Twain, xuất bản lần đầu vào năm 1884. Cuốn sách này kể về cuộc phiêu lưu của nhân vật chính, Huck Finn, và người bạn đồng hành, Jim, một người nô lệ đã trốn thoát, trên sông Mississippi.\n\n\"The Adventures of Huckleberry Finn\" được đặt trong bối cảnh của Miền Nam Hoa Kỳ trước và sau Nội chiến Mỹ. Cuốn sách khám phá về cuộc sống và xã hội của thời đại đó, bao gồm cả sự nô lệ và những ràng buộc xã hội đối với các nhân vật chính. Melting pot của những nhân vật đa dạng và các tình huống hài hước và đầy mạo hiểm tạo nên một câu chuyện độc đáo và gây cấn.\n\nHuck Finn là một nhân vật trẻ tuổi, phiêu lưu và tự do, người bị cuốn vào những tình huống khó khăn và đối đầu với những quy tắc xã hội. Cùng với Jim, Huck khám phá vẻ đẹp của tự do và lòng chân thành, đồng thời đặt ra câu hỏi về công lý và ý thức nhân quyền.\n\nCuốn sách gây tranh cãi khi được xuất bản vì nó đưa ra các khía cạnh nhạy cảm của xã hội Mỹ thời đó, bao gồm cả vấn đề nô lệ và ngôn ngữ sử dụng. Tuy nhiên, nó cũng được công nhận là một tác phẩm văn học quan trọng với sự sắc sảo trong việc tái hiện cuộc sống và tầm nhìn xã hội.\n\n\"The Adventures of Huckleberry Finn\" đặt ra câu hỏi về tự do, công lý và tình người. Cuốn sách khám phá về sự trưởng thành và quá trình tìm kiếm danh phận của một người trẻ tuổi trong một xã hội đầy mâu thuẫn. Nó mang đến cho độc giả những suy nghĩ sâu sắc và thú vị về con người và xã hội.\n\n\"The Adventures of Huckleberry Finn\" là một tác phẩm văn học vĩ đại và trở thành biểu tượng của văn chương Mỹ. Cuốn sách thể hiện tài năng viết của Mark Twain và lan truyền thông điệp về sự tự do, tình bạn và nhân quyền. Nó tiếp tục được đọc và nghiên cứu rộng rãi đến ngày nay.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F27%2Fthe-adventures-of-huckleberry-finn.jpg?alt=media&token=216027f7-9e2c-4a71-bc32-5fb74b1bea63",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 28,
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 208,
      "quantitySold": 57,
      "note": "\"The Alchemist\" là một tiểu thuyết tâm linh pha trộn với tiểu thuyết phiêu lưu của nhà văn Paulo Coelho, xuất bản lần đầu vào năm 1988. Cuốn sách này đã trở thành một trong những cuốn sách bán chạy nhất và được đọc rộng rãi trên toàn thế giới.\n\n\"The Alchemist\" kể về cuộc phiêu lưu của Santiago, một chăn cừu trẻ tuổi từ Tây Ban Nha, trong việc tìm kiếm định mệnh của mình. Dưới sự hướng dẫn của một nhà tiên tri bí ẩn, Santiago rời bỏ cuộc sống hiện tại và khám phá những địa điểm kỳ diệu từ miền nam Tây Ban Nha qua sa mạc Ai Cập. Trong cuộc hành trình, anh ta gặp gỡ những người hùng, người thầy và những người phụ nữ đặc biệt, mỗi người mang đến cho Santiago những bài học quý giá về tình yêu, sự tin tưởng và tìm kiếm ý nghĩa cuộc sống.\n\n\"The Alchemist\" mang đến một thông điệp sâu sắc về việc tìm kiếm định mệnh và theo đuổi đam mê của chúng ta. Cuốn sách nhấn mạnh về sự kết nối giữa con người và Vũ trụ, và ý thức rằng tất cả chúng ta đều có khả năng để thực hiện những mong muốn chân thành của mình.\n\nPaulo Coelho sử dụng ngôn ngữ đơn giản và tường thuật hấp dẫn để truyền tải thông điệp sâu sắc về sự trưởng thành và khám phá bản thân. Cuốn sách kết hợp giữa tiểu thuyết và triết lý, đưa ra những cảm nhận sâu sắc về ý nghĩa của cuộc sống và những giá trị tinh thần.\n\n\"The Alchemist\" đã trở thành một tác phẩm cổ điển và đưa Paulo Coelho trở thành một tác giả nổi tiếng trên toàn cầu. Cuốn sách lan truyền thông điệp về sự khám phá, sự kiên nhẫn và lòng dũng cảm để theo đuổi giấc mơ của chúng ta. Nó là một nguồn cảm hứng cho những ai đang tìm kiếm ý nghĩa cuộc sống và muốn khám phá tiềm năng của bản thân.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F28%2Fthe-alchemist.jpg?alt=media&token=569dbf31-6548-4201-adb2-8582953dd1dc",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 29,
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 416,
      "quantitySold": 57,
      "note": "\"Wuthering Heights\" là một tiểu thuyết nổi tiếng của nhà văn Emily Brontë, xuất bản lần đầu vào năm 1847. Cuốn sách này được coi là một trong những tác phẩm văn học lãng mạn đỉnh cao và đã trở thành một biểu tượng của văn học Anh.\n\n\"Wuthering Heights\" diễn ra trong một môi trường đồng quê tại Yorkshire, Anh. Cuốn sách kể về câu chuyện tình yêu nhiệt huyết và đau đớn giữa Heathcliff, một chàng trai bí ẩn và hậu duệ bất hợp pháp, và Catherine Earnshaw, cô gái mạnh mẽ và kiêu kỳ. Tình yêu giữa họ vượt qua mọi trở ngại xã hội và gia đình, nhưng cuối cùng bị đẩy vào bi kịch và sự tổn thương.\n\n\"Wuthering Heights\" khám phá về tình yêu đam mê, tình yêu mất mát, và tác động của quá khứ đối với hiện tại. Cuốn sách đặt ra câu hỏi về bản chất con người, bất công xã hội, và những mâu thuẫn của tình yêu và lòng thù hận.\n\nEmily Brontë đã tạo ra các nhân vật phức tạp và đầy sức mạnh, với sự tương phản giữa Heathcliff, một người tự phụ và quyền lực, và Catherine, một người phụ nữ táo bạo nhưng không ổn định. Cuốn sách được viết bằng ngôn ngữ sắc sảo và mô tả tinh tế, tạo ra một không gian âm u và hấp dẫn.\n\n\"Wuthering Heights\" đã trở thành một tác phẩm cổ điển và đạt được đánh giá cao về văn chương và tầm ảnh hưởng. Cuốn sách khám phá về con người, tình yêu và tình dục, và vẫn là một nguồn cảm hứng cho nhiều tác phẩm sau này trong văn chương và nghệ thuật. \"Wuthering Heights\" mang đến cho độc giả một trải nghiệm sâu sắc và gợi mở về tình yêu đam mê và sự đau khổ của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F29%2Fwuthering-heights.jpg?alt=media&token=9a4ab1da-257f-4512-a889-8fbd9f0748b5",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 30,
      "title": "Don Quixote",
      "author": "Miguel de Cervantes Saavedra",
      "category": "Literary fiction",
      "releaseDate": "2021-11-24",
      "pages": 1072,
      "quantitySold": 67,
      "note": "\"Don Quixote\" là một tiểu thuyết vĩ đại của nhà văn Miguel de Cervantes, xuất bản lần đầu vào năm 1605. Cuốn sách này được coi là một trong những tác phẩm văn học quan trọng và ảnh hưởng nhất trong lịch sử văn chương.\n\n\"Don Quixote\" kể về cuộc phiêu lưu của nhân vật chính, Don Quixote, một người quý tộc đã mất trí và trở thành một hiệp sĩ tưởng tượng. Cùng với người bạn đồng hành, Sancho Panza, Don Quixote lên đường đi chinh phạt những kẻ xấu và trở thành anh hùng trong tâm trí của mình. Tuy nhiên, những cuộc phiêu lưu của Don Quixote thường đi vào lốt trò hề và gây cười.\n\n\"Don Quixote\" không chỉ là một câu chuyện hài hước mà còn là một tác phẩm sâu sắc về sự thực và tưởng tượng, về cuộc sống và thực tế. Nó đặt ra câu hỏi về giá trị và ý nghĩa của sự lòng thành, tình yêu và lòng nhân đạo. Cuốn sách kết hợp giữa trò chơi từ ngữ, tình huống hài hước và sự suy ngẫm về cuộc sống và tình cảnh con người.\n\nMiguel de Cervantes sử dụng ngôn ngữ phong phú và tạo hình các nhân vật sống động, đặc biệt là Don Quixote và Sancho Panza, để truyền tải thông điệp của mình. Cuốn sách mang đến cho độc giả một cảm giác vui nhộn và hài hước, đồng thời gợi mở về sự tưởng tượng và quyền lực của trí tưởng tượng con người.\n\n\"Don Quixote\" đã trở thành một tác phẩm cổ điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và nghệ thuật. Cuốn sách khám phá về bản chất con người, tình yêu, sự lòng thành và tầm quan trọng của giấc mơ và tưởng tượng. Nó vẫn là một biểu tượng của sự phiêu lưu và trí tưởng tượng của con người và tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F30%2Fdon-quixote.jpg?alt=media&token=1da2e509-f3e0-4388-b4cb-34dc486412e4",
      "price": 689500,
      "saleOff": 0,
      "stars": 58,
      "votes": 14
    },
    {
      "id": 31,
      "title": "Lord of the Flies",
      "author": "William Golding",
      "category": "Classics",
      "releaseDate": "2021-06-17",
      "pages": 224,
      "quantitySold": 47,
      "note": "\"Lord of the Flies\" là một tiểu thuyết nổi tiếng của nhà văn William Golding, xuất bản lần đầu vào năm 1954. Cuốn sách này mang đến một câu chuyện đáng sợ về con người và bản chất của xã hội.\n\n\"Lord of the Flies\" bắt đầu với một nhóm các cậu bé rơi vào một hòn đảo hoang sau khi máy bay của họ bị rơi. Trong tình trạng cô độc và bị tách biệt khỏi xã hội, các cậu bé bắt đầu tổ chức và xây dựng một cộng đồng riêng của họ. Tuy nhiên, sự thiếu quản lý, cạnh tranh và sự xung đột nội bộ dần dần dẫn đến sự suy sụp của cấu trúc xã hội và xuất hiện bạo lực và hỗn loạn.\n\n\"Lord of the Flies\" đặt ra câu hỏi về bản chất con người và tiềm năng của sự tàn ác. Cuốn sách khám phá về sự suy thoái của xã hội và khả năng của con người để rơi vào trạng thái hoang dã và ác độc khi không có quy tắc và giám sát.\n\nWilliam Golding sử dụng ngôn ngữ sắc sảo và mô tả tinh tế để tạo nên một môi trường đáng sợ và ám ảnh. Cuốn sách mang đến cho độc giả một cảm giác kinh hoàng và khám phá về sự đen tối của tâm hồn con người.\n\n\"Lord of the Flies\" đã trở thành một tác phẩm cổ điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra cảnh báo về tính chất nhân loại và sự phức tạp của xã hội. Nó khám phá về sự mất điều khiển và cuộc chiến giữa ác và thiện trong con người.\n\n\"Lord of the Flies\" là một tác phẩm đáng đọc, mạnh mẽ và đầy ý nghĩa. Nó thách thức chúng ta suy ngẫm về tình cảnh con người và vai trò của xã hội trong việc kiểm soát bản chất đen tối của chúng ta.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F31%2Flord-of-the-flies.jpg?alt=media&token=6e78d2f9-b743-46e9-a5a1-5165ecf96c7b",
      "price": 269400,
      "saleOff": 0,
      "stars": 34,
      "votes": 10
    },
    {
      "id": 32,
      "title": "The Scarlet Letter",
      "author": "Nathaniel Hawthorne",
      "category": "Adventure stories",
      "releaseDate": "2021-09-10",
      "pages": 272,
      "quantitySold": 120,
      "note": "\"The Scarlet Letter\" là một tiểu thuyết nổi tiếng của nhà văn Nathaniel Hawthorne, xuất bản lần đầu vào năm 1850. Cuốn sách này mang đến một câu chuyện phức tạp về tội lỗi, sự kiêu hãnh và sự đấu tranh cho sự tha thứ và cứu rỗi.\n\n\"The Scarlet Letter\" diễn ra vào thế kỷ 17 ở thị trấn Puritan Massachusetts Bay. Cuốn sách kể về cuộc sống của Hester Prynne, một phụ nữ đã có con ngoài giá thú, và sự đối đầu của cô với xã hội phỉ báng và những hình phạt công cộng. Hester phải sống với biểu tượng tội lỗi của mình, một chữ \"A\" màu đỏ được khắc trên ngực áo, và đối mặt với sự phê phán và đánh đập của cộng đồng.\n\n\"The Scarlet Letter\" khám phá về nhân đạo, tình yêu và sự dễ dãi. Nó đặt ra câu hỏi về tội lỗi, đạo đức và lòng nhân đạo trong một xã hội đầy nghiêm khắc và bạo lực. Cuốn sách phản ánh về sự phân biệt đối xử, cảm xúc đau khổ và cuộc đấu tranh với tự tội và sự tha thứ.\n\nNathaniel Hawthorne sử dụng ngôn ngữ sắc sảo và tường thuật tinh tế để tạo nên một bối cảnh đáng sợ và ám ảnh. Cuốn sách mang đến cho độc giả một cảm giác sâu sắc về sự cô đơn và sự tách biệt, đồng thời khám phá về nhân cách con người và sự đấu tranh với cái tốt và cái xấu.\n\n\"The Scarlet Letter\" đã trở thành một tác phẩm cổ điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách mang đến cho chúng ta những suy nghĩ về tội lỗi, đạo đức và sự đấu tranh của con người với sự lựa chọn và hậu quả.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F32%2Fthe-scarlet-letter.jpg?alt=media&token=dd1c0b40-d475-4bce-b9dc-d0c561db6fc9",
      "price": 347500,
      "saleOff": 0.08,
      "stars": 64,
      "votes": 21
    },
    {
      "id": 33,
      "title": "Catch-22",
      "author": "Joseph Heller",
      "category": "Adventure stories",
      "releaseDate": "2021-12-30",
      "pages": 544,
      "quantitySold": 28,
      "note": "\"Catch-22\" là một tiểu thuyết hài hước và chính trị của nhà văn Joseph Heller, xuất bản lần đầu vào năm 1961. Cuốn sách này mang đến một cái nhìn sắc sảo và châm biếm về cuộc chiến tranh và máy móc bürokrasi.\n\n\"Catch-22\" diễn ra trong thời gian Chiến tranh Thế giới thứ hai và tập trung vào nhân vật chính, Yossarian, một phi công trong không quân Mỹ. Yossarian bị rơi vào tình huống vô lý khiến anh ta mắc kẹt trong một vòng xoáy của quy tắc vô lý và nguyên tắc mâu thuẫn. \"Catch-22\" được định nghĩa là một quy tắc không thể thoát ra, trong đó nếu một người tâm thần muốn tránh những nhiệm vụ nguy hiểm trong chiến tranh, điều đó chỉ chứng tỏ anh ta tỉnh táo và không phải là người tâm thần, nhưng nếu anh ta tiếp tục thực hiện những nhiệm vụ nguy hiểm, điều đó chứng tỏ anh ta điên cuồng.\n\n\"Catch-22\" khám phá về sự điên rồ và vô lý của chiến tranh, sự mâu thuẫn và sự nguy hiểm của quyền lực bürokrasi. Cuốn sách châm biếm và hài hước đặt câu hỏi về giá trị của cuộc sống và tình người giữa bối cảnh đau đớn và mất mát.\n\nJoseph Heller sử dụng ngôn ngữ sắc sảo và câu chuyện đan xen để truyền tải thông điệp chính của mình. Cuốn sách mang đến cho độc giả một cái nhìn cay đắng về cuộc sống quân đội và văn hóa chiến tranh. Nó tiếp tục là một tác phẩm đáng đọc và mang lại sự thách thức và suy ngẫm về tồn tại con người và ý nghĩa của cuộc sống.\n\n\"Catch-22\" đã trở thành một tác phẩm cổ điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách chứa đựng những suy nghĩ chính trị và xã hội, đồng thời đưa ra câu hỏi về sự công bằng, quyền lực và tình người trong một thế giới điên rồ và vô lý.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F33%2Fcatch-22.jpg?alt=media&token=a6fe7721-09bb-4097-8e9f-f931946ca6b2",
      "price": 189000,
      "saleOff": 0,
      "stars": 102,
      "votes": 30
    },
    {
      "id": 34,
      "title": "The Count of Monte Cristo",
      "author": "Alexandre Dumas",
      "category": "Fantasy",
      "releaseDate": "2022-07-13",
      "pages": 894,
      "quantitySold": 75,
      "note": "\"The Count of Monte Cristo\" (Bá tước Monte Cristo) là một tiểu thuyết kinh điển của nhà văn Alexandre Dumas, xuất bản lần đầu vào năm 1844. Cuốn sách này mang đến một câu chuyện phức tạp về tình yêu, trả thù và sự trỗi dậy.\n\n\"The Count of Monte Cristo\" kể về cuộc đời của Edmond Dantès, một người trẻ tài năng và tình yêu của Mercedes. Tuy nhiên, anh bị phản bội và bị giam cầm sai với cáo buộc không công bằng. Trong quá trình 14 năm ở tù, Dantès gặp một người cùng tù là Abbé Faria, người truyền cho anh những kiến thức và bí mật của tài sản ẩn dật. Sau khi thoát khỏi tù, Dantès hóa trang thành \"Bá tước Monte Cristo\" và trở thành một người giàu có và mạnh mẽ, sẵn sàng trả thù những người đã gây ra sự bất công cho mình.\n\n\"The Count of Monte Cristo\" khám phá về lòng thù hận và khát vọng báo thù, cùng với những vấn đề về tình yêu, tội ác và trách nhiệm. Cuốn sách tạo nên một câu chuyện hấp dẫn với các yếu tố như âm mưu, nhận dạng giả mạo và sự đối đầu giữa công lý và tội lỗi.\n\nAlexandre Dumas sử dụng ngôn ngữ sắc sảo và mô tả tinh tế để tái hiện các nhân vật đa chiều và cảnh quan đa dạng. Cuốn sách mang đến cho độc giả một trải nghiệm giữa những cung đường bí ẩn, những âm mưu và cuộc phiêu lưu đầy kịch tính.\n\n\"The Count of Monte Cristo\" đã trở thành một tác phẩm văn học vĩ đại và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đặt câu hỏi về công lý, trách nhiệm và sự đấu tranh của con người với tội ác và hành trình tìm kiếm sự công bằng.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F34%2Fthe-count-of-monte-cristo.jpg?alt=media&token=87fd8e81-c1d6-449c-a0b1-055b4df43073",
      "price": 260000,
      "saleOff": 0.15,
      "stars": 201,
      "votes": 52
    },
    {
      "id": 35,
      "title": "A Tale of Two Cities",
      "author": "Charles Dickens",
      "category": "Classics",
      "releaseDate": "2022-07-14",
      "pages": 448,
      "quantitySold": 420,
      "note": "\"A Tale of Two Cities\" là một tiểu thuyết lịch sử nổi tiếng của nhà văn Charles Dickens, xuất bản lần đầu vào năm 1859. Cuốn sách này đưa độc giả vào thời kỳ Cách mạng Pháp và khám phá về tình yêu, cống hiến và sự hy sinh.\n\n\"A Tale of Two Cities\" tập trung vào hai thành phố, London và Paris, trong giai đoạn trước và sau Cách mạng Pháp. Cuốn sách kể về câu chuyện của ba nhân vật chính: Charles Darnay, một quý tộc người Anh; Lucie Manette, người phụ nữ tinh khiết và yêu thương; và Sydney Carton, một luật sư buồn tẻ và đau khổ. Những sự kiện xảy ra xung quanh tình yêu, cách biệt gia đình và cuộc chiến tranh dẫn đến những hệ quả lớn và sự hy sinh cuối cùng.\n\n\"A Tale of Two Cities\" khám phá về lòng trung thành, tình yêu và nhân đạo giữa những thời điểm khó khăn và biến động của lịch sử. Cuốn sách chứa đựng những hình ảnh sống động về sự khốc liệt của cuộc sống và tác động của cách mạng.\n\nCharles Dickens sử dụng ngôn ngữ tinh tế và tường thuật phong phú để tái hiện cảnh quan lịch sử và các nhân vật đa chiều. Cuốn sách mang đến cho độc giả một trải nghiệm đầy xúc cảm về tình yêu, sự hy sinh và sự đấu tranh cho tự do.\n\n\"A Tale of Two Cities\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách chứa đựng những thông điệp về tình người và quyền lực của lòng trung thành và hy sinh. Nó tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F35%2Fa-tale-of-two-cities.jpg?alt=media&token=ec511a9e-a8cf-442f-a077-1f8b730017f2",
      "price": 219200,
      "saleOff": 0,
      "stars": 87,
      "votes": 26
    },
    {
      "id": 36,
      "title": "The Kite Runner",
      "author": "Khaled Hosseini",
      "category": "Poetry",
      "releaseDate": "2022-07-15",
      "pages": 371,
      "quantitySold": 24,
      "note": "\"The Kite Runner\" là một tiểu thuyết nổi tiếng của nhà văn Khaled Hosseini, xuất bản lần đầu vào năm 2003. Cuốn sách này mang đến một câu chuyện đầy cảm xúc về tình bạn, tội lỗi và tìm kiếm sự chuộc tội.\n\n\"The Kite Runner\" diễn ra ở Kabul, Afghanistan, và kể về cuộc sống của Amir, một cậu bé người Hazara, và Hassan, bạn thân thiết và đồng đội của Amir. Cuộc sống của hai người bạn thay đổi hoàn toàn sau một sự kiện bi kịch, khi Hassan bị bắt nạt và Amir không can thiệp. Cảm giác tội lỗi và trách nhiệm với Hassan trở thành một gánh nặng lớn đối với Amir suốt cả cuộc đời.\n\n\"The Kite Runner\" khám phá về tình bạn, tình gia đình và sự tha thứ. Cuốn sách đặt ra câu hỏi về lòng trung thành, lòng tự trọng và sự đấu tranh với quá khứ. Nó mang đến một cái nhìn sâu sắc về cuộc sống ở Afghanistan, với những mất mát, bất công và tình yêu vượt qua những ranh giới văn hóa và tôn giáo.\n\nKhaled Hosseini sử dụng ngôn ngữ tinh tế và mô tả sắc nét để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm đầy cảm xúc về tình yêu, sự hy sinh và sự tìm kiếm sự bình an.\n\n\"The Kite Runner\" đã trở thành một tác phẩm quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình người và sự nhân đạo, đồng thời tạo ra một cầu nối văn hóa giữa độc giả và người Afghanistan. \"The Kite Runner\" là một câu chuyện xúc động về tình yêu, sự lỗi lầm và hy vọng vào sự tha thứ và cứu rỗi.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F36%2Fthe-kite-runner.jpg?alt=media&token=96f9b0ec-ef1d-41b0-841e-784b6ac4bdc0",
      "price": 299000,
      "saleOff": 0.05,
      "stars": 91,
      "votes": 30
    },
    {
      "id": 37,
      "title": "The Outsiders",
      "author": "Susan Eloise Hinton",
      "category": "Romance",
      "releaseDate": "2022-07-16",
      "pages": 192,
      "quantitySold": 37,
      "note": "\"The Outsiders\" là một tiểu thuyết nổi tiếng của nhà văn S.E. Hinton, xuất bản lần đầu vào năm 1967. Cuốn sách này mang đến một câu chuyện cảm động về tình bạn, sự phân biệt địa vị và tìm kiếm danh dự.\n\n\"The Outsiders\" diễn ra ở thành phố Tulsa, Oklahoma, và kể về cuộc sống của nhóm thanh niên thuộc hai băng đảng đối địch: Greasers (bọn trai đầu dầu) và Socs (bọn trai giàu có). Cuộc sống của các nhân vật chính, như Ponyboy Curtis và Johnny Cade, bị ảnh hưởng bởi sự xung đột giữa hai băng đảng và cuộc đấu tranh với bạo lực, sự bất công và mất mát.\n\n\"The Outsiders\" khám phá về tình bạn, gia đình và tình đồng cảm. Cuốn sách đặt câu hỏi về sự phân biệt địa vị xã hội, quyền lực và khả năng con người để vượt qua ranh giới xã hội. Nó mang đến một cái nhìn sâu sắc về sự trưởng thành, tình yêu và hy vọng trong một thế giới đầy thách thức.\n\nS.E. Hinton sử dụng ngôn ngữ trực quan và đồng cảm để tái hiện cảnh quan và tâm trạng của các nhân vật trẻ tuổi. Cuốn sách mang đến cho độc giả một trải nghiệm chân thực và đầy cảm xúc về tuổi trẻ, tình bạn và sự thay đổi.\n\n\"The Outsiders\" đã trở thành một tác phẩm cổ điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về sự công bằng, sự đoàn kết và tình người. Nó tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F37%2Fthe-outsiders.jpg?alt=media&token=c5761377-1812-4df3-b8c2-b5a87bbf5feb",
      "price": 5690700,
      "saleOff": 0.3,
      "stars": 77,
      "votes": 18
    },
    {
      "id": 38,
      "title": "Gone with the Wind",
      "author": "Margaret Mitchell",
      "category": "Literary fiction",
      "releaseDate": "2022-07-17",
      "pages": 1024,
      "quantitySold": 78,
      "note": "\"Gone with the Wind\" là một tiểu thuyết nổi tiếng của nhà văn Margaret Mitchell, xuất bản lần đầu vào năm 1936. Cuốn sách này mang đến một câu chuyện lịch sử và tình yêu sôi động, đặt trong bối cảnh Chiến tranh Nội giữa các tiểu bang và thời kỳ xây dựng lại Nam nước Mỹ.\n\n\"Gone with the Wind\" diễn ra ở tiểu bang Georgia và kể về cuộc đời của Scarlett O'Hara, một cô gái kiên cường và quyến rũ. Cuộc sống của Scarlett bị thay đổi khi chiến tranh phá vỡ thế giới của cô và khiến cô phải đối mặt với những mất mát, khó khăn và thay đổi định mệnh. Cuộc tình phức tạp giữa Scarlett và Rhett Butler là trung tâm của câu chuyện, đồng thời khám phá về lòng kiêu hãnh và sự đấu tranh với tình yêu và lòng trung thành.\n\n\"Gone with the Wind\" mang đến một cảm nhận chân thực về cuộc sống trong thời kỳ chiến tranh và tái thiết Nam nước Mỹ. Cuốn sách tạo nên một bối cảnh phong phú với những mô tả tinh tế về cuộc sống xã hội, cuộc sống nông thôn và mất mát về kinh tế và văn hóa.\n\nMargaret Mitchell sử dụng ngôn ngữ lãng mạn và tường thuật chi tiết để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm sâu sắc về tình yêu, sự mất mát và sức mạnh của con người trong môi trường khó khăn.\n\n\"Gone with the Wind\" đã trở thành một tác phẩm văn học kinh điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về cuộc sống, tình yêu và nhân cách con người trong bối cảnh lịch sử. Nó vẫn là một câu chuyện tình đẹp và mạnh mẽ và tiếp tục thu hút và cảm hứng cho độc giả đến ngày nay.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F38%2Fgone-with-the-wind.jpg?alt=media&token=5d165823-fd3c-45cb-ba9b-c715787639c8",
      "price": 309000,
      "saleOff": 0.25,
      "stars": 106,
      "votes": 29
    },
    {
      "id": 39,
      "title": "Slaughterhouse-Five",
      "author": "Kurt Vonnegut",
      "category": "Classics",
      "releaseDate": "2022-07-18",
      "pages": 190,
      "quantitySold": 113,
      "note": "\"Slaughterhouse-Five\" là một tiểu thuyết nổi tiếng của nhà văn Kurt Vonnegut, xuất bản lần đầu vào năm 1969. Cuốn sách này mang đến một câu chuyện phiêu lưu đầy tưởng tượng và sự suy ngẫm về chiến tranh, thời gian và tự do.\n\n\"Slaughterhouse-Five\" xoay quanh cuộc đời của nhân vật chính, Billy Pilgrim, một nhân viên quân y trong Chiến tranh Thế giới thứ hai. Cuộc sống của Billy bị xáo trộn khi anh bị bắt làm tù binh bởi quân đội Đức và chứng kiến những sự kiện kinh khủng của cuộc chiến. Tuy nhiên, điểm đặc biệt của cuốn sách là sự không tuân theo thứ tự thời gian, khiến Billy Pilgrim đi qua các thời điểm khác nhau trong cuộc sống của mình một cách phi logic.\n\n\"Slaughterhouse-Five\" khám phá về sự tàn bạo của chiến tranh, tình hình tâm lý sau chiến tranh và sự ảnh hưởng của thời gian đối với con người. Cuốn sách đặt câu hỏi về ý nghĩa của cuộc sống, tự do và khả năng của con người để đối mặt với nỗi đau và đau khổ.\n\nKurt Vonnegut sử dụng ngôn ngữ gợi nhớ và tường thuật phiến diện để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm phi thực tế và đầy triết lý về chiến tranh và con người.\n\n\"Slaughterhouse-Five\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về chiến tranh, tình người và tính đa dạng của thời gian. Nó tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F39%2Fslaughterhouse-five.jpg?alt=media&token=52391b9e-d508-4f72-8bc0-f553a076b9fd",
      "price": 217500,
      "saleOff": 0.1,
      "stars": 151,
      "votes": 42
    },
    {
      "id": 40,
      "title": "The Little Prince",
      "author": "Antoine de Saint-Exupéry",
      "category": "Historical fiction",
      "releaseDate": "2022-07-19",
      "pages": 96,
      "quantitySold": 64,
      "note": "\"The Little Prince\" (Tiểu hoàng tử) là một tiểu thuyết nổi tiếng của nhà văn Antoine de Saint-Exupéry, xuất bản lần đầu vào năm 1943. Cuốn sách này mang đến một câu chuyện đơn giản nhưng sâu sắc về tình yêu, tình bạn và ý nghĩa cuộc sống.\n\n\"The Little Prince\" kể về cuộc phiêu lưu của một người phi hành gia gặp một cậu bé nhỏ từ một hành tinh xa xôi. Cậu bé kể cho người phi hành gia về những trải nghiệm của mình trên các hành tinh khác nhau và cuộc sống của nó cùng với ý nghĩa sâu xa của tình yêu và sự hiểu biết.\n\n\"The Little Prince\" khám phá về sự tò mò, tình người và ý nghĩa cuộc sống. Cuốn sách đặt câu hỏi về trái tim con người, tầm nhìn và giá trị của sự đơn giản. Nó mang đến một cái nhìn về thế giới trẻ thơ, với sự thẳng thắn và sự kỳ diệu.\n\nAntoine de Saint-Exupéry sử dụng ngôn ngữ tinh tế và hình ảnh tưởng tượng để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm tinh thần và triết lý về cuộc sống và con người.\n\n\"The Little Prince\" đã trở thành một tác phẩm kinh điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình yêu, tình bạn và ý nghĩa cuộc sống. Nó là một câu chuyện đáng yêu và cảm động, tiếp tục lan tỏa thông điệp về sự tương thân, tình người và giá trị của sự đơn giản.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F40%2Fthe-little-prince.jpg?alt=media&token=c036648c-0e0d-4d6a-80e3-c27919cd3e75",
      "price": 202000,
      "saleOff": 0.15,
      "stars": 133,
      "votes": 42
    },
    {
      "id": 41,
      "title": "The Divine Comedy",
      "author": "Dante Alighieri",
      "category": "Classics",
      "releaseDate": "2022-07-20",
      "pages": 135,
      "quantitySold": 113,
      "note": "\"The Divine Comedy\" (Thiên đường địa ngục) là một tác phẩm vĩ đại của nhà thơ người Ý Dante Alighieri, hoàn thành vào thế kỷ 14. Cuốn sách này được coi là một trong những tác phẩm văn học quan trọng nhất trong lịch sử và là một biểu tượng của văn hóa phương Tây.\n\n\"The Divine Comedy\" bao gồm ba phần chính: \"Inferno\" (Địa ngục), \"Purgatorio\" (Luyện ngục), và \"Paradiso\" (Thiên đường). Cuốn sách kể về cuộc hành trình của Dante thông qua ba vùng địa ngục, luyện ngục và thiên đường, trong đó ông gặp gỡ và trò chuyện với các nhân vật từ quá khứ và hiện tại, đại diện cho các tình huống và tội lỗi nhân loại.\n\n\"The Divine Comedy\" khám phá về tội lỗi, công lý, tình yêu và trí tuệ. Cuốn sách thể hiện sự khám phá về sự sắp xếp bậc thang của vũ trụ và sự lựa chọn của con người giữa đường điểm trần và sự hoàn hảo tinh thần.\n\nDante Alighieri sử dụng ngôn ngữ lãng mạn và miêu tả sắc nét để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm đầy sắc màu và hùng vĩ về thế giới tâm linh và con người.\n\n\"The Divine Comedy\" đã trở thành một tác phẩm văn học kinh điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đặt câu hỏi về đạo đức, tình người và trí tuệ của con người. Nó tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này và thể hiện sự vĩ đại và sâu sắc của nghệ thuật văn chương.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F41%2Fthe-divine-comedy.jpg?alt=media&token=60854098-6db9-4942-b501-18814525914e",
      "price": 259600,
      "saleOff": 0,
      "stars": 45,
      "votes": 15
    },
    {
      "id": 42,
      "title": "The Handmaid's Tale",
      "author": "Margaret Atwood",
      "category": "Classics",
      "releaseDate": "2022-07-21",
      "pages": 325,
      "quantitySold": 206,
      "note": "\"The Handmaid's Tale\" (Câu chuyện người hầu gái) là một tiểu thuyết nổi tiếng của nhà văn Margaret Atwood, xuất bản lần đầu vào năm 1985. Cuốn sách này mang đến một câu chuyện gợi mở về tương lai đen tối, trong đó tình yêu, tự do và quyền phụ nữ bị chế độ cộng hòa Gilead tước đoạt.\n\n\"The Handmaid's Tale\" lấy bối cảnh trong một tương lai gần, Gilead đã lên nắm quyền và áp dụng một chế độ cực đoan và cận kề. Trong xã hội này, những người phụ nữ có khả năng sinh sản được tuyển chọn làm \"người hầu gái\" để sinh con cho các quan chức cao cấp vô sinh. Cuốn sách theo chân Offred, một người hầu gái, và chi tiết cuộc sống và tư duy của cô dưới chế độ đàn áp này.\n\n\"The Handmaid's Tale\" khám phá về quyền phụ nữ, quyền tự do cá nhân và cuộc đấu tranh với độc tài. Cuốn sách đặt câu hỏi về vai trò xã hội, quyền lực và ý chí của con người trong bối cảnh mất đi quyền tự do và nhân phẩm.\n\nMargaret Atwood sử dụng ngôn ngữ tinh tế và mô tả sắc nét để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm sâu sắc và rùng rợn về tương lai đen tối và những hệ quả của độc tài.\n\n\"The Handmaid's Tale\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về bạo lực, sự đàn áp và quyền tự do. Nó tiếp tục khám phá và thách thức các vấn đề xã hội quan trọng trong thời đại hiện tại.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F42%2Fthe-handmaid-s-tale.jpg?alt=media&token=afcde495-fce9-40c8-803b-e60a33e56219",
      "price": 549000,
      "saleOff": 0.26,
      "stars": 302,
      "votes": 72
    },
    {
      "id": 43,
      "title": "The Secret History",
      "author": "Donna Tartt",
      "category": "Classics",
      "releaseDate": "2022-07-22",
      "pages": 576,
      "quantitySold": 57,
      "note": "\"The Secret History\" (Lịch sử bí mật) là một tiểu thuyết của nhà văn Donna Tartt, xuất bản lần đầu vào năm 1992. Cuốn sách này mang đến một câu chuyện ly kỳ về tội ác, bí mật và sự đánh đổi tâm hồn.\n\n\"The Secret History\" xoay quanh một nhóm sinh viên đại học tại một trường đại học danh giá ở Vermont. Nhóm này sống trong một thế giới độc đáo, mê hoặc và tăm tối. Cuộc sống của họ bị thay đổi sau khi họ tham gia vào một hành động tội ác và cố gắng che giấu sự thật đen tối đó.\n\n\"The Secret History\" khám phá về tình bạn, tình yêu và sự lạc lối. Cuốn sách đặt câu hỏi về đạo đức, sự trách nhiệm và giới hạn của con người. Nó mang đến một cái nhìn sâu sắc về bản chất loài người và những điểm yếu và khát vọng bên trong mỗi người.\n\nDonna Tartt sử dụng ngôn ngữ tinh tế và tường thuật sắc sảo để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và gợi cảm về những điều kỳ lạ và không thể lường trước của con người.\n\n\"The Secret History\" đã trở thành một tác phẩm đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về bản chất con người, tội lỗi và trách nhiệm. Nó tiếp tục thu hút và gợi cảm hứng cho độc giả với câu chuyện đen tối và phức tạp của nó.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F43%2Fthe-secret-history.jpg?alt=media&token=7b98817b-847d-489f-892a-6f042cb0c15f",
      "price": 360700,
      "saleOff": 0.12,
      "stars": 199,
      "votes": 46
    },
    {
      "id": 44,
      "title": "Norwegian Wood",
      "author": "Haruki Murakami",
      "category": "Fantasy",
      "releaseDate": "2022-07-23",
      "pages": 296,
      "quantitySold": 75,
      "note": "\"Norwegian Wood\" là một tiểu thuyết của nhà văn người Nhật Haruki Murakami, được xuất bản lần đầu vào năm 1987. Cuốn sách này mang đến một câu chuyện tình yêu đầy cảm xúc và sự đau khổ trong một thời đại náo động.\n\n\"Norwegian Wood\" diễn ra vào những năm 1960 tại Nhật Bản và kể về cuộc sống của Toru Watanabe, một sinh viên đại học bình thường, và những mối quan hệ phức tạp mà anh ta có với hai cô gái, Naoko và Midori. Cuộc tình giữa Toru và Naoko được đặt trong bối cảnh của tình yêu, mất mát và sự tìm kiếm ý nghĩa cuộc sống.\n\n\"Norwegian Wood\" khám phá về tình yêu, sự mất mát và cuộc sống trong một thời đại biến động. Cuốn sách đặt câu hỏi về tình dục, tình yêu và tâm linh. Nó mang đến một cái nhìn sâu sắc về sự tình cờ và sự đồng cảm trong cuộc sống.\n\nHaruki Murakami sử dụng ngôn ngữ tinh tế và mô tả tưởng tượng để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm sâu sắc và tâm linh về tình yêu, sự mất mát và sự đấu tranh với cái gọi là \"bình thường\".\n\n\"Norwegian Wood\" đã trở thành một tác phẩm đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình yêu, cuộc sống và sự tìm kiếm ý nghĩa. Nó tiếp tục thu hút và lan truyền cảm hứng cho độc giả với tình tiết phong phú và sự nhạy cảm của nó.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F44%2Fnorwegian-wood.jpg?alt=media&token=de46586b-f02a-4fe6-b192-fe97eb3c4336",
      "price": 324000,
      "saleOff": 0,
      "stars": 102,
      "votes": 29
    },
    {
      "id": 45,
      "title": "The Sun Also Rises",
      "author": "Ernest Hemingway",
      "category": "Fantasy",
      "releaseDate": "2022-07-24",
      "pages": 318,
      "quantitySold": 420,
      "note": "\"The Sun Also Rises\" (Mặt trời cũng mọc) là một tiểu thuyết nổi tiếng của nhà văn Mỹ Ernest Hemingway, xuất bản lần đầu vào năm 1926. Cuốn sách này mang đến một câu chuyện về thế hệ mất mát và sự tìm kiếm ý nghĩa trong cuộc sống sau Chiến tranh Thế giới thứ nhất.\n\n\"The Sun Also Rises\" xoay quanh cuộc sống của một nhóm người bạn Mỹ và châu Âu sống ở Paris và tham gia một chuyến đi du lịch đến Tây Ban Nha. Cuộc sống của họ bị ảnh hưởng bởi hậu quả của chiến tranh, cảm giác mất mát và sự tuyệt vọng. Câu chuyện tập trung vào mối quan hệ tình cảm phức tạp giữa nhân vật chính Jake Barnes và Brett Ashley.\n\n\"The Sun Also Rises\" khám phá về tình yêu, sự mất mát và sự tìm kiếm ý nghĩa cuộc sống. Cuốn sách đặt câu hỏi về tình dục, vai trò của nam giới và nữ giới, và sự khao khát tự do và ý thức. Nó mang đến một cái nhìn sâu sắc về sự trống rỗng và khát vọng trong thời đại hậu chiến.\n\nErnest Hemingway sử dụng ngôn ngữ tối giản và không hoa mỹ để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm chân thực và đau thương về sự mất mát và tình yêu không thể thực hiện.\n\n\"The Sun Also Rises\" đã trở thành một tác phẩm kinh điển trong văn chương Mỹ và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình yêu, cuộc sống và sự tuyệt vọng. Nó tiếp tục được đọc và truyền cảm hứng cho nhiều thế hệ độc giả sau này.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F45%2Fthe-sun-also-rises.jpg?alt=media&token=8bebc3be-111c-422a-9fd3-f19aaefb5456",
      "price": 218000,
      "saleOff": 0.05,
      "stars": 223,
      "votes": 61
    },
    {
      "id": 46,
      "title": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "category": "Poetry",
      "releaseDate": "2022-07-25",
      "pages": 224,
      "quantitySold": 24,
      "note": "\"The Hitchhiker's Guide to the Galaxy\" (Hướng dẫn du hành qua các vì sao) là một loạt tiểu thuyết hài hước khoa học viễn tưởng của nhà văn người Anh Douglas Adams. Bộ tiểu thuyết bao gồm năm tập, xuất bản lần đầu từ năm 1979 đến 1992. Cuốn sách này mang đến một cuộc phiêu lưu điên rồ và trí tưởng tượng qua vũ trụ, mang đến cho độc giả những trận cười sảng khoái và những suy ngẫm sâu sắc về cuộc sống và tồn tại.\n\n\"The Hitchhiker's Guide to the Galaxy\" bắt đầu với câu chuyện về Arthur Dent, một người đàn ông bình thường từ Trái Đất bị mắc kẹt trong cuộc hủy diệt Trái Đất để làm đường xây dựng một đường cao tốc vũ trụ. Arthur cùng với người bạn không ngừng sống Ford Prefect, một nhà báo từ hành tinh Betelgeuse, và các nhân vật kỳ quặc khác, bắt đầu cuộc hành trình phiêu lưu xuyên qua không gian và thời gian.\n\n\"The Hitchhiker's Guide to the Galaxy\" mang đến một cái nhìn hài hước và mỉa mai về vũ trụ và nhân loại. Cuốn sách đặt câu hỏi về ý nghĩa cuộc sống, vũ trụ và tầm quan trọng của câu hỏi hơn là câu trả lời. Nó mang đến một cái nhìn sâu sắc và phóng khoáng về con người và cuộc sống trong thế giới vô cùng rộng lớn và kỳ lạ.\n\nDouglas Adams sử dụng ngôn ngữ hài hước và trí tuệ để tạo ra một thế giới phantasmagoric và những nhân vật độc đáo. Cuốn sách mang đến cho độc giả một trải nghiệm giải trí tuyệt vời, đồng thời kích thích tư duy và tạo ra những tràng cười thú vị.\n\n\"The Hitchhiker's Guide to the Galaxy\" đã trở thành một tác phẩm văn học kinh điển trong thể loại khoa học viễn tưởng và tạo nên một ảnh hưởng lớn trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về vũ trụ, cuộc sống và ý nghĩa của sự hài hước. Nó tiếp tục được yêu thích và đọc rộng rãi trên khắp thế giới.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F46%2Fthe-hitchhiker-s-guide-to-the-galaxy.jpg?alt=media&token=e2311dc5-e23a-4181-9a3f-4a2ff4630912",
      "price": 3090300,
      "saleOff": 0.09,
      "stars": 119,
      "votes": 29
    },
    {
      "id": 47,
      "title": "The Name of the Rose",
      "author": "Umberto Eco",
      "category": "Romance",
      "releaseDate": "2022-07-26",
      "pages": 517,
      "quantitySold": 37,
      "note": "\"The Name of the Rose\" là một tiểu thuyết lịch sử của nhà văn Ý Umberto Eco, xuất bản lần đầu vào năm 1980. Cuốn sách này mang đến một câu chuyện kịch tính và trí tuệ về tội ác, tôn giáo và tri thức trong thời kỳ Trung cổ.\n\n\"The Name of the Rose\" diễn ra vào thế kỷ 14 tại một tu viện La Mã cổ đại ở miền Bắc Ý. Cuốn sách kể về cuộc điều tra của một thám tử người Franciscan, William of Baskerville, và người trợ lý Adso để giải quyết một loạt các vụ giết người bí ẩn trong tu viện. Trong quá trình điều tra, họ phải đối mặt với sự tranh cãi tôn giáo, âm mưu chính trị và cuộc chiến giữa tri thức và cảm giác.\n\n\"The Name of the Rose\" khám phá về tri thức, tôn giáo và sự đấu tranh quyền lực trong thời Trung cổ. Cuốn sách đặt câu hỏi về sự đánh đổi giữa kiến thức và quyền lực, sự phân biệt và đấu tranh cho sự tự do tư duy. Nó mang đến một cái nhìn sâu sắc về tội lỗi, tôn giáo và quyền lực trong xã hội.\n\nUmberto Eco sử dụng ngôn ngữ giàu chi tiết và tri thức để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm giáo dục và trí tuệ, đồng thời đánh thức sự tò mò và suy ngẫm về sự phức tạp của cuộc sống và tâm trí con người.\n\n\"The Name of the Rose\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng lớn trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tri thức, tôn giáo và quyền lực. Nó tiếp tục được đọc và nghiên cứu bởi những người đam mê văn chương và tri thức.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F47%2Fthe-name-of-the-rose.jpg?alt=media&token=d71fefa6-3ace-435f-bd85-5815101c9441",
      "price": 369000,
      "saleOff": 0.1,
      "stars": 201,
      "votes": 46
    },
    {
      "id": 48,
      "title": "Beloved",
      "author": "Toni Morrison",
      "category": "Literary fiction",
      "releaseDate": "2022-07-27",
      "pages": 352,
      "quantitySold": 78,
      "note": "\"Beloved\" là một tiểu thuyết đáng chú ý của nhà văn người Mỹ Toni Morrison, xuất bản lần đầu vào năm 1987. Cuốn sách này đạt giải Pulitzer cho tiểu thuyết năm 1988 và được coi là một trong những tác phẩm quan trọng nhất của văn học Mỹ hiện đại.\n\n\"Beloved\" lấy cảm hứng từ câu chuyện có thật về một nô lệ đã giết con của mình để tránh cho con phải chịu nô lệ cả đời. Cuốn sách kể về Sethe, một phụ nữ nô lệ đã trốn thoát khỏi địa ngục nô lệ và đến một nông trại ở Ohio. Tuy nhiên, quá khứ đen tối của Sethe và sự hiện diện bí ẩn của con gái đã chết, Beloved, trở thành một ám ảnh trong cuộc sống của cô và gia đình cô.\n\n\"Beloved\" khám phá về tội ác, sự tàn ác của nô lệ và hậu quả tinh thần của nó. Cuốn sách đặt câu hỏi về truyền thống, nhận thức lịch sử và khả năng con người để vượt qua nỗi đau và hận thù. Nó mang đến một cái nhìn sâu sắc và đau thương về cuộc sống của người da màu và tình yêu mẹ con.\n\nToni Morrison sử dụng ngôn ngữ tinh tế và mô tả đặc sắc để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm sâu sắc về nỗi đau và khát vọng tự do. Nó cũng tạo ra một âm thanh đặc biệt, kết hợp giữa những giọng điệu màu sắc của ngôn ngữ và những âm vang lịch sử.\n\n\"Beloved\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về nô lệ, tự do và tình yêu. Nó tiếp tục đánh thức nhận thức về sự bất công và góp phần vào việc giải phóng nhận thức về quyền con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F48%2Fbeloved.jpg?alt=media&token=c57cb0e4-9ed2-49cd-85d3-841c5b28ddb7",
      "price": 120800,
      "saleOff": 0,
      "stars": 121,
      "votes": 34
    },
    {
      "id": 49,
      "title": "The Stranger",
      "author": "Albert Camus",
      "category": "Classics",
      "releaseDate": "2022-07-28",
      "pages": 159,
      "quantitySold": 113,
      "note": "\"The Stranger\" (Người lạ) là một tiểu thuyết nổi tiếng của nhà văn người Pháp Albert Camus, xuất bản lần đầu vào năm 1942. Cuốn sách này được coi là một trong những tác phẩm quan trọng nhất của phong trào Vô lý và khám phá về sự vô nghĩa của cuộc sống và sự cô đơn con người.\n\n\"The Stranger\" kể về cuộc đời của Meursault, một nhân viên văn phòng ở Algiers, một người mà cuộc sống không có sự tương tác và cảm xúc đáng kể. Khi mẹ của Meursault qua đời, anh tham dự đám tang nhưng không thể cảm nhận được sự buồn bã. Sau đó, Meursault phạm tội giết người mà không có lý do rõ ràng, và câu chuyện xoay quanh quá trình xét xử và cuộc sống trong tù của anh ta.\n\n\"The Stranger\" khám phá về vô lí, cô đơn và tình dục. Cuốn sách đặt câu hỏi về ý nghĩa của cuộc sống, ý thức con người và trách nhiệm cá nhân. Nó mang đến một cái nhìn sắc bén và phản biện về nhân văn và giá trị con người trong một thế giới đầy vô nghĩa.\n\nAlbert Camus sử dụng ngôn ngữ súc tích và trực tiếp để miêu tả tâm trạng và suy nghĩ của Meursault. Cuốn sách mang đến cho độc giả một trải nghiệm khái quát về một người đàn ông đối diện với sự khắc nghiệt và vô lý của cuộc sống.\n\n\"The Stranger\" đã trở thành một tác phẩm kinh điển và tạo nên một ảnh hưởng sâu sắc trong văn chương và triết học. Cuốn sách đặt câu hỏi về tồn tại, ý nghĩa của cuộc sống và tầm quan trọng của sự tự do tư duy. Nó tiếp tục làm cho độc giả nghĩ và thảo luận về những vấn đề trascendental trong cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F49%2Fthe-stranger.jpg?alt=media&token=390d0703-3c6a-4dfe-aea9-93448aad6dc7",
      "price": 260000,
      "saleOff": 0,
      "stars": 194,
      "votes": 56
    },
    {
      "id": 50,
      "title": "A Clockwork Orange",
      "author": "Anthony Burgess",
      "category": "Historical fiction",
      "releaseDate": "2022-07-29",
      "pages": 176,
      "quantitySold": 64,
      "note": "\"A Clockwork Orange\" (Cam kết màu da cam) là một tiểu thuyết nổi tiếng của nhà văn người Anh Anthony Burgess, xuất bản lần đầu vào năm 1962. Cuốn sách này mang đến một câu chuyện gợi cảm về tội ác, bạo lực và tự do cá nhân trong một tương lai không xa.\n\n\"A Clockwork Orange\" đặt trong một xã hội đen tối và tương lai không xác định, nơi các băng đảng với những thanh niên tàn bạo làm mưa làm gió. Nhân vật chính là Alex, một thành viên của một băng đảng vô lại, điều hành bằng sự tàn bạo và bạo lực. Cuộc sống của Alex thay đổi khi anh bị bắt và trải qua một quá trình \"điều chỉnh\" tâm lý để loại bỏ sự bạo lực trong tâm trí của mình.\n\n\"A Clockwork Orange\" khám phá về văn hóa, tội ác và quyền tự do cá nhân. Cuốn sách đặt câu hỏi về trách nhiệm, ý thức đạo đức và tầm quan trọng của sự tự chủ và lựa chọn. Nó mang đến một cái nhìn sắc nét và cảm động về sự phản đối và sự hình thành cá nhân trong một thế giới bạo lực và đối nghịch.\n\nAnthony Burgess sử dụng ngôn ngữ độc đáo và đặc biệt, gọi là \"Nadsat\", để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm bất thường và sắc nét về tâm lý con người và tác động của xã hội.\n\n\"A Clockwork Orange\" đã trở thành một tác phẩm gây tranh cãi và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tội ác, quyền tự do và đạo đức. Nó tiếp tục làm cho độc giả đặt câu hỏi và thách thức quan điểm về con người và xã hội.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F50%2Fa-clockwork-orange.jpg?alt=media&token=59828357-90c3-4154-b071-044500ab13ea",
      "price": 439500,
      "saleOff": 0.21,
      "stars": 92,
      "votes": 26
    },
    {
      "id": 51,
      "title": "The Joy Luck Club",
      "author": "Amy Tan",
      "category": "Classics",
      "releaseDate": "2022-07-30",
      "pages": 352,
      "quantitySold": 113,
      "note": "\"The Joy Luck Club\" là một tiểu thuyết nổi tiếng của nhà văn người Mỹ gốc Trung Amy Tan, xuất bản lần đầu vào năm 1989. Cuốn sách này mang đến một câu chuyện phức tạp và đầy cảm xúc về tình mẫu tử, sự kế thừa và tìm kiếm danh dự trong cội nguồn gia đình.\n\n\"The Joy Luck Club\" kể về bốn người phụ nữ Trung Quốc gốc Mỹ và bốn con gái của họ. Cuốn sách tập trung vào câu chuyện cá nhân của từng nhân vật và mô tả cả những khúc mắc và hiểu lầm giữa các thế hệ và văn hóa khác nhau. Qua việc chia sẻ những câu chuyện và truyền thống gia đình, các nhân vật mong muốn tìm thấy sự liên kết và hiểu biết sâu sắc với nhau.\n\n\"The Joy Luck Club\" khám phá về tình mẫu tử, văn hóa và quá khứ. Cuốn sách đặt câu hỏi về di sản và sự kế thừa, sự hiểu biết và đấu tranh giữa các thế hệ. Nó mang đến một cái nhìn sắc nét và đồng cảm về cuộc sống của người phụ nữ và tình yêu gia đình.\n\nAmy Tan sử dụng ngôn ngữ tinh tế và mô tả sắc nét để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm sâu sắc và xúc cảm về sự kết nối con người và tình yêu gia đình.\n\n\"The Joy Luck Club\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình mẫu tử, tình yêu gia đình và văn hóa. Nó tiếp tục làm cho độc giả cảm nhận và thấu hiểu về sự phức tạp và sức mạnh của các mối quan hệ con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F51%2Fthe-joy-luck-club.jpg?alt=media&token=0a784106-1ef9-429f-a685-5e3df6dcf8e5",
      "price": 211500,
      "saleOff": 0,
      "stars": 110,
      "votes": 28
    },
    {
      "id": 52,
      "title": "The Book Thief",
      "author": "Markus Zusak",
      "category": "Fantasy",
      "releaseDate": "2022-07-31",
      "pages": 592,
      "quantitySold": 206,
      "note": "\"The Book Thief\" là một tiểu thuyết của nhà văn Úc Markus Zusak, xuất bản lần đầu vào năm 2005. Cuốn sách này mang đến một câu chuyện độc đáo và cảm động về tình yêu với sách, sự ảnh hưởng của từ ngữ và sức mạnh của con người trong thời kỳ Chiến tranh Thế giới thứ hai.\n\n\"The Book Thief\" diễn ra ở Đức vào thời kỳ Chiến tranh Thế giới thứ hai và kể về cuộc sống của một cô bé tên là Liesel Meminger. Khi Liesel bị bỏ rơi và nhận nuôi bởi một gia đình người Đức, cô bắt đầu trộm sách và tìm niềm vui trong việc đọc và chia sẻ từ ngữ. Cuộc sống của Liesel bị ảnh hưởng bởi cuộc sống trong thời kỳ chiến tranh, cảm xúc của những người xung quanh và quyết định đối diện với sự nguy hiểm và tội ác.\n\n\"The Book Thief\" khám phá về tình yêu với sách, sức mạnh của từ ngữ và tình người trong thời kỳ chiến tranh. Cuốn sách đặt câu hỏi về ý nghĩa của từ ngữ, tác động của nó và sự trỗi dậy của con người trong bối cảnh khắc nghiệt. Nó mang đến một cái nhìn sâu sắc và xúc cảm về sự kháng cự, sự hy sinh và lòng nhân ái trong thời kỳ khủng hoảng.\n\nMarkus Zusak sử dụng ngôn ngữ tinh tế và diễn đạt đặc biệt để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm cảm động và sâu sắc về sự mất mát và sức mạnh của từ ngữ.\n\n\"The Book Thief\" đã trở thành một tác phẩm quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tình yêu với sách, quyền tự do từ ngữ và sức mạnh của con người. Nó tiếp tục làm cho độc giả hiểu và cảm nhận về tình yêu, sự hy sinh và tầm quan trọng của việc chia sẻ từ ngữ.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F52%2Fthe-book-thief.jpg?alt=media&token=43cecd69-6075-4f5c-b9d3-f5ef390bb73e",
      "price": 469000,
      "saleOff": 0.15,
      "stars": 304,
      "votes": 80
    },
    {
      "id": 53,
      "title": "The Shining",
      "author": "Stephen King",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 447,
      "quantitySold": 57,
      "note": "\"The Shining\" là một tiểu thuyết kinh dị của nhà văn người Mỹ Stephen King, xuất bản lần đầu vào năm 1977. Cuốn sách này mang đến một câu chuyện đáng sợ về điên cuồng, ma quái và sự đấu tranh của tâm trí trong một khách sạn xa xôi.\n\n\"The Shining\" kể về cuộc sống của Jack Torrance, một người cha bị ám ảnh bởi quá khứ và vấn đề rượu và quyết định làm việc làm quản lý mùa đông tại khách sạn Overlook, nằm ở vùng núi xa xôi Colorado. Khi gia đình Jack cùng nhau sống trong khách sạn hoang tàn và bị cô lập, sự ám ảnh và tà ác của nó bắt đầu ảnh hưởng đến tâm trí và sự ổn định của Jack, đồng thời tác động đến tình cảm và an toàn của gia đình anh ta.\n\n\"The Shining\" khám phá về điên cuồng, ma quái và mất kiểm soát của con người. Cuốn sách đặt câu hỏi về tình dục, bạo lực và sự đấu tranh với quái vật trong tâm trí con người. Nó mang đến một cái nhìn sâu sắc và đáng sợ về sự phân liệt giữa thực tại và thế giới siêu nhiên.\n\nStephen King sử dụng ngôn ngữ đặc sắc và mô tả sống động để tái hiện cảnh quan và tâm trạng đen tối của khách sạn Overlook và tâm trí của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm rùng rợn và đầy căng thẳng về sự kinh hoàng và điên rồ trong tâm trí con người.\n\n\"The Shining\" đã trở thành một tác phẩm kinh điển trong thể loại kinh dị và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự điên cuồng, tà ác và đấu tranh của tâm trí. Nó tiếp tục làm cho độc giả căng thẳng và sợ hãi với những câu chuyện đáng sợ và tác động tâm lý.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F53%2Fthe-shining.jpg?alt=media&token=fc34153e-cdd1-4223-bba9-27e8962b4648",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 54,
      "title": "Life of Pi",
      "author": "Yann Martel",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 352,
      "quantitySold": 57,
      "note": "\"Life of Pi\" là một tiểu thuyết của nhà văn người Canada Yann Martel, xuất bản lần đầu vào năm 2001. Cuốn sách này mang đến một câu chuyện phiêu lưu và sâu sắc về cuộc sống, tôn giáo và sức mạnh của trí tưởng tượng.\n\n\"Life of Pi\" kể về cuộc sống của Piscine Molitor Patel, còn được gọi là Pi, một chàng trai Ấn Độ trẻ tuổi. Khi con tàu chở gia đình Pi đang đi từ Ấn Độ tới Canada chìm, Pi trở thành người sống sót duy nhất và bị cuốn vào một cuộc hành trình trên biển trên một chiếc thuyền cùng với một con hổ Bengal tên Richard Parker. Cuộc sống trên biển kéo dài trong nhiều tháng và Pi phải đối mặt với khó khăn, cô đơn và đối đầu với con hổ.\n\n\"Life of Pi\" khám phá về sự sống còn, sự tôn giáo và ý nghĩa của cuộc sống. Cuốn sách đặt câu hỏi về đức tin, sự lạc quan và quyền tự do tưởng tượng. Nó mang đến một cái nhìn sâu sắc và tư duy về sự tồn tại và ý nghĩa của cuộc sống.\n\nYann Martel sử dụng ngôn ngữ lôi cuốn và mô tả sống động để tái hiện cảnh quan và tâm trạng của Pi trong cuộc sống trên biển. Cuốn sách mang đến cho độc giả một trải nghiệm phiêu lưu và tưởng tượng đầy mê hoặc.\n\n\"Life of Pi\" đã trở thành một tác phẩm đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về tôn giáo, sự sống và quyền tự do tưởng tượng. Nó tiếp tục làm cho độc giả suy ngẫm và tận hưởng những diễn biến đầy thú vị và sự phản chiếu về cuộc sống và lòng người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F54%2Flife-of-pi.jpg?alt=media&token=0ed0f763-6823-41b6-b45a-580f788e8c06",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 55,
      "title": "The Color Purple",
      "author": "Alice Walker",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 304,
      "quantitySold": 57,
      "note": "\"The Color Purple\" là một tiểu thuyết nổi tiếng của nhà văn người Mỹ Alice Walker, xuất bản lần đầu vào năm 1982. Cuốn sách này mang đến một câu chuyện mạnh mẽ về sự chịu đựng, tự do và tự khám phá trong một xã hội bị cưỡng hiếp và áp bức.\n\n\"The Color Purple\" kể về cuộc đời của Celie, một phụ nữ da màu ở miền Nam Hoa Kỳ vào cuối thế kỷ 19 và đầu thế kỷ 20. Cuộc sống của Celie đầy bất công khi cô bị cưỡng hiếp và bị gia đình bạo hành. Tuy nhiên, thông qua tình bạn với Shug Avery, một ca sĩ blues tự do và tình yêu đến từ Sofia, một người phụ nữ mạnh mẽ, Celie bắt đầu khám phá và tìm lại giá trị bản thân và quyền tự do cá nhân.\n\n\"The Color Purple\" khám phá về sự tự do, tình yêu và sự kháng cự. Cuốn sách đặt câu hỏi về giới tính, chủng tộc và tình dục trong một xã hội định kiến và bạo lực. Nó mang đến một cái nhìn sâu sắc và cảm động về sức mạnh của sự chịu đựng và khả năng phục hồi của con người.\n\nAlice Walker sử dụng ngôn ngữ tinh tế và mô tả đặc biệt để tái hiện cảnh quan và tâm trạng của Celie trong cuộc sống đầy đau khổ. Cuốn sách mang đến cho độc giả một trải nghiệm cảm xúc và động lòng về sự khát khao tự do và quyền tự chủ.\n\n\"The Color Purple\" đã trở thành một tác phẩm quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về chịu đựng, tình yêu và sự kháng cự. Nó tiếp tục làm cho độc giả suy ngẫm và thấu hiểu về cuộc sống và quyền tự do cá nhân.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F55%2Fthe-color-purple.jpg?alt=media&token=3b4f2f21-e7f1-4549-ad44-0b8677912019",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 56,
      "title": "The Sound and the Fury",
      "author": "William Faulkner",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 326,
      "quantitySold": 57,
      "note": "\"The Sound and the Fury\" là một tiểu thuyết nổi tiếng của nhà văn người Mỹ William Faulkner, xuất bản lần đầu vào năm 1929. Cuốn sách này mang đến một câu chuyện phức tạp về gia đình Compson, sự suy đồi và đấu tranh với quá khứ.\n\n\"The Sound and the Fury\" được chia thành các phần riêng biệt, mỗi phần lấy từ góc nhìn của một nhân vật khác nhau. Câu chuyện tập trung vào cuộc sống của gia đình Compson ở miền Nam Hoa Kỳ, trong đó mất mát, mâu thuẫn gia đình và sự suy đồi tinh thần nổi bật. Đặc biệt, tình yêu và quan hệ giữa hai anh em Benjy và Quentin Compson được miêu tả đầy sắc sảo và sâu sắc.\n\n\"The Sound and the Fury\" khám phá về thời gian, quá khứ và hậu quả của hành động. Cuốn sách đặt câu hỏi về đau khổ, quyền lực và tầm quan trọng của truyền thống gia đình. Nó mang đến một cái nhìn phức tạp và thách thức về sự tồn tại và tâm lý con người.\n\nWilliam Faulkner sử dụng ngôn ngữ độc đáo và phong cách viết đa chiều để tái hiện cảnh quan và tâm trạng của các nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm đòi hỏi sự tập trung và sự nhạy bén trong việc hiểu và giải mã câu chuyện phức tạp.\n\n\"The Sound and the Fury\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về thời gian, quyền lực và tâm lý con người. Nó tiếp tục làm cho độc giả suy ngẫm và thách thức với những cấu trúc tinh tế và ý nghĩa sâu xa.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F56%2Fthe-sound-and-the-fury.jpg?alt=media&token=8f9cde4a-3f3c-415c-9663-3f3d8ed82a33",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 57,
      "title": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 672,
      "quantitySold": 57,
      "note": "\"The Girl with the Dragon Tattoo\" là cuốn tiểu thuyết ly kỳ tội phạm của nhà văn người Thụy Điển Stieg Larsson, xuất bản lần đầu vào năm 2005. Cuốn sách này là phần đầu tiên trong loạt truyện \"Millennium Trilogy\" của Larsson và đã trở thành một hiện tượng toàn cầu với sự hấp dẫn của câu chuyện và nhân vật.\n\n\"The Girl with the Dragon Tattoo\" xoay quanh câu chuyện của Mikael Blomkvist, một nhà báo tài năng và Lisbeth Salander, một cô gái bí ẩn và cực kỳ thông minh có hình xăm của một con rồng trên lưng. Mikael được một gia đình giàu có thuê để điều tra một vụ mất tích đã xảy ra nhiều năm trước và cuộc sống của Lisbeth liên quan chặt chẽ đến câu chuyện này. Họ bắt đầu một cuộc phiêu lưu đầy nguy hiểm và sự thâm nhập vào thế giới của tội ác, tình báo và bí mật chôn giấu.\n\n\"The Girl with the Dragon Tattoo\" khám phá về tội ác, bạo lực và sự bất công trong xã hội. Cuốn sách đặt câu hỏi về quyền lực, phản bội và trách nhiệm cá nhân. Nó mang đến một cái nhìn sắc nét và căng thẳng về bóng tối và sự đấu tranh trong xã hội hiện đại.\n\nStieg Larsson sử dụng ngôn ngữ sống động và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và ly kỳ với những tình tiết gây cấn và đặc sắc.\n\n\"The Girl with the Dragon Tattoo\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tội ác, sự công lý và sự đấu tranh của cá nhân. Nó tiếp tục làm cho độc giả kịch tính và căng thẳng với những cung bậc cảm xúc và sự khám phá về bản chất con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F57%2Fthe-girl-with-the-dragon-tattoo.jpg?alt=media&token=b8d88633-916c-4aee-940b-fb66fb76c4e9",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 58,
      "title": "The Pillars of the Earth",
      "author": "Ken Follett",
      "category": "Historical Fiction",
      "releaseDate": "2022-08-01",
      "pages": 1104,
      "quantitySold": 57,
      "note": "\"The Pillars of the Earth\" (Cột Mốc của Trái Đất) là một tiểu thuyết lịch sử của nhà văn người Anh Ken Follett, xuất bản lần đầu vào năm 1989. Cuốn sách này mang đến một câu chuyện tưởng tượng đặt trong thời kỳ Trung Cổ về xây dựng một nhà thờ đồ sộ và sự đấu tranh, âm mưu xung quanh nó.\n\n\"The Pillars of the Earth\" diễn ra vào thế kỷ thứ XII tại Anh và xoay quanh cuộc sống của một số nhân vật chính, bao gồm Philip, một giám mục, Tom Builder, một kiến trúc sư nghèo khổ, và Aliena, một phụ nữ quyền lực. Cuộc sống của họ và các nhân vật khác liên kết với việc xây dựng một nhà thờ tại thị trấn Kingsbridge. Trong quá trình xây dựng, nhân vật đối mặt với những âm mưu, tham vọng và xung đột về quyền lực và tín ngưỡng.\n\n\"The Pillars of the Earth\" khám phá về sự khát vọng, lòng kiên nhẫn và quyết tâm trong việc xây dựng một tác phẩm lớn. Cuốn sách đặt câu hỏi về quyền lực, tôn giáo và tầm quan trọng của nghệ thuật và kiến trúc. Nó mang đến một cái nhìn sâu sắc và phản ánh về sự vĩ đại và sự kiên cường của con người.\n\nKen Follett sử dụng ngôn ngữ truyền cảm và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của thời kỳ Trung Cổ. Cuốn sách mang đến cho độc giả một trải nghiệm tưởng tượng và hấp dẫn về sự lấp lánh và sự khắc nghiệt của thời gian xa xưa.\n\n\"The Pillars of the Earth\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về khát vọng, sự kiên nhẫn và sự kiên cường của con người. Nó tiếp tục làm cho độc giả cảm nhận và thấu hiểu về sự đấu tranh và thành công trong việc thực hiện một giấc mơ.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F58%2Fthe-pillars-of-the-earth.jpg?alt=media&token=b55401bd-b314-4895-905a-523148aa5393",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 59,
      "title": "American Gods",
      "author": "Neil Gaiman",
      "category": "Literary fiction",
      "releaseDate": "2021-11-24",
      "pages": 465,
      "quantitySold": 67,
      "note": "\"American Gods\" là một tiểu thuyết của nhà văn người Anh Neil Gaiman, xuất bản lần đầu vào năm 2001. Cuốn sách này mang đến một câu chuyện đầy bí ẩn và đa chiều về sự đối đầu giữa thần thánh cổ xưa và thần thánh hiện đại trong xã hội Mỹ đương đại.\n\n\"American Gods\" kể về cuộc sống của Shadow Moon, một người đàn ông trở thành nhân viên cận vệ cho một người đàn ông bí ẩn tên là Wednesday (Thứ Tư). Khi Shadow bị cuốn vào một cuộc chiến giữa các vị thần cổ xưa và các vị thần mới, cuộc sống và quan điểm của anh ta thay đổi một cách đáng kinh ngạc. Sự đối đầu giữa các vị thần này tạo ra những câu chuyện phức tạp về quyền lực, tín ngưỡng và thế giới siêu nhiên.\n\n\"American Gods\" khám phá về tôn giáo, đa dạng văn hóa và sự tiến hóa của xã hội Mỹ. Cuốn sách đặt câu hỏi về sự tin tưởng, quyền lực và ý nghĩa của sự tôn thờ. Nó mang đến một cái nhìn sắc sảo và đôi khi bi quan về lòng tin và tầm quan trọng của niềm tin trong thế giới hiện đại.\n\nNeil Gaiman sử dụng ngôn ngữ tinh tế và mô tả đa dạng để tái hiện cảnh quan và tâm trạng của các vị thần và nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm tưởng tượng và bất ngờ với những tình tiết kịch tính và bí ẩn.\n\n\"American Gods\" đã trở thành một tác phẩm quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tôn giáo, đa dạng và quyền lực. Nó tiếp tục làm cho độc giả suy ngẫm và thách thức với những câu chuyện đa chiều và sự khám phá về tâm lý và tôn giáo của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F59%2Famerican-gods.jpg?alt=media&token=b0bd33b4-6304-49b4-a1fa-05684ed17cdf",
      "price": 689500,
      "saleOff": 0,
      "stars": 58,
      "votes": 14
    },
    {
      "id": 60,
      "title": "The Secret Life of Bees",
      "author": "Sue Monk Kidd",
      "category": "Classics",
      "releaseDate": "2021-06-17",
      "pages": 336,
      "quantitySold": 47,
      "note": "\"The Secret Life of Bees\" là một tiểu thuyết của nhà văn người Mỹ Sue Monk Kidd, xuất bản lần đầu vào năm 2001. Cuốn sách này mang đến một câu chuyện đẫm tình cảm và sâu sắc về sự tìm kiếm tình yêu, sự chấp nhận và tự do.\n\n\"The Secret Life of Bees\" lấy bối cảnh vào những năm 1960 tại Nam Carolina, Mỹ, và kể về cuộc sống của Lily Owens, một cô gái trẻ sống trong môi trường gia đình bạo lực và thiếu thốn tình yêu. Lily rời khỏi ngôi nhà bị nạn đó và trốn đi cùng với Rosaleen, người dì nuôi của cô. Họ tìm nơi trú ẩn tại ngôi nhà của ba chị em nhà Boatwright, một gia đình đen và làm việc làm nuôi ong mật. Tại đó, Lily tìm thấy tình yêu, hỗ trợ và hiểu biết về tình mẹ.\n\n\"The Secret Life of Bees\" khám phá về tình yêu, sự chấp nhận và quyền tự do. Cuốn sách đặt câu hỏi về tình yêu gia đình, phân biệt chủng tộc và quyền lựa chọn cá nhân. Nó mang đến một cái nhìn sâu sắc và nhân văn về sự bất công và sự phục hồi của tâm trí và tâm hồn.\n\nSue Monk Kidd sử dụng ngôn ngữ tinh tế và mô tả sắc sảo để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm đầy cảm xúc và chân thực về sự tìm kiếm và sự phát triển cá nhân.\n\n\"The Secret Life of Bees\" đã trở thành một tác phẩm đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, chấp nhận và tự do. Nó tiếp tục làm cho độc giả đắm chìm trong câu chuyện và suy ngẫm về tình yêu và tình người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F60%2Fthe-secret-life-of-bees.jpg?alt=media&token=8eff6776-c034-4ddf-ba2a-dcf162f92806",
      "price": 269400,
      "saleOff": 0,
      "stars": 34,
      "votes": 10
    },
    {
      "id": 61,
      "title": "The Bell Jar",
      "author": "Sylvia Plath",
      "category": "Adventure stories",
      "releaseDate": "2021-09-10",
      "pages": 244,
      "quantitySold": 120,
      "note": "\"The Bell Jar\" là một tiểu thuyết của nhà văn người Mỹ Sylvia Plath, xuất bản lần đầu vào năm 1963. Cuốn sách này mang đến một câu chuyện tâm lý sâu sắc và đau đớn về sự suy sụp tinh thần và cuộc đấu tranh với bệnh tâm thần.\n\n\"The Bell Jar\" kể về cuộc sống của Esther Greenwood, một nữ sinh viên trẻ tuổi và tài năng, khi cô trải qua một cuộc tấn công tinh thần. Cuộc sống của Esther dần dần rơi vào trạng thái trầm cảm và tách biệt với thế giới xung quanh. Cuốn sách đi sâu vào tâm trí của Esther, mô tả cuộc chiến của cô với bệnh tâm thần, sự tuyệt vọng và nỗ lực để tìm hiểu và chấp nhận chính mình.\n\n\"The Bell Jar\" khám phá về tâm lý con người, sự đau khổ và khám phá bản thân. Cuốn sách đặt câu hỏi về sự bạo lực của xã hội đối với phụ nữ, những áp lực và sự mất cân bằng trong cuộc sống. Nó mang đến một cái nhìn sắc sảo và cảm động về sự khó khăn của cuộc sống và sự tìm kiếm ý nghĩa trong một thế giới bất công.\n\nSylvia Plath sử dụng ngôn ngữ tinh tế và mô tả tận tâm để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm đau lòng và đồng cảm với những cảm xúc và trạng thái tinh thần của nhân vật chính.\n\n\"The Bell Jar\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và xã hội. Cuốn sách đưa ra những suy nghĩ về sức mạnh và sự yếu đuối của tâm trí con người. Nó tiếp tục làm cho độc giả suy ngẫm và thấu hiểu về sự tàn nhẫn và khó khăn của cuộc sống và bệnh tâm thần.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F61%2Fthe-bell-jar.jpg?alt=media&token=598d4d58-8c97-4d90-80c9-07bb9eacc2cb",
      "price": 347500,
      "saleOff": 0.08,
      "stars": 64,
      "votes": 21
    },
    {
      "id": 62,
      "title": "The Martian",
      "author": "Andy Weir",
      "category": "Adventure stories",
      "releaseDate": "2021-12-30",
      "pages": 369,
      "quantitySold": 28,
      "note": "\"The Martian\" là một tiểu thuyết khoa học viễn tưởng của nhà văn người Mỹ Andy Weir, xuất bản lần đầu vào năm 2011. Cuốn sách này mang đến một câu chuyện phiêu lưu đầy kịch tính về một người anh hùng bị mắc kẹt trên sao Hỏa và cuộc đấu tranh để sống sót.\n\n\"The Martian\" kể về Mark Watney, một phi hành gia Mỹ, bị bỏ lại trên sao Hỏa sau khi đoàn phi hành đoàn của anh ta tưởng rằng anh ta đã chết trong một trận bão khủng khiếp. Tuy nhiên, Mark sống sót và phải tìm cách sử dụng tài năng và kiến thức của mình để tồn tại trên hành tinh không thân thiện này. Anh ta phải tìm cách trồng thực phẩm, tạo ra năng lượng và tìm hiểu cách liên lạc với Trái Đất để có cơ hội trở về.\n\n\"The Martian\" khám phá về sự sáng tạo, sự kiên nhẫn và lòng dũng cảm của con người trong môi trường khắc nghiệt. Cuốn sách đặt câu hỏi về sự cô đơn, sự cống hiến và ý nghĩa của cuộc sống. Nó mang đến một cái nhìn tươi mới và hài hước về cuộc phiêu lưu và tinh thần chiến đấu của con người.\n\nAndy Weir sử dụng ngôn ngữ khoa học và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của Mark Watney. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và đầy kỳ vọng về sự sáng tạo và sự kiên nhẫn của con người.\n\n\"The Martian\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự khám phá và sự vượt qua giới hạn. Nó tiếp tục làm cho độc giả hồi hộp và đam mê với câu chuyện về sự sống sót và sự phi thường của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F62%2Fthe-martian.jpeg?alt=media&token=6c99a055-2572-4753-930a-5cc970d5f7db",
      "price": 189000,
      "saleOff": 0,
      "stars": 102,
      "votes": 30
    },
    {
      "id": 63,
      "title": "The Help",
      "author": "Kathryn Stockett",
      "category": "Fantasy",
      "releaseDate": "2022-07-13",
      "pages": 524,
      "quantitySold": 75,
      "note": "\"The Help\" là một tiểu thuyết của nhà văn người Mỹ Kathryn Stockett, xuất bản lần đầu vào năm 2009. Cuốn sách này mang đến một câu chuyện mạnh mẽ về tình bạn, tình đồng cảm và sự đấu tranh cho sự công bằng và nhân đạo trong thời kỳ phân biệt chủng tộc tại miền Nam Hoa Kỳ trong những năm 1960.\n\n\"The Help\" xoay quanh cuộc sống của ba nhân vật chính: Skeeter, một phụ nữ trẻ muốn viết một cuốn sách về cuộc sống của những người giúp việc da đen; Aibileen, một người giúp việc thông minh và biết chia sẻ câu chuyện cuộc sống của mình; và Minny, một người giúp việc hóm hỉnh và đầy quyền lực. Các nhân vật này hợp sức để viết nên những câu chuyện và chia sẻ kinh nghiệm của họ về sự phân biệt chủng tộc và sự khinh miệt.\n\n\"The Help\" khám phá về sự tận tụy, lòng dũng cảm và tình đồng cảm của con người. Cuốn sách đặt câu hỏi về tình bạn, sự đấu tranh và quyền tự do cá nhân. Nó mang đến một cái nhìn sâu sắc và nhân văn về bất công và sự thay đổi trong xã hội.\n\nKathryn Stockett sử dụng ngôn ngữ chân thực và mô tả đặc sắc để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm cảm động và hài hước với những câu chuyện đầy cảm xúc và sự thăng hoa của nhân vật.\n\n\"The Help\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình đồng cảm, sự chấp nhận và sự thay đổi trong xã hội. Nó tiếp tục làm cho độc giả đồng cảm và suy ngẫm về sự công bằng và nhân văn.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F63%2Fthe-help.jpg?alt=media&token=a31669d4-9b84-4b8d-9d9e-5d6b2db40769",
      "price": 260000,
      "saleOff": 0.15,
      "stars": 201,
      "votes": 52
    },
    {
      "id": 64,
      "title": "The Road",
      "author": "Cormac McCarthy",
      "category": "Classics",
      "releaseDate": "2022-07-14",
      "pages": 287,
      "quantitySold": 420,
      "note": "\"The Road\" là một tiểu thuyết của nhà văn người Mỹ Cormac McCarthy, xuất bản lần đầu vào năm 2006. Cuốn sách này mang đến một câu chuyện tàn khốc và u ám về cuộc hành trình sinh tồn của một người cha và con trai trong một thế giới hậu tận thế.\n\n\"The Road\" diễn ra trong một cảnh tượng hậu tận thế, khi Trái Đất đã bị tàn phá và suy tàn. Người cha và con trai lữ hành qua một đất nước bị hoang tàn và hiểm nguy, trong tìm kiếm một nơi an toàn và cố gắng sống sót. Trong cuộc hành trình khốc liệt này, họ phải đối mặt với nạn đói, nguy hiểm và cuộc giao tranh giữa lòng người và sự cầu tìm hy vọng trong một thế giới tuyệt vọng.\n\n\"The Road\" khám phá về bản chất con người, tình yêu gia đình và lòng can đảm trong môi trường tàn khốc. Cuốn sách đặt câu hỏi về ý nghĩa của cuộc sống, đạo đức và sự đấu tranh cho hy vọng. Nó mang đến một cái nhìn đen tối và sâu sắc về con người và tình huống khó khăn mà họ đối mặt.\n\nCormac McCarthy sử dụng ngôn ngữ tối giản và không hào nhoáng để tái hiện cảnh quan và tâm trạng của cuộc hành trình. Cuốn sách mang đến cho độc giả một trải nghiệm gợi lên sự sợ hãi và sự tuyệt vọng, nhưng cũng chứa đựng sự tình nguyện và lòng can đảm của con người.\n\n\"The Road\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về cuộc sống, hy vọng và sự tồn tại trong điều kiện khắc nghiệt. Nó tiếp tục làm cho độc giả suy ngẫm và thấu hiểu về bản chất con người và sự bền vững của hy vọng.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F64%2Fthe-road.jpg?alt=media&token=85628e98-de85-4700-b7df-72f91f20c33a",
      "price": 219200,
      "saleOff": 0,
      "stars": 87,
      "votes": 26
    },
    {
      "id": 65,
      "title": "A Game of Thrones",
      "author": "George Raymond Richard Martin",
      "category": "Poetry",
      "releaseDate": "2022-07-15",
      "pages": 694,
      "quantitySold": 24,
      "note": "\"A Game of Thrones\" (Trò chơi vương quyền) là cuốn đầu tiên trong loạt tiểu thuyết \"A Song of Ice and Fire\" (Bài hát băng và lửa) của nhà văn người Mỹ George R.R. Martin, xuất bản lần đầu vào năm 1996. Cuốn sách này mang đến một thế giới phức tạp, đầy âm mưu và sự đấu tranh về quyền lực trong vương quốc hư cấu của Westeros.\n\n\"A Game of Thrones\" mở ra một cốt truyện rộng lớn, với hàng chục nhân vật chính và phụ tạo nên một mạng lưới phức tạp của những âm mưu, trận đánh và cuộc đấu tranh vì vương quyền. Cuốn sách tập trung vào các gia tộc quyền thế, như Stark, Lannister và Targaryen, cùng với những nhân vật đa dạng khác như Daenerys Targaryen, Jon Snow và Tyrion Lannister. Truyện cũng mang đến những yếu tố siêu nhiên, với sự hiện diện của rồng và lạc thú.\n\n\"A Game of Thrones\" khám phá về quyền lực, tình yêu, tình bạn và lòng tham trong một thế giới đầy rẫy bạo lực và sự đối đầu. Cuốn sách đặt câu hỏi về đạo đức, công lý và giá trị của quyền lực. Nó mang đến một cái nhìn tương phản và sắc nét về tình người và cái giá của quyền lực.\n\nGeorge R.R. Martin sử dụng ngôn ngữ sống động và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của thế giới Westeros. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và lôi cuốn với những tình tiết ly kỳ và đầy bất ngờ.\n\n\"A Game of Thrones\" đã trở thành một tác phẩm văn học quan trọng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về quyền lực, tình người và sự khắc nghiệt của cuộc sống. Nó tiếp tục làm cho độc giả kịch tính và chăm chú với những câu chuyện phức tạp và sự phản ánh về con người và xã hội.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F65%2Fa-game-of-thrones.jpg?alt=media&token=4b294778-d1f2-45a7-bbd7-64cd965fa720",
      "price": 299000,
      "saleOff": 0.05,
      "stars": 91,
      "votes": 30
    },
    {
      "id": 66,
      "title": "The Hunger Games",
      "author": "Suzanne Collins",
      "category": "Romance",
      "releaseDate": "2022-07-16",
      "pages": 384,
      "quantitySold": 37,
      "note": "\"The Hunger Games\" là cuốn đầu tiên trong loạt tiểu thuyết cùng tên của nhà văn người Mỹ Suzanne Collins, xuất bản lần đầu vào năm 2008. Cuốn sách này mang đến một câu chuyện phiêu lưu và đấu tranh cho tự do và sự công bằng trong một tương lai tàn bạo.\n\n\"The Hunger Games\" diễn ra trong một tương lai xa xôi, trong một xã hội phân chia thành các quận nô lệ và thống trị bởi Thủ đô. Mỗi năm, Thủ đô tổ chức Cuộc thi Sinh tồn, nơi mỗi quận phải đưa ra một chàng trai và một cô gái trẻ tuổi để chiến đấu đến chết trong một trò chơi nguy hiểm trên truyền hình trực tiếp. Cuốn sách theo chân Katniss Everdeen, một cô gái trẻ từ Quận 12, khi cô tham gia Cuộc thi Sinh tồn và đấu tranh để sống sót và thách thức chế độ tàn bạo.\n\n\"The Hunger Games\" khám phá về quyền tự do, tình yêu và sự đấu tranh cho công bằng trong một xã hội áp đặt và bạo lực. Cuốn sách đặt câu hỏi về đạo đức, tình huống biệt lập và quyền tự do cá nhân. Nó mang đến một cái nhìn sắc nét và gay gắt về sự khủng bố và sự kiên cường của con người.\n\nSuzanne Collins sử dụng ngôn ngữ đầy sức mạnh và mô tả hấp dẫn để tái hiện cảnh quan và tâm trạng của trò chơi Sinh tồn. Cuốn sách mang đến cho độc giả một trải nghiệm kịch tính và căng thẳng với những tình tiết hấp dẫn và câu chuyện cuốn hút.\n\n\"The Hunger Games\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, tự do và sự khắc nghiệt của xã hội. Nó tiếp tục làm cho độc giả căng thẳng và suy ngẫm về tầm quan trọng của tự do và lòng can đảm trong cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F66%2Fthe-hunger-games.jpg?alt=media&token=ed06388b-b7cd-4071-bacb-320caa25957d",
      "price": 5690700,
      "saleOff": 0.3,
      "stars": 77,
      "votes": 18
    },
    {
      "id": 67,
      "title": "The Fault in Our Stars",
      "author": "John Green",
      "category": "Literary fiction",
      "releaseDate": "2022-07-17",
      "pages": 313,
      "quantitySold": 78,
      "note": "\"The Fault in Our Stars\" là một tiểu thuyết của nhà văn người Mỹ John Green, xuất bản lần đầu vào năm 2012. Cuốn sách này mang đến một câu chuyện cảm động và sâu sắc về tình yêu, sự sống và sự đối mặt với bệnh tật.\n\n\"The Fault in Our Stars\" kể về Hazel Grace Lancaster, một cô gái trẻ sống với căn bệnh ung thư phổi. Trong một nhóm hỗ trợ bệnh nhân ung thư, cô gặp Augustus Waters, một chàng trai trẻ và quyến rũ. Hai người bắt đầu một mối quan hệ tình yêu đầy xúc cảm và phi thường, chia sẻ những niềm vui, nỗi đau và sự ngưỡng mộ cho nhau trong hành trình của họ.\n\n\"The Fault in Our Stars\" khám phá về tình yêu, sự sống và ý nghĩa của cuộc sống trong điều kiện khó khăn. Cuốn sách đặt câu hỏi về ý nghĩa và giá trị của cuộc sống, sự mất mát và niềm hy vọng. Nó mang đến một cái nhìn sâu sắc và chân thực về tình người và sự tận hưởng cuộc sống.\n\nJohn Green sử dụng ngôn ngữ tinh tế và mô tả đa chiều để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm cảm động và xúc động với những câu chuyện đẹp và tình cảm của Hazel và Augustus.\n\n\"The Fault in Our Stars\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, sự sống và sự nguyên bản của con người. Nó tiếp tục làm cho độc giả động lòng và suy ngẫm về ý nghĩa của cuộc sống và tình người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F67%2Fthe-fault-in-our-stars.jpg?alt=media&token=c91abc1a-38fc-4564-9977-a8ede7ef29a4",
      "price": 309000,
      "saleOff": 0.25,
      "stars": 106,
      "votes": 29
    },
    {
      "id": 68,
      "title": "The Giver",
      "author": "Lois Lowry",
      "category": "Classics",
      "releaseDate": "2022-07-18",
      "pages": 240,
      "quantitySold": 113,
      "note": "\"The Giver\" là một tiểu thuyết của nhà văn người Mỹ Lois Lowry, xuất bản lần đầu vào năm 1993. Cuốn sách này mang đến một câu chuyện khoa học viễn tưởng và triết lý xã hội về một thế giới tưởng tượng nơi mọi sự lựa chọn và cảm xúc đều bị kiểm soát và bị tước đoạt.\n\n\"The Giver\" lấy bối cảnh trong một xã hội tương lai tưởng tượng, nơi mọi người sống trong một cộng đồng đồng nhất và không có sự khác biệt. Cuộc sống của Jonas, một thiếu niên được chọn làm Người trao diều, thay đổi khi anh bắt đầu nhận thức về sự cưỡng chế và sự thiếu thiếu tự do trong xã hội của mình. Như anh tiếp nhận kiến thức và ký ức từ Người trao diều trước đó, anh phải đối mặt với những quyết định khó khăn và quyền tự do cá nhân.\n\n\"The Giver\" khám phá về sự tự do, quyền lựa chọn và quyền kiểm soát. Cuốn sách đặt câu hỏi về tình người, sự công bằng và giá trị của cảm xúc con người. Nó mang đến một cái nhìn sắc nét và sâu sắc về nhân văn và ý nghĩa của cuộc sống.\n\nLois Lowry sử dụng ngôn ngữ đơn giản nhưng tác động để tái hiện cảnh quan và tâm trạng trong xã hội kiểm soát. Cuốn sách mang đến cho độc giả một trải nghiệm suy nghĩ và khám phá với những câu chuyện đầy cảm xúc và tác động.\n\n\"The Giver\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tự do, nhân quyền và sự tự do tư tưởng. Nó tiếp tục làm cho độc giả suy ngẫm và thách thức về bản chất của cuộc sống và quyền lựa chọn.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F68%2Fthe-giver.jpg?alt=media&token=9c2d0f21-7fb9-4263-a794-5c51e6b72ef1",
      "price": 217500,
      "saleOff": 0.1,
      "stars": 151,
      "votes": 42
    },
    {
      "id": 69,
      "title": "The Perks of Being a Wallflower",
      "author": "Stephen Chbosky",
      "category": "Historical fiction",
      "releaseDate": "2022-07-19",
      "pages": 224,
      "quantitySold": 64,
      "note": "\"The Perks of Being a Wallflower\" là một tiểu thuyết của nhà văn người Mỹ Stephen Chbosky, xuất bản lần đầu vào năm 1999. Cuốn sách này mang đến một câu chuyện tình cảm và trưởng thành về sự khám phá bản thân và tìm kiếm ý nghĩa trong cuộc sống.\n\n\"The Perks of Being a Wallflower\" được kể từ góc nhìn của Charlie, một cậu học sinh trung học nhút nhát và thích viết nhật ký. Cậu mô tả cuộc sống hàng ngày của mình thông qua những bức thư gửi cho một người bạn vô danh. Trong quá trình học tập và lớn lên, Charlie gặp gỡ nhóm bạn mới và trải qua những trải nghiệm đầu đời, như tình bạn, tình yêu, và khám phá những khía cạnh mới của bản thân.\n\n\"The Perks of Being a Wallflower\" khám phá về tình bạn, tình yêu và sự tìm kiếm danh vọng trong những năm tháng tuổi trẻ. Cuốn sách đặt câu hỏi về sự chấp nhận, sự tự tin và quyền tự do cá nhân. Nó mang đến một cái nhìn nhạy cảm và chân thực về tâm lý và sự phát triển của con người.\n\nStephen Chbosky sử dụng ngôn ngữ đơn giản và chân thành để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm độc đáo và thấu hiểu với những câu chuyện thú vị và sự tương tác giữa các nhân vật.\n\n\"The Perks of Being a Wallflower\" đã trở thành một tác phẩm văn học ưa thích và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình bạn, tình yêu và quá trình trưởng thành. Nó tiếp tục làm cho độc giả đồng cảm và suy ngẫm về sự khám phá bản thân và ý nghĩa của cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F69%2Fthe-perks-of-being-a-wallflower.jpg?alt=media&token=62b4fb08-0b37-4db1-88eb-e23e68e71093",
      "price": 202000,
      "saleOff": 0.15,
      "stars": 133,
      "votes": 42
    },
    {
      "id": 70,
      "title": "A Thousand Splendid Suns",
      "author": "Khaled Hosseini",
      "category": "Classics",
      "releaseDate": "2022-07-20",
      "pages": 432,
      "quantitySold": 113,
      "note": "\"A Thousand Splendid Suns\" là một tiểu thuyết của nhà văn người Afghanistan Khaled Hosseini, xuất bản lần đầu vào năm 2007. Cuốn sách này mang đến một câu chuyện cảm động và mạnh mẽ về tình yêu, hy vọng và sự kiên nhẫn trong thời kỳ chiến tranh và khủng hoảng ở Afghanistan.\n\n\"A Thousand Splendid Suns\" xoay quanh hai nhân vật chính, Mariam và Laila, hai phụ nữ sống trong một thời kỳ đầy bạo lực và áp bức. Họ bị rơi vào vòng xoáy của cuộc sống khắc nghiệt và phải đối mặt với sự tàn ác, đau khổ và mất mát. Tuy nhiên, qua tình yêu, sự đoàn kết và sự kiên nhẫn, họ tìm thấy hy vọng và sức mạnh để chiến đấu cho cuộc sống và tự do của mình.\n\n\"A Thousand Splendid Suns\" khám phá về tình yêu, sự kiên nhẫn và sự vượt lên trước khủng hoảng. Cuốn sách đặt câu hỏi về quyền bình đẳng, sự tự do và sự bền vững trong môi trường khắc nghiệt. Nó mang đến một cái nhìn sâu sắc và rộng lớn về tình người và lòng nhân ái.\n\nKhaled Hosseini sử dụng ngôn ngữ tinh tế và mô tả đầy sức mạnh để tái hiện cảnh quan và tâm trạng của cuộc sống ở Afghanistan. Cuốn sách mang đến cho độc giả một trải nghiệm đầy cảm xúc và thâm thúy với những câu chuyện đau đớn và tình cảm của các nhân vật.\n\n\"A Thousand Splendid Suns\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự tồn tại, sự kiên nhẫn và lòng nhân ái. Nó tiếp tục làm cho độc giả đồng cảm và suy ngẫm về tình yêu và hy vọng trong những thời kỳ khó khăn nhất.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F70%2Fa-thousand-splendid-suns.jpg?alt=media&token=37ca0373-6626-4b1a-b6f4-d03b360558ff",
      "price": 259600,
      "saleOff": 0,
      "stars": 45,
      "votes": 15
    },
    {
      "id": 71,
      "title": "The Lovely Bones",
      "author": "Alice Sebold",
      "category": "Classics",
      "releaseDate": "2022-07-21",
      "pages": 368,
      "quantitySold": 206,
      "note": "\"The Lovely Bones\" là một tiểu thuyết của nhà văn người Mỹ Alice Sebold, xuất bản lần đầu vào năm 2002. Cuốn sách này mang đến một câu chuyện đầy xúc cảm về sự mất mát, sự sống và sự dễ dãi trong đối diện với cái chết.\n\n\"The Lovely Bones\" được kể từ góc nhìn của Susie Salmon, một cô gái trẻ bị sát hại và từ cuộc sống sau khi chết, cô quan sát gia đình và bạn bè của mình từ vùng đất giữa cuộc sống và cái chết. Cô cố gắng hiểu và chấp nhận cái chết của mình trong khi người thân còn sống đối mặt với sự đau khổ, tìm kiếm công lý và cố gắng tiếp tục sống.\n\n\"The Lovely Bones\" khám phá về sự mất mát, sự hồi sinh và sức mạnh của tình yêu. Cuốn sách đặt câu hỏi về quyền công lý, sự tha thứ và sự trở lại của cuộc sống. Nó mang đến một cái nhìn sâu sắc và đầy cảm xúc về sự phản ánh và sự khắc nghiệt của cuộc sống.\n\nAlice Sebold sử dụng ngôn ngữ nhẹ nhàng và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của cuộc sống sau cái chết. Cuốn sách mang đến cho độc giả một trải nghiệm độc đáo và cảm động với những câu chuyện thăng trầm và sự phát triển của nhân vật.\n\n\"The Lovely Bones\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự sống, sự mất mát và sự trân trọng cuộc sống. Nó tiếp tục làm cho độc giả suy ngẫm và đặt câu hỏi về ý nghĩa và giá trị của cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F71%2Fthe-lovely-bones.jpg?alt=media&token=728c3c50-a179-4867-b1e5-3b175b8176d2",
      "price": 549000,
      "saleOff": 0.26,
      "stars": 302,
      "votes": 72
    },
    {
      "id": 72,
      "title": "The Da Vinci Code",
      "author": "Dan Brown",
      "category": "Classics",
      "releaseDate": "2022-07-22",
      "pages": 689,
      "quantitySold": 57,
      "note": "\"The Da Vinci Code\" là một tiểu thuyết của nhà văn người Mỹ Dan Brown, xuất bản lần đầu vào năm 2003. Cuốn sách này mang đến một câu chuyện hấp dẫn và gây cấn về âm mưu, bí mật và cuộc săn lùng để khám phá một bí mật cổ đại đặc biệt.\n\n\"The Da Vinci Code\" bắt đầu khi nhân vật chính, Robert Langdon, một nhà khảo cổ học nổi tiếng, được kéo vào một cuộc phiêu lưu đầy nguy hiểm và đau khổ sau khi một giáo sĩ bị sát hại. Langdon cùng với Sophie Neveu, một nữ điệp viên thông minh, bắt đầu giải mã một loạt các mật mã và dấu hiệu để tìm ra một bí mật vĩ đại liên quan đến tổ chức Hội Thánh và hình ảnh nổi tiếng của Leonardo da Vinci.\n\n\"The Da Vinci Code\" khám phá về tôn giáo, lịch sử và tác động của các bí mật cổ đại. Cuốn sách đặt câu hỏi về sự tin tưởng, sự bất bình đẳng và sự thật. Nó mang đến một cái nhìn ly kỳ và gợi cảm về cuộc sống và những câu hỏi đáng ngạc nhiên.\n\nDan Brown sử dụng ngôn ngữ sống động và mô tả chi tiết để tái hiện cảnh quan và tâm trạng trong cuộc phiêu lưu đầy bí ẩn. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và gây cấn với những tình tiết hấp dẫn và những bước đi không ngừng.\n\n\"The Da Vinci Code\" đã trở thành một tác phẩm văn học ăn khách và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tôn giáo, lịch sử và bản chất con người. Nó tiếp tục làm cho độc giả hồi hộp và tò mò về sự thật ẩn giấu và cuộc sống đầy bí ẩn.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F72%2Fthe-da-vinci-code.jpg?alt=media&token=ddb5e04e-10f3-4e8b-ad6a-dad180f417cc",
      "price": 360700,
      "saleOff": 0.12,
      "stars": 199,
      "votes": 46
    },
    {
      "id": 73,
      "title": "The Old Man and the Sea",
      "author": "Ernest Hemingway",
      "category": "Fantasy",
      "releaseDate": "2022-07-23",
      "pages": 127,
      "quantitySold": 75,
      "note": "\"The Old Man and the Sea\" (Ông già và biển cả) là một tiểu thuyết của nhà văn người Mỹ Ernest Hemingway, xuất bản lần đầu vào năm 1952. Cuốn sách này mang đến một câu chuyện đơn giản nhưng đầy tinh thần về sức mạnh của ý chí, hy vọng và sự chiến đấu với số phận.\n\n\"The Old Man and the Sea\" kể về Santiago, một ngư dân già yếu và cô đơn, người đã trải qua một chuỗi thất bại trong việc bắt cá. Anh quyết tâm đi xa hơn ra khơi để bắt được một con cá lớn, và sau một cuộc đấu tranh dữ dội kéo dài, Santiago bắt được một con cá lớn hùng vĩ. Tuy nhiên, trên đường trở về, anh phải đối mặt với cuộc chiến với cá mập và các khó khăn khác để bảo vệ con cá của mình.\n\n\"The Old Man and the Sea\" khám phá về bản chất con người, hy vọng và ý chí chiến đấu. Cuốn sách đặt câu hỏi về sự kiên nhẫn, sự vươn lên và ý nghĩa của cuộc sống. Nó mang đến một cái nhìn sâu sắc và lắng đọng về sự bền bỉ và lòng dũng cảm của con người.\n\nErnest Hemingway sử dụng ngôn ngữ đơn giản và trực quan để tái hiện cảnh quan và tâm trạng của biển cả và cuộc sống của ngư dân. Cuốn sách mang đến cho độc giả một trải nghiệm tĩnh lặng và sâu lắng với những hình ảnh tươi sáng và ý nghĩa.\n\n\"The Old Man and the Sea\" đã trở thành một tác phẩm văn học nổi tiếng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sức mạnh của tinh thần con người và sự đấu tranh với số phận. Nó tiếp tục làm cho độc giả suy ngẫm và tôn trọng về lòng kiên nhẫn và ý chí.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F73%2Fthe-old-man-and-the-sea.jpg?alt=media&token=59b96493-ea84-40df-b385-ec5e91999204",
      "price": 324000,
      "saleOff": 0,
      "stars": 102,
      "votes": 29
    },
    {
      "id": 74,
      "title": "The Curious Incident of the Dog in the Night-Time",
      "author": "Mark Haddon",
      "category": "Fantasy",
      "releaseDate": "2022-07-24",
      "pages": 274,
      "quantitySold": 420,
      "note": "\"The Curious Incident of the Dog in the Night-Time\" là một tiểu thuyết của nhà văn người Anh Mark Haddon, xuất bản lần đầu vào năm 2003. Cuốn sách này mang đến một câu chuyện độc đáo và sâu sắc về sự khám phá thế giới từ góc nhìn của một người tự kỷ.\n\n\"The Curious Incident of the Dog in the Night-Time\" được kể từ góc nhìn của Christopher Boone, một cậu bé 15 tuổi với rối loạn tự kỷ. Khi một chú chó hàng xóm bị sát hại, Christopher quyết định điều tra vụ án và ghi lại những phát hiện của mình trong một cuốn nhật ký. Trong quá trình điều tra, anh phải đối mặt với những bí mật gia đình và khám phá về chính mình.\n\n\"The Curious Incident of the Dog in the Night-Time\" khám phá về tình yêu, sự khác biệt và cuộc sống hàng ngày của người tự kỷ. Cuốn sách đặt câu hỏi về sự hiểu biết, sự nhạy bén và ý nghĩa của sự khác biệt. Nó mang đến một cái nhìn độc đáo và tình cảm về con người và cách chúng ta tương tác với nhau.\n\nMark Haddon sử dụng ngôn ngữ đơn giản và trực quan để tái hiện cảnh quan và tâm trạng của Christopher. Cuốn sách mang đến cho độc giả một trải nghiệm đầy tò mò và sự thâm thúy với những hình ảnh sống động và sự chân thực.\n\n\"The Curious Incident of the Dog in the Night-Time\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự khác biệt, tình yêu và sự đấu tranh với sự thay đổi. Nó tiếp tục làm cho độc giả suy ngẫm và cảm thông về trạng thái tâm lý và tâm trí của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F74%2Fthe-curious-incident-of-the-dog-in-the-night-time.jpg?alt=media&token=3ce73321-aa4b-4777-b659-fb0219464664",
      "price": 218000,
      "saleOff": 0.05,
      "stars": 223,
      "votes": 61
    },
    {
      "id": 75,
      "title": "The Book of Disquiet",
      "author": "Fernando Pessoa",
      "category": "Romance",
      "releaseDate": "2022-07-26",
      "pages": 544,
      "quantitySold": 37,
      "note": "\"The Book of Disquiet\" là một tác phẩm văn học của nhà văn người Bồ Đào Nha Fernando Pessoa, xuất bản lần đầu vào năm 1982. Tuy nhiên, cuốn sách được viết trong thế kỷ 20 bởi Bernardo Soares, một nhân vật giả tưởng do Pessoa tạo ra.\n\n\"The Book of Disquiet\" là một tập hợp các ghi chú, suy nghĩ và đoạn văn tưởng tượng của nhân vật chính. Cuốn sách không tuân theo một cốt truyện truyền thống, mà mang đến một dòng suy nghĩ sâu sắc và lờ mờ về cuộc sống, tồn tại và tâm lý con người.\n\nTrong \"The Book of Disquiet\", Bernardo Soares ghi lại những suy nghĩ về tình yêu, cô đơn, nỗi buồn và tình trạng chán nản của cuộc sống. Cuốn sách khám phá về sự tồn tại, nỗi thất vọng và ý nghĩa của sự chung thủy. Nó mang đến một cái nhìn sắc bén và tinh tế về tâm trí và tình cảm của con người.\n\nFernando Pessoa sử dụng ngôn ngữ tinh tế và mô tả sâu sắc để tái hiện cảnh quan và tâm trạng của nhân vật. Cuốn sách mang đến cho độc giả một trải nghiệm tư duy đầy sáng tạo và phức tạp với những câu văn lạc quan và cảm xúc.\n\n\"The Book of Disquiet\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự chán nản, nỗi cô đơn và sự tìm kiếm ý nghĩa trong cuộc sống. Nó tiếp tục làm cho độc giả suy ngẫm và thách thức về quan điểm và triết lý của chúng ta.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F75%2Fthe-book-of-disquiet.jpg?alt=media&token=d8153e10-6e65-4e99-acf8-8c0947fa1d19",
      "price": 369000,
      "saleOff": 0.1,
      "stars": 201,
      "votes": 46
    },
    {
      "id": 76,
      "title": "The Power of One",
      "author": "Bryce Courtenay",
      "category": "Literary fiction",
      "releaseDate": "2022-07-27",
      "pages": 576,
      "quantitySold": 78,
      "note": "\"The Power of One\" là một tiểu thuyết của nhà văn người Nam Phi Bryce Courtenay, xuất bản lần đầu vào năm 1989. Cuốn sách này mang đến một câu chuyện đầy cảm hứng và sự vươn lên trước khó khăn, mạnh mẽ và tình cảm về sự ảnh hưởng của một người đơn lẻ.\n\n\"The Power of One\" kể về cuộc đời của Peekay, một cậu bé gốc Anh sống ở Nam Phi trong thời kỳ Apartheid. Trong hành trình trưởng thành của mình, Peekay phải đối mặt với những khó khăn, bạo lực và sự phân biệt chủng tộc. Tuy nhiên, qua sự kiên nhẫn, tài năng và lòng tự tin, Peekay vượt qua những trở ngại và trở thành một võ sĩ quyền Anh tài ba, mang theo thông điệp của sự thống nhất và hy vọng.\n\n\"The Power of One\" khám phá về sự tự do, sự công bằng và quyền lực của một người đơn lẻ. Cuốn sách đặt câu hỏi về sự kiên nhẫn, lòng kiên trì và sức mạnh của tình yêu và nhân đạo. Nó mang đến một cái nhìn sắc nét và đầy cảm xúc về sự vượt lên trước khó khăn và quyền tự do cá nhân.\n\nBryce Courtenay sử dụng ngôn ngữ sinh động và mô tả sâu sắc để tái hiện cảnh quan và tâm trạng của cuộc sống ở Nam Phi. Cuốn sách mang đến cho độc giả một trải nghiệm đầy cảm hứng và sự kiên nhẫn với những câu chuyện hấp dẫn và những nhân vật đáng nhớ.\n\n\"The Power of One\" đã trở thành một tác phẩm văn học nổi tiếng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sức mạnh của một người đơn lẻ, sự thống nhất và tầm quan trọng của việc xây dựng cầu nối giữa các cá nhân. Nó tiếp tục làm cho độc giả cảm nhận và cảm thông về sự kiên trì và tình yêu thương trong cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F76%2Fthe-power-of-one.jpg?alt=media&token=391bbd48-54eb-4113-9702-24724e35d174",
      "price": 120800,
      "saleOff": 0,
      "stars": 121,
      "votes": 34
    },
    {
      "id": 77,
      "title": "The Name of the Wind",
      "author": "Patrick Rothfuss",
      "category": "Classics",
      "releaseDate": "2022-07-28",
      "pages": 662,
      "quantitySold": 113,
      "note": "\"The Name of the Wind\" là một tiểu thuyết của nhà văn người Mỹ Patrick Rothfuss, xuất bản lần đầu vào năm 2007. Cuốn sách này mang đến một câu chuyện phong phú về phiêu lưu, ma thuật và cuộc sống của một nhân vật huyền thoại.\n\n\"The Name of the Wind\" được kể từ góc nhìn của Kvothe, một nhà lưu trữ và nhà ngoại giao, người đã trải qua những cuộc phiêu lưu đầy thách thức và nguy hiểm trong quá khứ của mình. Anh ta kể lại câu chuyện của mình cho một nhà sử học, từ cuộc sống nghèo khó ở một làng nhỏ đến việc học ở trường đại học ma thuật và cuộc tìm kiếm vô danh để tìm hiểu về \"Tên của gió\".\n\n\"The Name of the Wind\" khám phá về sức mạnh của từ ngữ, sự khám phá bản thân và sự đấu tranh với số phận. Cuốn sách đặt câu hỏi về sự thật, sự linh hoạt và sự kiên nhẫn trong việc đạt đến mục tiêu. Nó mang đến một cái nhìn sâu sắc và phức tạp về trí tuệ và sự truyền cảm hứng.\n\nPatrick Rothfuss sử dụng ngôn ngữ tinh tế và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của thế giới hư cấu. Cuốn sách mang đến cho độc giả một trải nghiệm hấp dẫn và sắc nét với những mô tả sống động và tình tiết đặc sắc.\n\n\"The Name of the Wind\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự mê hoặc của câu chuyện, sức mạnh của trí tưởng tượng và sự tìm kiếm sự thật. Nó tiếp tục làm cho độc giả thích thú và mê đắm trong thế giới của những câu chuyện và ma thuật.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F77%2Fthe-name-of-the-wind.jpg?alt=media&token=98474abd-e894-4cb2-9f62-60a14b3c5e1b",
      "price": 260000,
      "saleOff": 0,
      "stars": 194,
      "votes": 56
    },
    {
      "id": 78,
      "title": "The Shadow of the Wind",
      "author": "Carlos Ruiz Zafón",
      "category": "Historical fiction",
      "releaseDate": "2022-07-29",
      "pages": 565,
      "quantitySold": 64,
      "note": "\"The Shadow of the Wind\" là một tiểu thuyết của nhà văn người Tây Ban Nha Carlos Ruiz Zafón, xuất bản lần đầu vào năm 2001. Cuốn sách này mang đến một câu chuyện ly kỳ, bí ẩn và lãng mạn về tình yêu với sách và sức mạnh của từ ngữ.\n\n\"The Shadow of the Wind\" kể về Daniel Sempere, một cậu bé trẻ sống ở Barcelona vào những năm 1940. Anh tình cờ khám phá một cuốn sách hiếm có có tựa đề \"The Shadow of the Wind\" và bắt đầu điều tra về tác giả của cuốn sách này. Trong quá trình điều tra, Daniel phát hiện ra những bí mật bất ngờ, âm mưu và nguy hiểm liên quan đến cuốn sách và tác giả.\n\n\"The Shadow of the Wind\" khám phá về quyền lực của từ ngữ, tình yêu, sự mất mát và quyền tự do cá nhân. Cuốn sách đặt câu hỏi về sự thật, sự ảo tưởng và giá trị của nghệ thuật. Nó mang đến một cái nhìn sâu sắc và lãng mạn về sự sáng tạo và quyền lực của trí tưởng tượng.\n\nCarlos Ruiz Zafón sử dụng ngôn ngữ tinh tế và mô tả đặc sắc để tái hiện cảnh quan và tâm trạng của thành phố Barcelona và thế giới trong cuốn sách. Cuốn sách mang đến cho độc giả một trải nghiệm phiêu lưu và mê hoặc với những mô tả tường tận và tình tiết căng thẳng.\n\n\"The Shadow of the Wind\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về quyền tự do, quyền lựa chọn và sức mạnh của từ ngữ. Nó tiếp tục làm cho độc giả mê hoặc và tò mò trong cuộc phiêu lưu và sự khám phá của nhân vật.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F78%2Fthe-shadow-of-the-wind.jpg?alt=media&token=af6860d6-bf67-4d17-b744-6f2c4c847308",
      "price": 439500,
      "saleOff": 0.21,
      "stars": 92,
      "votes": 26
    },
    {
      "id": 79,
      "title": "The Remains of the Day",
      "author": "Kazuo Ishiguro",
      "category": "Classics",
      "releaseDate": "2022-07-30",
      "pages": 258,
      "quantitySold": 113,
      "note": "\"The Remains of the Day\" là một tiểu thuyết của nhà văn người Anh Kazuo Ishiguro, xuất bản lần đầu vào năm 1989. Cuốn sách này mang đến một câu chuyện tĩnh lặng và đầy xúc cảm về cuộc sống, nhớ lại và sự tiếc nuối.\n\n\"The Remains of the Day\" kể về Stevens, một quản gia trung thành và tận tâm dành cả cuộc đời của mình cho việc phục vụ Lord Darlington, một chủ nhân tinh tế và quý tộc. Cuốn sách lần theo những suy nghĩ của Stevens trong một chuyến đi xa để gặp lại cựu nữ nhân viên nhằm tìm hiểu về quá khứ và những sự lựa chọn mà anh đã làm trong cuộc sống.\n\n\"The Remains of the Day\" khám phá về sự thất vọng, sự hiểu lầm và sự hối tiếc. Cuốn sách đặt câu hỏi về ý nghĩa của trung thành, tự thân và sự cống hiến. Nó mang đến một cái nhìn sắc bén và sâu sắc về cuộc sống và sự nhìn lại.\n\nKazuo Ishiguro sử dụng ngôn ngữ tinh tế và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của thời kỳ giữa hai cuộc chiến tranh. Cuốn sách mang đến cho độc giả một trải nghiệm tĩnh lặng và cảm động với những mô tả tinh tế và tâm trạng sâu sắc.\n\n\"The Remains of the Day\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về cuộc sống, tự do và sự đánh đổi trong quyết định của chúng ta. Nó tiếp tục làm cho độc giả suy ngẫm và tình cảm về sự hiểu biết và nhân đạo trong cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F79%2Fthe-remains-of-the-day.jpg?alt=media&token=9a7b7be0-ba09-408d-aa86-b6847e6ed07f",
      "price": 211500,
      "saleOff": 0,
      "stars": 110,
      "votes": 28
    },
    {
      "id": 80,
      "title": "The God of Small Things",
      "author": "Arundhati Roy",
      "category": "Fantasy",
      "releaseDate": "2022-07-31",
      "pages": 352,
      "quantitySold": 206,
      "note": "\"The God of Small Things\" là một tiểu thuyết của nhà văn người Ấn Độ Arundhati Roy, xuất bản lần đầu vào năm 1997. Cuốn sách này mang đến một câu chuyện đầy màu sắc và xúc cảm về gia đình, tình yêu và những bi kịch của cuộc sống.\n\n\"The God of Small Things\" kể về hai chị em sinh đôi Estha và Rahel, sống ở khu vực Kerala, miền nam Ấn Độ. Cuốn sách xoay quanh câu chuyện về tuổi thơ của họ, những kỷ niệm đau buồn và những sự kiện định mệnh trong gia đình. Bằng cách lồng ghép các cảnh quan, nhân vật và thời gian, tác giả tái hiện một bức tranh phức tạp về tình yêu, tự do và đau khổ.\n\n\"The God of Small Things\" khám phá về tình yêu cấm định mệnh, bạo lực gia đình và xung đột giữa xã hội và cá nhân. Cuốn sách đặt câu hỏi về sự chấp nhận và sự tồn tại, sự kìm hãm và giải phóng. Nó mang đến một cái nhìn tinh tế và sâu sắc về con người và những điều nhỏ bé trong cuộc sống.\n\nArundhati Roy sử dụng ngôn ngữ tươi sáng và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của miền nam Ấn Độ. Cuốn sách mang đến cho độc giả một trải nghiệm đa chiều với những hình ảnh sống động và tình tiết đặc sắc.\n\n\"The God of Small Things\" đã trở thành một tác phẩm văn học nổi tiếng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, tự do và sự đấu tranh với xã hội. Nó tiếp tục làm cho độc giả suy ngẫm và cảm nhận về những đau thương và hy vọng trong cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F80%2Fthe-god-of-small-things.jpg?alt=media&token=4e4c6f63-5959-483b-b191-fddcd0d3a9b4",
      "price": 469000,
      "saleOff": 0.15,
      "stars": 304,
      "votes": 80
    },
    {
      "id": 81,
      "title": "The Hand of Fatima",
      "author": "Ildefonso Falcones",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 971,
      "quantitySold": 57,
      "note": "\"El Puño de Dios\" (The Hand of Fatima) là một tiểu thuyết của nhà văn người Tây Ban Nha Ildefonso Falcones, xuất bản lần đầu vào năm 2009. Cuốn sách này lấy bối cảnh ở Tây Ban Nha thế kỷ 16 và mang đến một câu chuyện lịch sử đầy phiêu lưu, đấu tranh và tình yêu.\n\n\"The Hand of Fatima\" kể về cuộc đời của Hernando, một người đàn ông sống trong thời kỳ đóng góp của người Hồi giáo, Cơ đốc giáo và Do thái trong lịch sử Tây Ban Nha. Cuốn sách theo chân Hernando qua những cuộc phiêu lưu và cuộc đấu tranh để tìm kiếm sự tự do và bảo vệ gia đình và văn hóa của mình.\n\n\"The Hand of Fatima\" khám phá về tôn giáo, chính trị và xã hội trong thời kỳ đầy rẫy sự xung đột. Cuốn sách đặt câu hỏi về sự công bằng, lòng kiên nhẫn và sự đoàn kết của con người. Nó mang đến một cái nhìn sắc bén và đa chiều về cuộc sống và sự đấu tranh của con người.\n\nIldefonso Falcones sử dụng ngôn ngữ tươi sáng và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của thời kỳ lịch sử. Cuốn sách mang đến cho độc giả một trải nghiệm lịch sử và văn hóa đa chiều với những mô tả sống động và tình tiết căng thẳng.\n\n\"The Hand of Fatima\" đã trở thành một tác phẩm văn học nổi tiếng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tôn giáo, tình yêu và sự đấu tranh vì tự do. Nó tiếp tục làm cho độc giả suy ngẫm và cảm nhận về những giá trị và niềm tin của con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F81%2Fthe-hand-of-fatima.jpg?alt=media&token=41fd98ae-65a3-44ea-a430-673bdba411eb",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 82,
      "title": "The Nightingale",
      "author": "Kristin Hannah",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 608,
      "quantitySold": 57,
      "note": "\"The Nightingale\" là một tiểu thuyết của nhà văn người Mỹ Kristin Hannah, xuất bản lần đầu vào năm 2015. Cuốn sách này lấy bối cảnh trong Thế chiến II và mang đến một câu chuyện xúc động và đầy can đảm về tình yêu, sự hy sinh và sự kiên cường trong thời kỳ chiến tranh.\n\n\"The Nightingale\" kể về hai chị em gái, Vianne và Isabelle, sống ở nước Pháp trong thời kỳ chiến tranh. Mỗi người chịu đựng những thử thách và đau khổ riêng của mình. Vianne phải đối mặt với việc nuôi con một mình và bảo vệ gia đình trong khi chồng cô ở chiến trường. Trong khi đó, Isabelle tham gia vào phong trào kháng chiến và trở thành một nhân vật quan trọng trong cuộc chiến.\n\n\"The Nightingale\" khám phá về tình yêu, hy sinh và lòng dũng cảm trong thời kỳ khó khăn và tàn bạo. Cuốn sách đặt câu hỏi về lòng trung thành, sự đấu tranh và giá trị của cuộc sống. Nó mang đến một cái nhìn sắc nét và xúc động về sự kiên cường và lòng nhân ái trong tình huống khốc liệt.\n\nKristin Hannah sử dụng ngôn ngữ tươi sáng và mô tả tinh tế để tái hiện cảnh quan và tâm trạng của chiến tranh. Cuốn sách mang đến cho độc giả một trải nghiệm cảm động và hấp dẫn với những mô tả sống động và tình tiết căng thẳng.\n\n\"The Nightingale\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, hy sinh và sự kiên cường trong cuộc sống. Nó tiếp tục làm cho độc giả cảm nhận và cảm thông về những trải nghiệm và tình cảm của nhân vật trong thời kỳ chiến tranh.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F82%2Fthe-nightingale.jpg?alt=media&token=9ed3a297-f57b-4b80-a14f-babfba24e650",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 214,
      "votes": 53
    },
    {
      "id": 83,
      "title": "The Goldfinch",
      "author": "Donna Tartt",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 784,
      "quantitySold": 57,
      "note": "\"The Goldfinch\" là một tiểu thuyết của nhà văn người Mỹ Donna Tartt, xuất bản lần đầu vào năm 2013. Cuốn sách này mang đến một câu chuyện phức tạp và sâu sắc về mất mát, nghệ thuật và những cuộc phiêu lưu đầy nguy hiểm và lãng mạn.\n\n\"The Goldfinch\" kể về Theo Decker, một cậu bé 13 tuổi sống ở New York. Cuộc đời của Theo thay đổi vĩnh viễn khi anh chứng kiến một vụ nổ bom ở Bảo tàng Metropolitan và tình cờ lấy một bức tranh có tên \"Chú chim Sẻ vàng\" của họa sĩ Carel Fabritius. Cuốn sách theo chân Theo qua cuộc sống của anh, từ tuổi thơ đến người trưởng thành, trong cuộc phiêu lưu đầy giả tạo và tình yêu không đáng tin cậy.\n\n\"The Goldfinch\" khám phá về sự mất mát, sự tìm kiếm và sự nghiệp nghệ thuật. Cuốn sách đặt câu hỏi về ý nghĩa của sự đau khổ, sự tồn tại và ý nghĩa của nghệ thuật trong cuộc sống. Nó mang đến một cái nhìn sắc nét và phức tạp về con người và sự trải nghiệm của chúng ta.\n\nDonna Tartt sử dụng ngôn ngữ tinh tế và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của New York và thế giới nghệ thuật. Cuốn sách mang đến cho độc giả một trải nghiệm đa chiều với những mô tả sống động và tình tiết căng thẳng.\n\n\"The Goldfinch\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về nghệ thuật, sự mất mát và ý nghĩa của cuộc sống. Nó tiếp tục làm cho độc giả cảm nhận và cảm động về sự phức tạp và đau thương trong tình huống con người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F83%2Fthe-goldfinch.jpg?alt=media&token=39165abc-b891-4a25-b876-0a7c4dd8d856",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 214,
      "votes": 53
    },
    {
      "id": 84,
      "title": "The Thirteenth Tale",
      "author": "Diane Setterfield",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 416,
      "quantitySold": 57,
      "note": "\"The Thirteenth Tale\" là một tiểu thuyết của nhà văn người Anh Diane Setterfield, xuất bản lần đầu vào năm 2006. Cuốn sách này mang đến một câu chuyện đầy bí ẩn và ly kỳ về gia đình, bí mật và quá khứ.\n\n\"The Thirteenth Tale\" kể về Margaret Lea, một người viết sách không nổi và cuộc gặp gỡ của cô với Vida Winter, một nhà văn nổi tiếng và bí ẩn. Vida Winter mời Margaret đến nhà của mình để viết cuốn tự truyện cuối cùng của mình. Trong quá trình này, Margaret phải tìm hiểu về quá khứ phức tạp và những bí mật đen tối của gia đình Winter.\n\n\"The Thirteenth Tale\" khám phá về sự thật, truyền thuyết và sự khám phá của bản thân. Cuốn sách đặt câu hỏi về bản chất của sự thật và tác động của quá khứ lên hiện tại. Nó mang đến một cái nhìn tinh tế và đa chiều về quyền lực của câu chuyện và sức mạnh của từ ngữ.\n\nDiane Setterfield sử dụng ngôn ngữ tinh tế và mô tả đặc sắc để tái hiện cảnh quan và tâm trạng của câu chuyện. Cuốn sách mang đến cho độc giả một trải nghiệm ly kỳ và hấp dẫn với những mô tả tươi sáng và tình tiết căng thẳng.\n\n\"The Thirteenth Tale\" đã trở thành một tác phẩm văn học nổi tiếng và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự thật, quyền lực của câu chuyện và sự tìm kiếm của con người. Nó tiếp tục làm cho độc giả say mê và suy ngẫm về sự phức tạp và hấp dẫn của thế giới câu chuyện.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F84%2Fthe-thirteenth-tale.jpg?alt=media&token=ffeaef9f-3ef1-4c2b-b32a-7f3fb12c719c",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 85,
      "title": "The Miniaturist",
      "author": "Jessie Burton",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 432,
      "quantitySold": 57,
      "note": "\"The Miniaturist\" là một tiểu thuyết của nhà văn người Anh Jessie Burton, xuất bản lần đầu vào năm 2014. Cuốn sách này mang đến một câu chuyện lịch sử đầy bí ẩn và ám ảnh về tình yêu, bí mật và sự tự do.\n\n\"The Miniaturist\" kể về Nella Oortman, một cô gái trẻ từ vùng quê đến sống ở Amsterdam vào thế kỷ 17. Cô kết hôn với Johannes Brandt, một nhân viên thương gia giàu có và sở hữu một ngôi nhà xa hoa. Tặng phẩm chú chim thi nhỏ từ người chồng bí ẩn, Nella bắt đầu thuê một người tạo hình thu nhỏ để tạo ra những bức tranh đời sống nhỏ bé. Nhưng từng món đồ thu nhỏ này bắt đầu phản ánh những bí mật và sự nguy hiểm trong cuộc sống của gia đình Brandt.\n\n\"The Miniaturist\" khám phá về quyền lực, sự phản bội và tự do cá nhân. Cuốn sách đặt câu hỏi về vấn đề giới tính, tôn giáo và xã hội trong thời kỳ khắc nghiệt. Nó mang đến một cái nhìn sắc nét và tinh tế về sự bất công và khó khăn của con người.\n\nJessie Burton sử dụng ngôn ngữ tươi sáng và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của Amsterdam vào thời kỳ 17. Cuốn sách mang đến cho độc giả một trải nghiệm cảm động và mê hoặc với những mô tả sống động và tình tiết căng thẳng.\n\n\"The Miniaturist\" đã trở thành một tác phẩm văn học đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, sự phản bội và quyền tự do. Nó tiếp tục làm cho độc giả tò mò và tưởng tượng về những bí ẩn và điều kỳ diệu của cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F85%2Fthe-miniaturist.jpg?alt=media&token=1ede2132-8c22-4744-ab51-6b6027eac54c",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 86,
      "title": "The Silent Patient",
      "author": "Alex Michaelides",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 368,
      "quantitySold": 57,
      "note": "\"The Silent Patient\" là một tiểu thuyết gây căn thịt của nhà văn người Anh Alex Michaelides, xuất bản lần đầu vào năm 2019. Cuốn sách này mang đến một câu chuyện ly kỳ và đầy kịch tính về tội ác, tâm lý và bí ẩn.\n\n\"The Silent Patient\" kể về Alicia Berenson, một họa sĩ tài năng bị câm và bị kết tội vì ám sát chồng mình, Gabriel. Sau vụ án, Alicia từ chối nói một lời và được chuyển đến một viện tâm thần tại London. Theo dõi cuộc sống của Alicia là Theo Faber, một nhà tâm lý học tò mò và quyết tâm tìm ra sự thật về vụ án.\n\n\"The Silent Patient\" khám phá về tội ác, tâm lý và khả năng phục hồi. Cuốn sách đặt câu hỏi về sự lừa dối, tội lỗi và quyền lực của lời nói. Nó mang đến một cái nhìn sắc nét và gợi cảm về con người và sự đau khổ.\n\nAlex Michaelides sử dụng ngôn ngữ tinh tế và mô tả đặc sắc để tái hiện cảnh quan và tâm trạng của cuộc sống trong viện tâm thần. Cuốn sách mang đến cho độc giả một trải nghiệm căng thẳng và hấp dẫn với những mô tả sống động và tình tiết đầy bất ngờ.\n\n\"The Silent Patient\" đã trở thành một tác phẩm văn học ăn khách và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tội lỗi, sự trở ngại và sức mạnh của lời nói. Nó tiếp tục khiến độc giả mê hoặc và tò mò với những vòng xoáy tâm lý và bí ẩn trong câu chuyện.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F86%2Fthe-silent-patient.jpg?alt=media&token=8440e300-6e70-46ea-a0bf-a27183c82808",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 87,
      "title": "The Rosie Project",
      "author": "Graeme Simsion",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 304,
      "quantitySold": 57,
      "note": "\"The Rosie Project\" là một tiểu thuyết của nhà văn người Úc Graeme Simsion, xuất bản lần đầu vào năm 2013. Cuốn sách này mang đến một câu chuyện hài hước và đáng yêu về tình yêu và sự khác biệt.\n\n\"The Rosie Project\" kể về Don Tillman, một nhà khoa học máy tính thiên tài nhưng gặp khó khăn trong các mối quan hệ xã hội. Để tìm một người phù hợp làm vợ, Don quyết định tạo ra \"Dự án Rosie\" - một bộ thuật toán để tìm kiếm người phụ nữ lý tưởng. Nhưng sau đó, Rosie Jarman, một phụ nữ hoàn toàn trái ngược với tiêu chuẩn của Don, xuất hiện trong cuộc đời anh và gây ra những biến đổi không ngờ.\n\n\"The Rosie Project\" khám phá về sự khác biệt, sự chấp nhận và tình yêu. Cuốn sách đặt câu hỏi về quy tắc xã hội và những giới hạn mà chúng ta đặt cho bản thân. Nó mang đến một cái nhìn vui nhộn và sâu sắc về con người và khả năng thay đổi.\n\nGraeme Simsion sử dụng ngôn ngữ hài hước và lối viết đáng yêu để tái hiện câu chuyện. Cuốn sách mang đến cho độc giả một trải nghiệm gần gũi và dí dỏm với những mô tả sống động và tình tiết đáng yêu.\n\n\"The Rosie Project\" đã trở thành một tiểu thuyết được yêu thích và tạo nên sự ảnh hưởng tích cực trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, sự khác biệt và sự chấp nhận của bản thân. Nó mang lại niềm vui và cảm hứng cho độc giả với thông điệp về sự đồng cảm và tình người.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F87%2Fthe-rosie-project.jpg?alt=media&token=96ebf77b-38d8-4b28-bf21-e0fc0c9fcaab",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 88,
      "title": "The Tattooist of Auschwitz",
      "author": "Heather Morris",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 288,
      "quantitySold": 57,
      "note": "\"The Tattooist of Auschwitz\" là một tiểu thuyết dựa trên câu chuyện có thật của Lale Sokolov, được viết bởi nhà văn người Úc Heather Morris, xuất bản lần đầu vào năm 2018. Cuốn sách này mang đến một câu chuyện mạnh mẽ và cảm động về sự sống còn, tình yêu và hy vọng trong thời kỳ Holocaust.\n\n\"The Tattooist of Auschwitz\" kể về cuộc đời của Lale Sokolov, một người Do Thái bị giam giữ tại trại tập trung Auschwitz trong Thế chiến II. Lale bị buộc phải thực hiện nhiệm vụ đánh dấu số hiệu trên da của hàng nghìn người tù. Trong quá trình làm việc đó, anh gặp gỡ và yêu thương Gita, một cô gái người Slovakia. Cuộc tình giữa Lale và Gita trở thành nguồn cảm hứng và niềm hy vọng trong tâm hồn anh và hàng ngàn người khác.\n\n\"The Tattooist of Auschwitz\" khám phá về sự đấu tranh, sự kiên nhẫn và lòng nhân ái trong hoàn cảnh tàn khốc. Cuốn sách đặt câu hỏi về sự đức tin, sự tồn tại và sức mạnh của tình yêu. Nó mang đến một cái nhìn sâu sắc và cảm động về sự sống còn và khả năng vượt qua khó khăn.\n\nHeather Morris sử dụng ngôn ngữ chân thực và mô tả tình tiết sắc nét để tái hiện cảnh quan và tâm trạng trong trại tập trung Auschwitz. Cuốn sách mang đến cho độc giả một trải nghiệm đầy cảm xúc và chân thực với những mô tả sắc bén và tình tiết căng thẳng.\n\n\"The Tattooist of Auschwitz\" đã trở thành một tiểu thuyết ăn khách và tạo nên một ảnh hưởng mạnh mẽ trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về sự sống còn, tình yêu và hy vọng trong bối cảnh đau thương. Nó lan tỏa thông điệp về sự kiên cường và lòng nhân ái, khuyến khích độc giả suy ngẫm về quyền tự do và giá trị cuộc sống.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F88%2Fthe-tattooist-of-auschwitz.jpg?alt=media&token=ef5a761e-cb0d-4880-a78c-ec718e53a0ae",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 89,
      "title": "The Light Between Oceans",
      "author": "M.L.Stedman",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 416,
      "quantitySold": 57,
      "note": "\"The Light Between Oceans\" là một tiểu thuyết của nhà văn người Úc M.L. Stedman, xuất bản lần đầu vào năm 2012. Cuốn sách này mang đến một câu chuyện mê đắm và đầy xúc cảm về tình yêu, lương tâm và sự lựa chọn trong cuộc sống.\n\n\"The Light Between Oceans\" kể về Tom Sherbourne, một người lính trở về từ cuộc Chiến tranh Thế giới thứ nhất và được chỉ định làm người trông coi một ngọn hải đăng xa xôi ở Australia. Tom và vợ anh, Isabel, sống trên hòn đảo cô đơn này. Một ngày nọ, họ phát hiện một đứa bé gái bị bỏ rơi trên một chiếc thuyền. Với lòng nhân ái và khát khao làm cha mẹ, họ quyết định nuôi nấng đứa bé như con riêng. Nhưng khi sự thật về nguồn gốc của đứa bé dần hé mở, họ đối mặt với những quyết định đau lòng và hệ quả không thể đo lường.\n\n\"The Light Between Oceans\" khám phá về tình yêu, lương tâm và trách nhiệm. Cuốn sách đặt câu hỏi về sự chính trực, lòng nhân ái và hậu quả của sự lựa chọn. Nó mang đến một cái nhìn sâu sắc và đa chiều về những mâu thuẫn đạo đức và sự đau khổ của con người.\n\nM.L. Stedman sử dụng ngôn ngữ tinh tế và mô tả tươi sáng để tái hiện cảnh quan và tâm trạng của đảo xa xôi và cuộc sống biển. Cuốn sách mang đến cho độc giả một trải nghiệm mê hoặc và đầy cảm xúc với những mô tả sắc nét và tình tiết đầy căng thẳng.\n\n\"The Light Between Oceans\" đã trở thành một tiểu thuyết đáng chú ý và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, trách nhiệm và sự tha thứ. Nó khơi gợi cảm xúc và thách thức độc giả suy ngẫm về giá trị cuộc sống và quyết định đạo đức của chúng ta.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F89%2Fthe-light-between-oceans.jpg?alt=media&token=e0d8d199-b3db-4850-87e9-6a573e0a78d0",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 210,
      "votes": 52
    },
    {
      "id": 90,
      "title": "The Seven Husbands of Evelyn Hugo",
      "author": "Taylor Jenkins Reid",
      "category": "Romance",
      "releaseDate": "2022-08-01",
      "pages": 400,
      "quantitySold": 57,
      "note": "\"The Seven Husbands of Evelyn Hugo\" là một tiểu thuyết của nhà văn người Mỹ Taylor Jenkins Reid, xuất bản lần đầu vào năm 2017. Cuốn sách này mang đến một câu chuyện sôi động và đầy sự nghi ngờ về tình yêu, quyền lực và sự tự do cá nhân.\n\n\"The Seven Husbands of Evelyn Hugo\" kể về cuộc đời của Evelyn Hugo, một ngôi sao điện ảnh nổi tiếng trong thời kỳ vàng của Hollywood. Evelyn, lúc này đã già và muốn kể lại câu chuyện của mình qua một cuốn sách. Cô chỉ chọn một phóng viên trẻ tên là Monique Grant để viết cuốn tự truyện. Trong quá trình đó, Monique khám phá về sự sắc sảo, quyền lực và bí mật đen tối của cuộc sống và sự nghiệp của Evelyn Hugo.\n\n\"The Seven Husbands of Evelyn Hugo\" khám phá về tình yêu, sự đấu tranh và tìm kiếm sự thực về bản thân. Cuốn sách đặt câu hỏi về quyền lực, nhân vật công chúng và ý nghĩa của cuộc sống. Nó mang đến một cái nhìn sắc nét và phức tạp về tình yêu, quyền lực và sự đa dạng trong tình huống con người.\n\nTaylor Jenkins Reid sử dụng ngôn ngữ sắc sảo và mô tả chi tiết để tái hiện cảnh quan và tâm trạng của Hollywood trong thập kỷ 1950 và 1960. Cuốn sách mang đến cho độc giả một trải nghiệm hấp dẫn và sống động với những mô tả tinh tế và tình tiết gây cấn.\n\n\"The Seven Husbands of Evelyn Hugo\" đã trở thành một tiểu thuyết ăn khách và tạo nên một ảnh hưởng sâu sắc trong văn chương và văn hóa đại chúng. Cuốn sách đưa ra những suy nghĩ về tình yêu, quyền lực và sự tự do cá nhân. Nó khám phá các khía cạnh phức tạp của con người và tầm quan trọng của việc chấp nhận và sống đúng với chính mình.",
      "cover": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/covers%2F90%2Fthe-seven-husbands-of-evelyn-hugo.jpg?alt=media&token=0b20c719-33ba-49d5-a106-86cc554fedb2",
      "price": 295700,
      "saleOff": 0.13,
      "stars": 214,
      "votes": 53
    }
  ],
  "categories": [
    {
      "id": 1,
      "category": "Adventure stories"
    },
    {
      "id": 2,
      "category": "Classics"
    },
    {
      "id": 3,
      "category": "Crime"
    },
    {
      "id": 4,
      "category": "Fairy tales, fables, and folk tales"
    },
    {
      "id": 5,
      "category": "Fantasy"
    },
    {
      "id": 6,
      "category": "Historical fiction"
    },
    {
      "id": 7,
      "category": "Horror"
    },
    {
      "id": 8,
      "category": "Humour and satire"
    },
    {
      "id": 9,
      "category": "Literary fiction"
    },
    {
      "id": 10,
      "category": "Mystery"
    },
    {
      "id": 11,
      "category": "Poetry"
    },
    {
      "id": 12,
      "category": "Plays"
    },
    {
      "id": 13,
      "category": "Romance"
    },
    {
      "id": 14,
      "category": "Science fiction"
    },
    {
      "id": 15,
      "category": "Short stories"
    },
    {
      "id": 16,
      "category": "War"
    },
    {
      "id": 17,
      "category": "Women’s fiction"
    },
    {
      "id": 18,
      "category": "Young adult"
    },
    {
      "id": 19,
      "category": "Autobiography and memoir"
    },
    {
      "id": 20,
      "category": "Biography"
    },
    {
      "id": 21,
      "category": "Essays"
    },
    {
      "id": 22,
      "category": "Non-fiction novel"
    },
    {
      "id": 23,
      "category": "Self-help"
    }
  ],
  "comments": [
    {
      "id": 1,
      "contents": [
        {
          "contentID": 1689135062880,
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "name": "Đỗ Nam",
          "commentTime": "11:11:02 12/07/2023",
          "comment": "vien dep trai qua xa"
        }
      ]
    },
    {
      "id": 2,
      "contents": []
    },
    {
      "id": 3,
      "contents": []
    },
    {
      "id": 4,
      "contents": []
    },
    {
      "id": 5,
      "contents": []
    },
    {
      "id": 6,
      "contents": []
    },
    {
      "id": 7,
      "contents": []
    },
    {
      "id": 8,
      "contents": []
    },
    {
      "id": 9,
      "contents": []
    },
    {
      "id": 10,
      "contents": []
    },
    {
      "id": 11,
      "contents": []
    },
    {
      "id": 12,
      "contents": []
    },
    {
      "id": 13,
      "contents": []
    },
    {
      "id": 14,
      "contents": []
    },
    {
      "id": 15,
      "contents": []
    },
    {
      "id": 16,
      "contents": []
    },
    {
      "id": 17,
      "contents": []
    },
    {
      "id": 18,
      "contents": []
    },
    {
      "id": 19,
      "contents": []
    },
    {
      "id": 20,
      "contents": []
    },
    {
      "id": 21,
      "contents": []
    },
    {
      "id": 22,
      "contents": []
    },
    {
      "id": 23,
      "contents": []
    },
    {
      "id": 24,
      "contents": []
    },
    {
      "id": 25,
      "contents": []
    },
    {
      "id": 26,
      "contents": []
    },
    {
      "id": 27,
      "contents": []
    },
    {
      "id": 28,
      "contents": []
    },
    {
      "id": 29,
      "contents": []
    },
    {
      "id": 30,
      "contents": []
    },
    {
      "id": 31,
      "contents": []
    },
    {
      "id": 32,
      "contents": []
    },
    {
      "id": 33,
      "contents": []
    },
    {
      "id": 34,
      "contents": []
    },
    {
      "id": 35,
      "contents": []
    },
    {
      "id": 36,
      "contents": []
    },
    {
      "id": 37,
      "contents": []
    },
    {
      "id": 38,
      "contents": []
    },
    {
      "id": 39,
      "contents": []
    },
    {
      "id": 40,
      "contents": []
    },
    {
      "id": 41,
      "contents": []
    },
    {
      "id": 42,
      "contents": []
    },
    {
      "id": 43,
      "contents": []
    },
    {
      "id": 44,
      "contents": []
    },
    {
      "id": 45,
      "contents": []
    },
    {
      "id": 46,
      "contents": []
    },
    {
      "id": 47,
      "contents": []
    },
    {
      "id": 48,
      "contents": []
    },
    {
      "id": 49,
      "contents": []
    },
    {
      "id": 50,
      "contents": []
    },
    {
      "id": 51,
      "contents": []
    },
    {
      "id": 52,
      "contents": []
    },
    {
      "id": 53,
      "contents": []
    },
    {
      "id": 54,
      "contents": []
    },
    {
      "id": 55,
      "contents": []
    },
    {
      "id": 56,
      "contents": []
    },
    {
      "id": 57,
      "contents": []
    },
    {
      "id": 58,
      "contents": []
    },
    {
      "id": 59,
      "contents": []
    },
    {
      "id": 60,
      "contents": []
    },
    {
      "id": 61,
      "contents": []
    },
    {
      "id": 62,
      "contents": []
    },
    {
      "id": 63,
      "contents": []
    },
    {
      "id": 64,
      "contents": []
    },
    {
      "id": 65,
      "contents": []
    },
    {
      "id": 66,
      "contents": []
    },
    {
      "id": 67,
      "contents": []
    },
    {
      "id": 68,
      "contents": []
    },
    {
      "id": 69,
      "contents": []
    },
    {
      "id": 70,
      "contents": []
    },
    {
      "id": 71,
      "contents": []
    },
    {
      "id": 72,
      "contents": []
    },
    {
      "id": 73,
      "contents": []
    },
    {
      "id": 74,
      "contents": []
    },
    {
      "id": 75,
      "contents": []
    },
    {
      "id": 76,
      "contents": []
    },
    {
      "id": 77,
      "contents": []
    },
    {
      "id": 78,
      "contents": []
    },
    {
      "id": 79,
      "contents": []
    },
    {
      "id": 80,
      "contents": []
    },
    {
      "id": 81,
      "contents": []
    },
    {
      "id": 82,
      "contents": []
    },
    {
      "id": 83,
      "contents": []
    },
    {
      "id": 84,
      "contents": []
    },
    {
      "id": 85,
      "contents": []
    },
    {
      "id": 86,
      "contents": []
    },
    {
      "id": 87,
      "contents": []
    },
    {
      "id": 88,
      "contents": []
    },
    {
      "id": 89,
      "contents": []
    },
    {
      "id": 90,
      "contents": []
    }
  ],
  "rates": [
    {
      "id": 1,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 2,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 3,
      "list": []
    },
    {
      "id": 4,
      "list": []
    },
    {
      "id": 5,
      "list": []
    },
    {
      "id": 6,
      "list": []
    },
    {
      "id": 7,
      "list": []
    },
    {
      "id": 8,
      "list": []
    },
    {
      "id": 9,
      "list": []
    },
    {
      "id": 10,
      "list": []
    },
    {
      "id": 11,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 12,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 13,
      "list": []
    },
    {
      "id": 14,
      "list": []
    },
    {
      "id": 15,
      "list": []
    },
    {
      "id": 16,
      "list": []
    },
    {
      "id": 17,
      "list": []
    },
    {
      "id": 18,
      "list": []
    },
    {
      "id": 19,
      "list": []
    },
    {
      "id": 20,
      "list": []
    },
    {
      "id": 21,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 22,
      "list": []
    },
    {
      "id": 23,
      "list": []
    },
    {
      "id": 24,
      "list": []
    },
    {
      "id": 25,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 3
        }
      ]
    },
    {
      "id": 26,
      "list": []
    },
    {
      "id": 27,
      "list": []
    },
    {
      "id": 28,
      "list": []
    },
    {
      "id": 29,
      "list": []
    },
    {
      "id": 30,
      "list": []
    },
    {
      "id": 31,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 32,
      "list": []
    },
    {
      "id": 33,
      "list": []
    },
    {
      "id": 34,
      "list": []
    },
    {
      "id": 35,
      "list": []
    },
    {
      "id": 36,
      "list": []
    },
    {
      "id": 37,
      "list": []
    },
    {
      "id": 38,
      "list": []
    },
    {
      "id": 39,
      "list": []
    },
    {
      "id": 40,
      "list": []
    },
    {
      "id": 41,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 42,
      "list": []
    },
    {
      "id": 43,
      "list": []
    },
    {
      "id": 44,
      "list": []
    },
    {
      "id": 45,
      "list": []
    },
    {
      "id": 46,
      "list": []
    },
    {
      "id": 47,
      "list": []
    },
    {
      "id": 48,
      "list": []
    },
    {
      "id": 49,
      "list": []
    },
    {
      "id": 50,
      "list": []
    },
    {
      "id": 51,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 52,
      "list": []
    },
    {
      "id": 53,
      "list": []
    },
    {
      "id": 54,
      "list": []
    },
    {
      "id": 55,
      "list": []
    },
    {
      "id": 56,
      "list": []
    },
    {
      "id": 57,
      "list": []
    },
    {
      "id": 58,
      "list": []
    },
    {
      "id": 59,
      "list": []
    },
    {
      "id": 60,
      "list": []
    },
    {
      "id": 61,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 62,
      "list": []
    },
    {
      "id": 63,
      "list": []
    },
    {
      "id": 64,
      "list": []
    },
    {
      "id": 65,
      "list": []
    },
    {
      "id": 66,
      "list": []
    },
    {
      "id": 67,
      "list": []
    },
    {
      "id": 68,
      "list": []
    },
    {
      "id": 69,
      "list": []
    },
    {
      "id": 70,
      "list": []
    },
    {
      "id": 71,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 72,
      "list": []
    },
    {
      "id": 73,
      "list": []
    },
    {
      "id": 74,
      "list": []
    },
    {
      "id": 75,
      "list": []
    },
    {
      "id": 76,
      "list": []
    },
    {
      "id": 77,
      "list": []
    },
    {
      "id": 78,
      "list": []
    },
    {
      "id": 79,
      "list": []
    },
    {
      "id": 80,
      "list": []
    },
    {
      "id": 81,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 82,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 83,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    },
    {
      "id": 84,
      "list": []
    },
    {
      "id": 85,
      "list": []
    },
    {
      "id": 86,
      "list": []
    },
    {
      "id": 87,
      "list": []
    },
    {
      "id": 88,
      "list": []
    },
    {
      "id": 89,
      "list": []
    },
    {
      "id": 90,
      "list": [
        {
          "uid": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
          "star": 4
        }
      ]
    }
  ],
  "carts": [
    {
      "id": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
      "books": [
        {
          "bookID": 3,
          "quantity": 2
        },
        {
          "bookID": 1,
          "quantity": 3
        },
        {
          "bookID": 29,
          "quantity": 6
        },
        {
          "bookID": 83,
          "quantity": 1
        }
      ]
    }
  ],
  "users": [
    {
      "id": "aD3brbzPq5gJ3SbswksiR5ZCUwy1",
      "firstName": "Đỗ",
      "lastName": "Viên",
      "telephone": "0919904032",
      "avatar": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/avatars%2FaD3brbzPq5gJ3SbswksiR5ZCUwy1%2Favatar.png?alt=media&token=f00b8172-0439-47f3-824e-ab42904142cc",
      "email": "doducvien26092002@gmail.com",
      "birthday": "2002-09-26"
    },
    {
      "id": "06bnkKiOT4XX3mPrDY8MpcSrZMW2",
      "firstName": "Nguyễn",
      "lastName": "Nam",
      "avatar": "https://firebasestorage.googleapis.com/v0/b/library-cb5ed.appspot.com/o/avatars%2F06bnkKiOT4XX3mPrDY8MpcSrZMW2%2Fbackground1.jpg?alt=media&token=54dea391-01fd-4427-b2e9-572e03cdf30a"
    }
  ]
}